[
    {
        "sr_no": 2,
        "newspaper": "kashmir Times",
        "headline": "Army jawan killed as Pak targets Indian posts, villages in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93161",
        "brief": "SUNDERBANI, Jul 30: An army jawan was killed as Pakistani troops violated the ceasefire for the third consecutive day and resorted to firing and shelling along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Tuesday.\r\n“The Pakistan army resorted t...",
        "date": "7/31/2019 11:08:18 PM",
        "detailed_news": "SUNDERBANI, Jul 30: An army jawan was killed as Pakistani troops violated the ceasefire for the third consecutive day and resorted to firing and shelling along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Tuesday.“The Pakistan army resorted to unprovoked ceasefire violation along the LoC in Sunderbani sector of Rajouri district today,” PRO Defence Lt Col Devender Anand said.He said the Indian army responded strongly and effectively. “Heavy damage to Pakistan army posts and casualties to Pakistani soldiers were inflicted by our troops. However in the exchange of fire, Naik Krishan Lal (34) was martyred,” Lt Col Anand said.LT Col Anand described Lal as a “brave, highly motivated and sincere” soldier. “The nation will always remain indebted to him for his supreme sacrifice and devotion to duty. Naik Krishan Lal hailed from Akhnoor 's Gagriyal village. He is survived by his wife Shashi Devi,” he said.This is the third such violation in as many days. On Monday, Pakistani troops had resorted to unprovoked firing and shelling along the LoC in Mankote and Shahpur sectors of Poonch district.A 10-day-old baby was killed and two persons injured in heavy shelling by Pakistan along the LoC in Shahpur sector of Poonch district on Sunday.In the meanwhile, army sources said that two Pakistani soldiers were gunned down in retaliatory action by the Indian army when the neighbouring country violated ceasefire in Tangdhar-Keran sector. However two civilians were injured in Jabdi, Tangdhar in cross LoC firing."
    },
    {
        "sr_no": 5,
        "newspaper": "kashmir Times",
        "headline": "Pak shells villages, border posts in Poonch on 2nd day",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93118",
        "brief": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.\r\nIndian side also r...",
        "date": "7/30/2019 3:53:20 PM",
        "detailed_news": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.Indian side also retaliated in equal measure. Two sides traded heavy fire till late afternoon.In the meanwhile, around 15-day infant, who had sustained critical splinter injuries in his abdomen along with his mother and another civilian in Pak shelling in Shahpur sector Sunday evening, succumbed to his injuries in Poonch District Hospital this morning. This afternoon, Deputy Commissioner Rahul Yadav also presented cash relief to persons injured in recent cross border firing.Army sources said, “Pakistani army violated ceasefire in Shahpur sector of Poonch this afternoon. Indian army retaliated with equal calibre and exchange of fire continued till 3.50 PM.”PRO Defence Devender Anand said, “At about 1245 hours, Pakistan initiated unprovoked ceasefire violation starting with firing of small arms followed by shelling with mortars along LoC in Shahpur sector (J&K). Indian army retaliated befittingly.”The army spokesperson said information on casualties on the Pakistani side in the retaliatory action was not immediately available.In the meanwhile, around 15-day old infant, who had sustained critical abdominal splinter injuries during heavy shelling by Pakistani troops along the Line of Control (LoC) in Shahpur sector of Poonch district Sunday evening, died at Poonch District hospital on Monday, a police official said.The infant, his mother Fatima Jan (35) and another civilian Mohammad Arif (40) were injured when mortar shells fired by Pakistan hit their village in Shahpur sector late Sunday evening. They were rushed to district hospital Poonch, where the minor succumbed to injuries this morning, he added.He said Jan and Arif were referred to the Government Medical College Hospital, Jammu, for specialised treatment where their condition was stated to be stable. The baby, however, was kept under observation in Poonch district hospital, where he breathed his last.Later this afternoon, Deputy Commissioner Rahul Yadav  presented cash relief to persons injured in recent cross border firing. He met the injured undergoing treatment at the District Hospital and inquired about their condition directed the doctors to provide them best possible treatment. The Deputy Commissioner provided a relief assistance of Rs 10,000 each to the injured out of Red Cross fund.Mortars and small arms were used from across the border to target forward posts and villages in Shahpur, Sawjian and Mendhar sectors between 5 PM and 10 PM on Sunday. Several houses were also damaged in the firing, the official said.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was injured in another incident of cross-border firing by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 7,
        "newspaper": "kashmir Times",
        "headline": "Pak shells Poonch villages, border posts",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93100",
        "brief": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district...",
        "date": "7/29/2019 11:05:01 PM",
        "detailed_news": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district on Sunday eveningPolice said that the Pakistan army resorted to heavy shelling targetting Indian forward posts and civilian areas at Shahpur, Mankote and Sawjian thus leading to heavy exchange of fire from both sides in these sectors.“In Pak shelling, three civilian namely Fatima Jan, 35, wife of Mohammed Qasim resident of Shahpur, her around 15-day old child and Mohammed Arif,33, son of Mohammed Sayeed, also resident of Shahpur were injured. All three injured were rushed to District Hospital Poonch from where Fatima Jan and Mohammed Sayeed were referred to Government Medical College hospital, Jammu. However, the infant, who too had sustained critical injuries in his abdomen, was being treated in Poonch hospital,” Medical Superintendent District Hospital Poonch Shamim-Ul-Nisa told KTNS.   Meanwhile Sarpanch Najab Din said that some shells landed into residential areas at Shahpur . In the incident, two residential houses got damaged and three civilians including mother-child duo sustained injuries. Sarpanch added, “As the heavy shelling continued in the area, it's not possible to assess the exact loss of life and property.”Earlier SSP Poonch Ramesh Kumar Angral, while confirming heavy shelling in border areas of Shahpur, Mankote, Sawjian, said, “ Pakistan army targetted not only army posts on the Line of Control but also civilian population. Some shells landed into residential areas as well. As a result, three civilians were injured. All three injured were immediately shifted to District Hospital Poonch for treatment. Indian army was also responding to the shelling effectively.”DC Poonch Rahul Yadav, who himself was camping at District Hospital Poonch, told reporters that the condition of infant was critical as he too had sustained splinter injury in his abdomen. “He was not referred to GMC, Jammu given his condition. The doctors here are trying to stabilise his condition. That’s the priority. The administration is providing all required assistance to the victims.”  Defence PRO Devender Anand said, “Today at about 1700 hours Pak initiated unprovoked ceasefire violation by firing  of small arms and intense shelling with mortars along LoC in Shahpur and Sawjian sectors in district Poonch. Indian army is retaliating befittingly.”Besides Shahpur, Sawjian, Mankote, the two sides also traded fire along the LoC in Mendhar and Krishna Ghati sectors. Few houses in these areas also got damaged during shelling, reports said.In Sawjian sector, the house of Amna Bi, widow of Said Mohammed Khan, resident of Sawjian was also damaged partially. Heavy shelling continued till the last reports poured in. The cross-border firing by Pakistan has ended a five-day lull in the border skirmishes between India and Pakistan armies.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was also injured in another incident of ceasefire violation by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 17,
        "newspaper": "Greater Times",
        "headline": "Security forces launch search operation in Rajouri",
        "link": "https://www.greaterkashmir.com/news/pir-panjal/security-forces-launch-search-operation-in-rajouri/?utm_source=rss&utm_medium=rss&utm_campaign=security-forces-launch-search-operation-in-rajouri",
        "brief": "",
        "date": "Wed, 31 Jul 2019 19:58:12 +0000",
        "detailed_news": "Security forces on Wednesday launched a search operation in Kalsian area of Nowshera in Rajouri district of Jammu and Kashmir. A police official said that two suspects were seen moving in the area located close to Line of Control following which joint teams of army and police rushed to the spot. SDPO Nowshera, Brijesh Sharma<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/pir-panjal/security-forces-launch-search-operation-in-rajouri/\">Read More</a>"
    },
    {
        "sr_no": 20,
        "newspaper": "Greater Times",
        "headline": "2 students rescued from flash flood in Mendhar",
        "link": "https://www.greaterkashmir.com/news/chenab-valley/2-students-rescued-from-flash-flood-in-mendhar/?utm_source=rss&utm_medium=rss&utm_campaign=2-students-rescued-from-flash-flood-in-mendhar",
        "brief": "",
        "date": "Wed, 31 Jul 2019 19:53:21 +0000",
        "detailed_news": "Army and locals rescued two students who got trapped in flash flood in Chatral river of Mendhar town on Wednesday. As per eyewitnesses, some students were crossing Chatral River near Government Higher Secondary School when two of them got trapped in the swollen river water. “Some army personnel and locals, who spotted the students trapped<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/chenab-valley/2-students-rescued-from-flash-flood-in-mendhar/\">Read More</a>"
    },
    {
        "sr_no": 21,
        "newspaper": "Greater Times",
        "headline": "Dhoni joins Army in south Kashmir on 2-week stint",
        "link": "https://www.greaterkashmir.com/news/kashmir/dhoni-joins-army-in-south-kashmir-on-2-week-stint/?utm_source=rss&utm_medium=rss&utm_campaign=dhoni-joins-army-in-south-kashmir-on-2-week-stint",
        "brief": "",
        "date": "Wed, 31 Jul 2019 19:46:33 +0000",
        "detailed_news": "Mahendra Singh Dhoni, an honorary lieutenant colonel in the Territorial Army, joined Army troops in south Kashmir region on Wednesday to carry out patrolling, guard duties and similar responsibilities just like other soldiers. The former Indian cricket team captain will be staying with his 106 TA Battalion (Para) till August 15 and under take duties<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/kashmir/dhoni-joins-army-in-south-kashmir-on-2-week-stint/\">Read More</a>"
    },
    {
        "sr_no": 28,
        "newspaper": "Hindustan Times",
        "headline": "Six dead as heavy rain batters Vadodara, airport shut, army on standby",
        "link": "https://www.hindustantimes.com/india-news/six-dead-as-heavy-rain-batters-vadodara-airport-shut-army-on-standby/story-0x0Kj7Qdn351QTFFuVpKJP.html",
        "brief": "",
        "date": "Thu, 01 Aug 2019 02:14:30 GMT ",
        "detailed_news": "With rising water level in Ajwa river, two platoons of army are on stand by to oversee rescue and relief operations, if required."
    },
    {
        "sr_no": 42,
        "newspaper": "Hindustan Times",
        "headline": "Six dead as heavy rain batters Vadodara, airport shut, army on standby",
        "link": "https://www.hindustantimes.com/india-news/six-dead-as-heavy-rain-batters-vadodara-airport-shut-army-on-standby/story-0x0Kj7Qdn351QTFFuVpKJP.html",
        "brief": "",
        "date": "Thu, 01 Aug 2019 02:41:29 GMT ",
        "detailed_news": "With rising water level in Ajwa river, two platoons of army are on stand by to oversee rescue and relief operations, if required. "
    },
    {
        "sr_no": 75,
        "newspaper": "Tribune",
        "headline": "Talks with US on Afghan endgame today",
        "link": "https://tribune.com.pk/story/2025499/1-talks-us-afghan-endgame-today/",
        "brief": "",
        "date": "August 1, 2019",
        "detailed_news": [
            "ISLAMABAD: Pakistan and the US is going to hold a crucial round of talks in the federal capital today (Thursday) to discuss the ongoing Afghan peace process which, officials believe, entered a decisive phase.",
            "US special representative for peace in Afghanistan, Zalmay Khalilzad, along with senior officials are scheduled to meet Pakistani civil and military authorities to review the progress in the Afghan peace talks, officials told The Express Tribune on Wednesday.",
            "Khalilzad is traveling to Islamabad as a follow-up of the recent visit by Prime Minister Imran Khan to Washington where he had assured President Donald Trump that Pakistan would do ‘whatever in its power’ to facilitate the Afghan peace process.",
            "The US, it is said, has requested Pakistan to persuade the Afghan Taliban to declare a permanent ceasefire and hold intra-Afghan dialogue.",
            "Talks between Pakistan and the US are taking place amid reports that the Trump administration is close to signing an MoU with the Taliban during the upcoming talks in Doha.",
            "The MoU is reportedly about the timeframe for the US troop withdrawal from Afghanistan and the Taliban guarantees of not allowing the Afghan soil to be ever used again by terrorist groups such as Al Qaeda.",
            "Khalilzad, who so far held eight rounds of talks with the Taliban in Doha, was in Kabul this week to take the Afghan government on board about the possible MoU the US is planning to sign with the Taliban.",
            "Khalilzad is due to travel to Doha soon to hold another round of negotiations with the Taliban. But before that he has decided to make a stopover in Islamabad on his way to Doha.",
            "“I’m off to Doha, with a stop in Islamabad. In Doha, if the Taliban do their part, we will do ours, and conclude the agreement we have been working on,” Khalilzad tweeted.",
            "“Wrapping up my most productive visit to #Afghanistan since I took this job as Special Rep. The US and Afghanistan have agreed on next steps. And a negotiating team and technical support group are being finalized,” he added.",
            "Reports suggest that once the US and the Taliban agreed on a framework for the troop withdrawal, the next phase would focus on the intra-Afghan dialogue and seeking a permanent ceasefire in Afghanistan.",
            "Last week, an Afghan minister announced that a 15-member government delegation would be soon meeting the Taliban in some European country in first direct talks with the insurgents.",
            "The Taliban; however, were quick to reject the claims, insisting that they would only enter into talks with other Afghan rival groups — including the Ghani administration — once the deal with the US was struck.",
            "Given that now the Taliban and the US are close to signing a deal, it is likely that the insurgent groups will go ahead meeting the Afghan government’s delegation in Oslo next week.",
            "The official sources said Pakistan as a responsible country was playing a constructive role in facilitating the peace process.",
            "But Pakistan is also treading a careful path as Foreign Minister Shah Mehmood Qureshi clarified the other day that Islamabad would only facilitate but not become a guarantor in the Afghan peace deal."
        ]
    },
    {
        "sr_no": 76,
        "newspaper": "Tribune",
        "headline": "Pakistan Army stands by Saudi military, reiterates Gen Qamar",
        "link": "https://tribune.com.pk/story/2025415/1-pakistan-army-stands-saudi-military-fields-gen-qamar/",
        "brief": "",
        "date": "July 31, 2019",
        "detailed_news": [
            "Chief of Army Staff (COAS) General Qamar Javed Bajwa has reiterated the resolve of Pakistan Army to cooperate with the Saudi armed forces in all fields of mutual interest.",
            "“Pakistan Army stands by Saudi armed forces in all fields,” he said while meeting Saudi Media Minister Turki bin Abdullah Al Shabanah and Military Adviser to KSA’s Defence Minister Major General Talal Abdullah Alotaibi at the General Headquarters in Rawalpindi on Wednesday.",
            "Saudi Arabia’s Ambassador to Pakistan Nawaf Saeed al Maliky was also present during the meeting, according to the Inter-Services Public Relations (ISPR).",
            "“Regional security situation and matters of mutual interest discussed. The COAS said that both countries have history of defence cooperation which Pakistan greatly values,” the military media wing added in a statement.",
            "Pakistan, Saudi Arabia to expand bilateral ties in diverse fields",
            "Gen Qamar also offered condolences on the death of Prince Bandar Bin Abdul Aziz Al-Saud on the occasion.",
            "Earlier in the day, the Saudi media minister met Foreign Minister Shah Mahmood Qureshi in Islamabad, where the two countries agreed to expand bilateral cooperation in the fields of information and culture.",
            "Speaking on the occasion, the foreign minister termed the establishment of Pak-Saudi Supreme Coordination Council an important step toward promotion of political, economic and cultural cooperation between the two countries.",
            "Qureshi also thanked the Saudi government for increasing Hajj quota for Pakistan to 200,000."
        ]
    },
    {
        "sr_no": 77,
        "newspaper": "Tribune",
        "headline": "Nine of a family among Pindi crash victims",
        "link": "https://tribune.com.pk/story/2024911/1-nine-family-among-pindi-crash-victims/",
        "brief": "",
        "date": "July 31, 2019",
        "detailed_news": [
            "RAWALPINDI: For Muhammad Khan and Abdul Hameed, the night of July 29 will remain seared in their memories as the nightmare during which the brothers lost nine members of their joint family.",
            "Along with the devastated family, five other people were killed and another nine were injured when a small military plane on a training mission crashed in a ‘built-up’ area in the Kantrali village of Mora Kalu early on Tuesday morning.",
            "The fuel tank of the aircraft exploded soon after impact, setting off a fire that damaged five houses and reduced two shanties to ashes.",
            "Firdous, a local, said that such was the intensity of the fire that hours after firefighters had put the flames out, they could still feel the heat radiating from the burnt, smoking structures.",
            "Rescue 1122 officials said that they had pulled as many as nine bodies from a single house, three from another and two — including a woman and a  child — from a shanty.",
            "This was corroborated by the Sihala police who said that the nine bodies pulled from one house belonged to the family of Abdul Hameed.",
            "The bodies were identified as Hameed’s wife Fatima, his 14-year-old son Abdul Hafeez, daughters three-year-old Uzma, three-year-old Raheela, and a year-old-toddler Faizan. Rescue workers also pulled the bodies of Hameed’s mother-in-law Parri Bibi, his 22-year-old brother-in-law Muhammad Shabbir, and his three-year-old daughter Faiza.",
            "Three bodies pulled from the second house belonged to the family of 26-year-old Muhammad Jamil. Rescue workers also recovered the body of his 20-year-old wife Robina and four-year-old son Zohaib.",
            "A further two bodies were pulled from Shamsuddin’s shanty, including that of his wife and son Abdul Rauf.",
            "Of those injured, officials at the burns ward of the Holy Family Hospital in Rawalpindi said that 13-year-old Iqra Hameed, 30-year-old Shamim Kabeer and 26-year-old Nadeem Ghulam Fareed had suffered severe burns of 100%, 76% and 50% respectively.",
            "Others who suffered burns included 25-year-old Surayya Nadeem — 26%, 70-year-old Nazeer Kareem — 15%, 12-year-old Wasem Nazeer and 42-year-old Fatima Nazeer suffered two per cent burns on their bodies.",
            "In mourning",
            "As the sun rose on Tuesday morning, the sleepy village was in mourning.",
            "Relatives and villagers gathered in hastily-set-up enclosures consoling family members and survivors. Sabar Jaan, who lost three members of her family including her son, daughter-in-law, and a child in the crash while suffering injuries to her left arm wailed inconsolably.",
            "Most of the victims worked medial jobs in the nearby private housing scheme and commercial areas.",
            "Later on Tuesday evening, 10 of the victims were laid to rest. Wrapped in the national flag, their coffins were taken to the graveyard in Dhoke Awan.",
            "A large number of residents, government officials and military personnel participated in the funeral prayers.",
            "Tough security measures were adopted for the funeral.",
            "Later, Hameed, who had survived the crash but lost nine members of his family, lodged a complaint with the Sihala police to register a first information report for the incident.",
            "Hospitals on alert",
            "As word spread about the plane crash on the outskirts of the garrison city, all the three tertiary care hospitals in the city, including HFH, Benazir Bhutto General Hospital (BBH) and District Headquarters Hospital (DHQ) were put on high alert. All medical and paramedical staff were also summoned to the hospital. Owing to the nature of injuries, most of the injured were brought to the burns ward at HFH while some were sent to DHQ.",
            "Even though no casualty was brought to BBH, the hospital’s Medical Superintendent Dr Rafiq Ahmed stayed in the hospital along with his team and coordinated supply of blood.",
            "The hospitals remained on alert until 7am when the critically injured were shifted to the Combined Military Hospital (CMH) for further treatment.",
            "Viral video",
            "Soon after the crash, a video of the incident — showing the exact moment of impact — went viral on social media. However, the short seven-second clip which captured the incident did so purely out of luck.",
            "The video had been shot by a hand embroidery weaver who works near the site of the crash.",
            "The weaver told The Express Tribune that he works at the Rabi Centre in the commercial area located just half a kilometre from the crash site.",
            "“We were busy finishing orders for Eidul Azha. Because it gets warm in our workshop, we take our embroidery frames to top floor where there is a cool breeze and it is easy to work,” he explained.",
            "He added that around 2am, they could hear the loud noise and saw a small aircraft flying quite low over the populace.",
            "Noting that the sight was unusual, the embroiderer said that he and some of his colleagues took out their camera-equipped smartphones and started recording videos.",
            "While others stopped, he managed to turn his camera on at the just the right moment to capture the horrific sight.",
            "Aghast at what they had just seen, the embroiderer said that they immediately rushed inside and informed the authorities.",
            "Published in The Express Tribune, July 31st, 2019."
        ]
    },
    {
        "sr_no": 81,
        "newspaper": "Tribune",
        "headline": "PM Imran's 'official working visit' to US costs only Rs11m to exchequer",
        "link": "https://tribune.com.pk/story/2025326/1-pm-imrans-official-working-visit-us-costs-rs11m-exchequer/",
        "brief": "",
        "date": "August 1, 2019",
        "detailed_news": [
            "KARACHI: With the nation taking keen interest into the official expenses of Prime Minister Imran Khan, the federal government released the costs of his recent three-day trip to the United States on Thursday.",
            "The premier’s maiden visit to Washington was followed by immense fanfare with the government vowing not to follow in the footsteps of former PPP and PML-N regimes when it came to travel and living costs.",
            "PM Imran’s visit cost almost Rs11 million to the national exchequer, which comes down to $67,180, according to the details released by the government.",
            "He took a 27-member delegation on his maiden trip, and flew on a commercial Qatar Airways flight with a stopover in Doha, instead of opting to charter an entire plane.",
            "Rs1.35 million were spent on the hotel expenses for the PM’s delegation with Rs6 million ditched out on their travelling expenses.",
            "Meanwhile, the prime minister gave gifts of Rs142,000 and spent Rs700,000 on tips.",
            "Rs1.3 million were spent on food and refreshments.",
            "He stayed at the Pakistani ambassador’s official residence, and not an expensive hotel during the official visit.",
            "In comparison, according to the government’s claim, former premier Nawaz Sharif had doled out $549,854 during his 2015 trip to the US whereas PPP Supremo Asif Ali Zardari spent $752,682.",
            "Facts speak for themselves! And it does not take spending huge amounts of public money to achieve tangible results for the country as PM IK's successful USA visit demonstrated! pic.twitter.com/dCjzIVE2pa",
            "— Shireen Mazari (@ShireenMazari1) July 31, 2019",
            "The trip was mostly hailed as a major diplomatic win for Islamabad with Trump even offering to mediate the Kashmir dispute between Pakistan and India.",
            "This caught New Delhi off-guard and was unexpected by the media and analysts.",
            "President Trump also reached out to premier Imran for his government to help negotiate a deal with the Taliban to end the longstanding conflict in Afghanistan."
        ]
    },
    {
        "sr_no": 91,
        "newspaper": "Daily Excelsior",
        "headline": "59-yr-old retired General breaks own record at Ironman triathon",
        "link": "https://www.dailyexcelsior.com/59-yr-old-retired-general-breaks-own-record-at-ironman-triathon/",
        "brief": "",
        "date": "Wed, 31 Jul 2019 21:40:25 +0000",
        "detailed_news": "<p>New Delhi, July 31: Retired Major General Vikram Dogra, the first army man to successfully complete an Ironman triathlon, beat his own record at the gruelling event in Germany on July 28. Dogra, 59, beat his earlier record by 41 minutes in his second appearance at the triathlon which was held in Hamburg. In July [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com/59-yr-old-retired-general-breaks-own-record-at-ironman-triathon/\">59-yr-old retired General breaks own record at Ironman triathon</a> appeared first on <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com\">Jammu Kashmir Latest News | Tourism | Breaking News J&amp;K</a>.</p>\n"
    },
    {
        "sr_no": 102,
        "newspaper": "State Times",
        "headline": "Pak troops shell border areas along LoC in Rajouri",
        "link": "http://news.statetimes.in/pak-troops-shell-border-areas-along-loc-in-rajouri-2/",
        "brief": "",
        "date": "Wed, 31 Jul 2019 20:12:48 +0000",
        "detailed_news": "STATE TIMES NEWS Jammu: Pakistani troops on Wednesday opened fire and shelled mortars along the LoC in Rajouri district, officials said. Indian troops gave a befitting reply, resulting in heavy damage to Pakistani Army posts and casualties to Pakistani soldiers, they said. &#8220;At about 0030 hours, the Pakistan Army initiated unprovoked ceasefire violation by firing [&#8230;]"
    },
    {
        "sr_no": 112,
        "newspaper": "Tribune",
        "headline": "Pakistan Army stands by Saudi military, reiterates Gen Qamar",
        "link": "https://tribune.com.pk/story/2025415/1-pakistan-army-stands-saudi-military-fields-gen-qamar/",
        "brief": "",
        "date": "Wed, 31 Jul 2019 18:50:59 +0000",
        "detailed_news": "<p>Saudi media minister and military adviser meet COAS at GHQ</p>\n<p>The post <a rel=\"nofollow\" href=\"https://tribune.com.pk/story/2025415/1-pakistan-army-stands-saudi-military-fields-gen-qamar/\">Pakistan Army stands by Saudi military, reiterates Gen Qamar</a> appeared first on <a rel=\"nofollow\" href=\"https://tribune.com.pk\">The Express Tribune</a>.</p>\n"
    },
    {
        "sr_no": 117,
        "newspaper": "The News",
        "headline": "DG ISPR says ceasefire violations show India’s frustration",
        "link": "https://www.thenews.com.pk/print/506442-dg-ispr-says-ceasefire-violations-show-india-s-frustration",
        "brief": "",
        "date": "Thu, 01 Aug 2019 00:00:00 +0500",
        "detailed_news": "RAWALPINDI: The Director General of the Inter-Services Public Relations (ISPR), Major General Asif Ghafoor, said on Wednesday the increased Indian ceasefire violations indicate their frustration due to failure in the Indian occupied Jammu and Kashmir.In a post on Twitter, the DG ISPR said: &ldquo;Increased Indian Cease Fire Violations (CFVs) indicate their frustration due to failure in IOJ&K. CFVs are being & shall always be effectively responded. Pak Army shall take all measures to protect innocent civilians along LOC from Indian firing deliberately targeting them.&rdquo;His tweet comes after India&rsquo;s unprovoked firing and shelling at the Line of Control on Tuesday resulted in the martyrdom of a Pakistani civilian and caused injuries to nine others, including women and children.The martyred civilian was identified as 26-year-old Nauman, the military&rsquo;s media wing said, adding those who were wounded were shifted to a local hospital.The Indian Army targeted civilian areas in Dana, Dhodial, Lipa, Jora, Shahdara and Shahkot sectors on purpose, the ISPR said, noting that India used mortars and artillery guns in the firing and shelling.Pakistan Army, however, responded effectively to the Indian Army&rsquo;s firing, targeting Indian posts from where the firing was initiated. Pakistan killed three Indian Army officers and wounded multiple others.Many Indian posts were hit by Pakistan Army as well, the ISPR added."
    },
    {
        "sr_no": 120,
        "newspaper": "The News",
        "headline": "Over 30 killed in Afghanistan bus blast",
        "link": "https://www.thenews.com.pk/print/506445-over-30-killed-in-afghanistan-bus-blast",
        "brief": "",
        "date": "Thu, 01 Aug 2019 00:00:00 +0500",
        "detailed_news": "KABUL: At least 32 people including several children have died after a roadside bomb tore through a bus in western Afghanistan.Mohibullah Mohib, spokesman for the police chief in Farah province, said 15 others were wounded with most in critical condition, indicating the death toll could rise. The bus was travelling on a main highway between the western city of Herat and the southern city of Kandahar. No-one immediately claimed responsibility, but Taliban insurgents operate in the region and frequently use roadside bombs to target government officials and security forces. The attack came a day after the UN mission in Afghanistan released a report saying that most civilian deaths in the first half of the year were caused by Afghan forces and their international allies.The report apparently referred to civilians killed during Afghan and US military operations against insurgents. The UN report said 403 civilians were killed by Afghan forces in the first six months of the year and another 314 by international forces, a total of 717.That is compared to 531 killed by the Taliban, an Islamic State affiliate and other militants during the same period. It said 300 of those killed by militants were directly targeted.The UN said the leading cause of civilian deaths and injuries was &ldquo;ground engagements&rdquo;, which caused one in three casualties. Roadside bombs were a close second, accounting for 28 per cent. Afghanistan is one of the most heavily mined countries in the world &mdash; a legacy of decades of war."
    },
    {
        "sr_no": 124,
        "newspaper": "The News",
        "headline": "Three more Kashmiris killed in IHK",
        "link": "https://www.thenews.com.pk/print/506449-three-more-kashmiris-killed-in-ihk",
        "brief": "",
        "date": "Thu, 01 Aug 2019 00:00:00 +0500",
        "detailed_news": "ISLAMABAD: Indian troops in their fresh act of aggression have killed three more Kashmiri youths in the Bandipora district of Indian-held Kashmir (IHK).The Indian troops killed the youths during a violent military operation at Baktur in Gurez area of Bandipora district, the Kashmir Media Service reported on Wednesday.An Indian army officer, confirming the killings, said the operation was still going on in the area. On the other hand, unknown persons hurled a grenade on an Indian police party in Sharifabad area of Tral town. Official sources said the grenade exploded but nobody was hurt in the attack. Soon after the incident, Indian troops cordoned off the area and launched a search to nab the attackers.Meanwhile, the body of a 35-year-old man, Abdul Gani Wagay, was found at Yar Kalampora in Shadimarg area of Pulwama district, on Wednesday."
    }
]