[
    {
        "sr_no": 2,
        "newspaper": "kashmir Times",
        "headline": "Pak shells villages, border posts in Poonch on 2nd day",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93118",
        "brief": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.\r\nIndian side also r...",
        "date": "7/30/2019 3:53:20 PM",
        "detailed_news": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.Indian side also retaliated in equal measure. Two sides traded heavy fire till late afternoon.In the meanwhile, around 15-day infant, who had sustained critical splinter injuries in his abdomen along with his mother and another civilian in Pak shelling in Shahpur sector Sunday evening, succumbed to his injuries in Poonch District Hospital this morning. This afternoon, Deputy Commissioner Rahul Yadav also presented cash relief to persons injured in recent cross border firing.Army sources said, “Pakistani army violated ceasefire in Shahpur sector of Poonch this afternoon. Indian army retaliated with equal calibre and exchange of fire continued till 3.50 PM.”PRO Defence Devender Anand said, “At about 1245 hours, Pakistan initiated unprovoked ceasefire violation starting with firing of small arms followed by shelling with mortars along LoC in Shahpur sector (J&K). Indian army retaliated befittingly.”The army spokesperson said information on casualties on the Pakistani side in the retaliatory action was not immediately available.In the meanwhile, around 15-day old infant, who had sustained critical abdominal splinter injuries during heavy shelling by Pakistani troops along the Line of Control (LoC) in Shahpur sector of Poonch district Sunday evening, died at Poonch District hospital on Monday, a police official said.The infant, his mother Fatima Jan (35) and another civilian Mohammad Arif (40) were injured when mortar shells fired by Pakistan hit their village in Shahpur sector late Sunday evening. They were rushed to district hospital Poonch, where the minor succumbed to injuries this morning, he added.He said Jan and Arif were referred to the Government Medical College Hospital, Jammu, for specialised treatment where their condition was stated to be stable. The baby, however, was kept under observation in Poonch district hospital, where he breathed his last.Later this afternoon, Deputy Commissioner Rahul Yadav  presented cash relief to persons injured in recent cross border firing. He met the injured undergoing treatment at the District Hospital and inquired about their condition directed the doctors to provide them best possible treatment. The Deputy Commissioner provided a relief assistance of Rs 10,000 each to the injured out of Red Cross fund.Mortars and small arms were used from across the border to target forward posts and villages in Shahpur, Sawjian and Mendhar sectors between 5 PM and 10 PM on Sunday. Several houses were also damaged in the firing, the official said.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was injured in another incident of cross-border firing by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 4,
        "newspaper": "kashmir Times",
        "headline": "Pak shells Poonch villages, border posts",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93100",
        "brief": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district...",
        "date": "7/29/2019 11:05:01 PM",
        "detailed_news": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district on Sunday eveningPolice said that the Pakistan army resorted to heavy shelling targetting Indian forward posts and civilian areas at Shahpur, Mankote and Sawjian thus leading to heavy exchange of fire from both sides in these sectors.“In Pak shelling, three civilian namely Fatima Jan, 35, wife of Mohammed Qasim resident of Shahpur, her around 15-day old child and Mohammed Arif,33, son of Mohammed Sayeed, also resident of Shahpur were injured. All three injured were rushed to District Hospital Poonch from where Fatima Jan and Mohammed Sayeed were referred to Government Medical College hospital, Jammu. However, the infant, who too had sustained critical injuries in his abdomen, was being treated in Poonch hospital,” Medical Superintendent District Hospital Poonch Shamim-Ul-Nisa told KTNS.   Meanwhile Sarpanch Najab Din said that some shells landed into residential areas at Shahpur . In the incident, two residential houses got damaged and three civilians including mother-child duo sustained injuries. Sarpanch added, “As the heavy shelling continued in the area, it's not possible to assess the exact loss of life and property.”Earlier SSP Poonch Ramesh Kumar Angral, while confirming heavy shelling in border areas of Shahpur, Mankote, Sawjian, said, “ Pakistan army targetted not only army posts on the Line of Control but also civilian population. Some shells landed into residential areas as well. As a result, three civilians were injured. All three injured were immediately shifted to District Hospital Poonch for treatment. Indian army was also responding to the shelling effectively.”DC Poonch Rahul Yadav, who himself was camping at District Hospital Poonch, told reporters that the condition of infant was critical as he too had sustained splinter injury in his abdomen. “He was not referred to GMC, Jammu given his condition. The doctors here are trying to stabilise his condition. That’s the priority. The administration is providing all required assistance to the victims.”  Defence PRO Devender Anand said, “Today at about 1700 hours Pak initiated unprovoked ceasefire violation by firing  of small arms and intense shelling with mortars along LoC in Shahpur and Sawjian sectors in district Poonch. Indian army is retaliating befittingly.”Besides Shahpur, Sawjian, Mankote, the two sides also traded fire along the LoC in Mendhar and Krishna Ghati sectors. Few houses in these areas also got damaged during shelling, reports said.In Sawjian sector, the house of Amna Bi, widow of Said Mohammed Khan, resident of Sawjian was also damaged partially. Heavy shelling continued till the last reports poured in. The cross-border firing by Pakistan has ended a five-day lull in the border skirmishes between India and Pakistan armies.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was also injured in another incident of ceasefire violation by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 14,
        "newspaper": "kashmir Times",
        "headline": "Civilian injured in Pak shelling in Poonch",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92933",
        "brief": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the se...",
        "date": "7/24/2019 3:07:43 PM",
        "detailed_news": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the second consecutive day on Tuesday.One civilian sustained minor injuries during ceasefire at 20.00 hours. The injured has been identified as Sher Mohd, 45, son of Mohammed Muneer resident of Mohalla  Bahchari Baloni.Defense PRO Lt Col Devender Anand, while confirming ceasefire violation by Pakistan, said, “This afternoon Pakistani army violated ceasefire in Dalhan sector of Poonch district. Indian army retaliated with equal caliber.”“Later Pakistan violated the ceasefire in Krishna Ghati, Mankote & Mendhar sectors of Poonch district. Pak initiated unprovoked ceasefire violation at around 1220 hours along LoC with firing of small arms in Poonch sector. Indian army befittingly retaliated the cross-border firing by the Pakistani army,’ he added.Local army sources said this afternoon at about 12.20 PM, Pakistani army opened indiscriminate fire towards Indian forward posts and civilian areas in Dalhan sector in Haveli. “Heavy mortar shelling was witnessed during ceasefire violation which was retaliated by India in equal measure. Both sides exchanged heavy gun fire and mortar shelling in the area,” Mohammed Sadiq, a local said. “In Pak shelling, two houses in our village were partially damaged. A number of forward LoC locations remained affected due to shelling and civilians were forced to remain inside their houses. The exchange of fire stopped at around 2.55 PM,” he added.Later this afternoon at around 3.25 PM, Pakistani army initiated unprovoked firing and shelling along the LoC in Krishna Ghati, Mankote sectors of Mendhar tehsil of Poonch district. Indian side too retaliated effectively and strongly.This was the third such violation in the past four days which left an army jawan dead and a civilian injured, the officials said. On Monday, Rifleman Mohammad Arif Shafi Alam Khan Pathan was killed in unprovoked firing by Pakistani troops in Sunderbani sector of Rajouri district.A civilian was injured in Pakistani firing in Balnoi village along the LoC in Mendhar sector of Poonch district on Saturday."
    },
    {
        "sr_no": 56,
        "newspaper": "Hindustan Times",
        "headline": "Islamabad must walk the talk on terrorism",
        "link": "https://www.hindustantimes.com/editorials/islamabad-must-walk-the-talk-on-terrorism/story-NkUGvmos7GWjGkNyXm9HSK.html",
        "brief": "",
        "date": "Thu, 25 Jul 2019 02:42:33 GMT ",
        "detailed_news": "Imran Khan must root out the terror infrastructure and prosecute the culprits"
    },
    {
        "sr_no": 57,
        "newspaper": "Dawn",
        "headline": "2 killed, at least 19 injured due to 'carpet bombing' by Indian troops along LoC",
        "link": "https://www.dawn.com/news/1497092/2-killed-at-least-19-injured-due-to-carpet-bombing-by-indian-troops-along-loc",
        "brief": "",
        "date": "Updated July 30, 2019",
        "detailed_news": [
            "Indian troops resorted to what officials described as “carpet bombing” of several civilian populated areas of Azad Jammu and Kashmir (AJK) from across the restive Line of Control (LoC) on Tuesday, killing two civilians and leaving at least 19 others wounded, including six women and a police constable.",
            "Akhtar Ayub, a disaster management officer based in district headquarters Athmuqam, said that Nauman, 25, son of Matiullah and Bisma Bibi, 17, daughter of Ghulam Murtaza, were killed in Sharda and Katha Chogalli villages, in the upper and lower belts of Neelum valley, respectively.",
            "The shelling first began in Leepa valley, located some 100 kilometres southeast of  in Jhelum valley district, at about 12 noon, with Indian troops targeting Batlian and Bijildhaar villages.",
            "Later they expanded the range to the entire valley, targeting the civilian population with mortar guns and rocket launchers, said Waleed Anwar, assistant commissioner of the area.",
            "“In fact it was carpet bombing of the civilian populated areas, he said, adding, Pakistani troops had responded “befittingly.” ",
            "According to a statement issued by the Inter-Services Public Relations (ISPR) a man was killed and nine others, including women and children, were injured due to \"unprovoked firing of mortars and artillery guns\" by Indian forces along the Line of Control.",
            "The Indian troops \"deliberately targeted civilian population in Danna, Dhddnial (sic), Jura, Lipa, Sharda and Shahkot sectors,\" read the statement.",
            "\"[There are] reports of three Indian soldiers dead, many injured, besides damage to Indian posts,\" the statement by the military's media wing added.",
            "Read: Ceasefire violations are making life a living hell for those along the India-Pakistan border",
            "Tuesday’s indiscriminate shelling has pushed the civilian death toll in the current year to 24, including 14 men and 10 women, while another 133 civilians, including 78 males and 55 females, have sustained injuries.",
            "Station House Officer (SHO) of Punjgran, Syed Wajahat Kazmi, said it was the heaviest shelling in this area in almost a decade. ",
            "“For 40 minutes, bombs rained down without pause, causing a scare among the villagers as no one knew where the next shell will strike” said Kazmi. ",
            "He said that according to preliminary reports received, several houses were completely or partially damaged by the shelling. ",
            "A day earlier, officials had reported that a woman lost her life and another five women and two men were wounded in Azad Jammu and Kashmir (AJK) in unrelenting and unprovoked ceasefire violations by Indian troops from across the LoC.",
            "The casualties occurred in Khurshidabad and Neza­pir sectors of Haveli district on Sunday evening, but the information was officially shared with the media on Monday.",
            "Saeed Qureshi, a senior director at State Disaster Management Authority (SDMA), after Monday's reported incident had said that the civilian death toll in the current year has increased to 22, including 13 men and nine women.",
            "Of them, he said, nine have been killed in the Kotli district, six in Haveli district, three in Bhimber district, two in Jhelum Valley district and one each in Neelum Valley and Poonch districts.",
            "About 11 army personnel have also been martyred along the LoC in the ongoing year, Qureshi added.",
            "Around 114 people, including 65 men and 49 women, have been injured, he said. About 36 of the victims hailed from Kotli district, 27 from Poonch district, 24 from Haveli district, 19 from Bhimber district, seven from Jhelum Valley district and one from Neelum Valley district.",
            "Qureshi said that around 18 houses and four shops have been destroyed and 220 houses, one mosque, two schools and five vehicles have been partially damaged.",
            "Villagers have also lost at least 26 cattle heads due to shelling by the Indian forces in the ongoing year, he added. ",
            "Tensions have been running high between India and Pakistan in the wake of a suicide attack on an Indian military convoy in Pulwama district of Indian-occupied Kashmir on February 14, which killed more than 40 paramilitary troops.",
            "In what was the most serious military crisis in South Asia since 2008, Indian and Pakistani warplanes engaged in a dogfight on Feb 27, a day after a raid by Indian jet fighters on what New Delhi said was a militant camp in Pakistan. Islamabad denied any militant camp exists in the area and said the Indian bombs exploded on an empty hillside.",
            "Pakistan downed an Indian plane for violating its airspace and captured its pilot after he ejected in AJK.",
            "The tensions de-escalated after Prime Minister Imran Khan decided to release the Indian pilot as a peace gesture, and following concerted diplomatic efforts by countries including the United States, China and the UAE.",
            "Nevertheless, ceasefire violations along the de-factor border have been occurring regularly."
        ]
    },
    {
        "sr_no": 72,
        "newspaper": "Tribune",
        "headline": "Civilian martyred in unprovoked Indian firing",
        "link": "https://tribune.com.pk/story/2024705/1-civilian-martyred-9-others-injured-indian-fire-along-loc/",
        "brief": "",
        "date": "July 30, 2019",
        "detailed_news": [
            "RAWALPINDI: Ceasefire violations continue unabated by Indian border guards along the Line of Control (LoC) in the disputed Himalayan region of Kashmir.",
            "Indian forces Tuesday evening fired mortars and artillery at the civilian population on the Pakistani side of the LoC without any provocation, the Inter-Services Public Relations (ISPR) said in a statement.",
            "The Indian troops deliberately targeted the civil population in Danna, Dhddnial, Jura, Lipa, Sharda and Shahkot Sectors of the LoC, according to the military’s media wing.",
            "At least one civilian was martyred and nine others – including women and children – were injured in the Indian shelling, it added while identifying the martyr as 26-year-old Nouman Ahmed.",
            "The injured were evacuated to nearby hospitals for treatment.",
            "Pakistan Army troops responded effectively to the Indian provocation by targeting the posts of Indian border guards, the ISPR said.",
            "Reports say that three Indian soldiers were killed and several injured in the retaliatory fire from Pakistani troops which damaged and destroyed several enemy posts."
        ]
    },
    {
        "sr_no": 74,
        "newspaper": "Tribune",
        "headline": "Daily Mail has sought more time to respond to legal notice: PML-N",
        "link": "https://tribune.com.pk/story/2024696/1-daily-mail-sought-time-respond-legal-notice-pml-n/",
        "brief": "",
        "date": "July 30, 2019",
        "detailed_news": [
            "British newspaper Daily Mail has said in a letter that it cannot respond to former Punjab chief minister Shehbaz Sharif’s legal notice in 14 days, PML-N Vice President Ayaz Sadiq said in a press conference in Islamabad on Tuesday.",
            "“We write to confirm that we believe that we will be unable to reply to your letter by your requested deadline of 8th August,” Sadiq quoted Daily Mail as saying in a letter sent to the PML-N president.",
            "Shehbaz, who had served as Punjab chief minister from 2008 to 2018, last week served a legal notice to the British newspaper and its journalist David Rose for accusing him of embezzling public funds in a news story published earlier this month.",
            "Sadiq maintained that proper investigation was not conducted before publishing the story, and if the paper had any evidence it would have replied in four days.",
            "Special Assistant to the Prime Minister on Accountability Shahzad Akbar, meanwhile, had claimed that the lawsuit was not filed in a court rather the notice was served to the publication only.",
            "Responding to the claim, Ayaz who is a former National Assembly speaker, said according to the British law “pre-action protocol of defamation” needed to be followed. He said the PM’s aide, despite being a barrister, did not even know that before filing a lawsuit, an applicant needed to serve a complaint letter to the defendant.",
            "Criticising the government’s economic policies, the PML-N leader said the tenure of former military ruler Pervez Musharraf had now started to seem better than that of PTI.",
            "“Their [PTI] conduct is against the business community and such an attitude was not even witnessed during the era of dictators,” he said.",
            "Sadiq said the government had failed to prove corruption against the leadership of PML-N.",
            "اسحاق ڈار صاحب کی نہ صرف میں بلکہ وہ لوگ جو انہیں نہیں بھی جانتے وہ لوگ بھی انکی ایمانداری کی قسم کھا سکتے ہیں اسحاق ڈار صاحب کے گھر کو اس لیے سیل کیا گیا شاید اسحاق ڈار صاحب یہ گھر کہیں اٹھا کے لے جائیں گے.سردار ایاز صادق pic.twitter.com/Ty2V5Hgi7l",
            "— PML(N) (@pmln_org) July 30, 2019",
            "“They [PTI] accused Nawaz Sharif, Shehbaz Sharif, Ishaq Dar… of corruption but I can assure that those who don’t even know them [PML-N leaders] can testify about their honesty,” he claimed."
        ]
    },
    {
        "sr_no": 75,
        "newspaper": "Tribune",
        "headline": "18 martyred as military aircraft crashes near Rawalpindi",
        "link": "https://tribune.com.pk/story/2024227/1-17-martyr-army-aviation-aircraft-crashes-rawalpindi/",
        "brief": "",
        "date": "July 30, 2019",
        "detailed_news": [
            "RAWALPINDI: A small military plane went down in a populated area on the outskirts of Rawalpindi Tuesday morning, killing all five crew members on board and at least 13 people on the ground.",
            "The aircraft – belonging to Pakistan Army Aviation – was on a routine training flight when it crashed in a ‘built-up’ area near Mora Kalu, the military’s media wing, the ISPR, said in a statement.",
            "According to Rawalpindi’s Deputy Commissioner Muhammad Ali Randhawa, Mora Kalu is a part of Sihala area, which falls under the administrative jurisdiction of Islamabad Capital Territory.",
            "The fuel tank of the aircraft exploded soon after the impact in the Kantrali village of Mora Kalu, setting off a fire that damaged five houses and reduced two shanties to ashes, according to witnesses.",
            "Official sources said the aircraft took off from Army Aviation Base Qasim at 2am on Tuesday. And according to witnesses the plane circled over the area at a dangerously low altitude shortly before it came down.",
            "The ISPR statement didn’t specify the type of the aircraft, but the British Broadcasting Corporation claimed it was a Beechcraft King Air 350.",
            "Security officials gather at the scene where a Pakistani Army Aviation Corps aircraft crashed in Rawalpindi. PHOTO: AFP",
            "Rescuers said 18 people – eight men, four women and six children – are among the dead, while another eight people are injured.",
            "The ISPR also confirmed the casualties. “Rescue teams of Pakistan Army and 1122 reached on site. [The] fire was extinguished and the injured were shifted to hospital,” it added in the statement.",
            "The military identified the martyred crewmembers as Lt Col Saqib (pilot), Lt Col Waseem (pilot), Naib Subedar Afzal, Havaldar Ibne Ameen, and Havaldar Rehmat.",
            "Funeral prayers for the martyred crewmembers were offered later in the day at Chaklala garrison which was attended by army chief General Qamar Javed Bajwa, serving and retired military personnel, and relatives of the martyrs.",
            "According to the Rescue 1122, four of the injured were treated at the site for their minor injuries, while eight were ferried to the Holy Family Hospital. All the bodies, however, were shifted to the Combined Military Hospital for identification.",
            "“We have taken 18 bodies to the hospital… that included 13 civilians and five crew members,” said Rescue 1122 spokesperson Farooq Butt. “All the bodies are badly burned, so DNA tests are required for identification,” he added.",
            "Deputy Commissioner Randhawa said the bodies of the civilian victims would be handed over to the heirs after identification. He added that a state of emergency had been declared in all hospitals of Rawalpindi.",
            "Rescue 1122 District Officer Dr Abdur Rehman said that they had received the information about the crash at 2:01am and within six minutes they were at the site.",
            "Deputy Commissioner Randhawa said the site was cleared after a five-hour-long operation in which more than 100 rescuers – including firefighters and ambulances – took part. He added that financial compensation would be announced for the families of the civilian victims.",
            "Rawalpindi Corps Commander Lt Gen Bilal Akbar also visited the crash site to oversee the rescue operation. Military officials had cordoned the site while a crowd of residents stood nearby, some of them sobbing.",
            "“I woke to the sound of a huge explosion. I stepped out of my house and saw huge flames and we rushed to the site,” resident Mohammad Sadiq told AFP.",
            "“People were screaming. We tried to help them but the flames were too high and the fire too intense,” he said, adding he believed seven members of one family were among the dead.",
            "Another resident Ghulam Khan said he heard the plane as it buzzed over his house, adding the aircraft appeared to be on fire before it crashed. “The sound was so scary,” he added.",
            "The civilian fatalities have been identified as Muhammad Jamil, his wife Robina, and son Habib; Parri Bibi, wife of Qalam din, her son Muhammad Shabir, and grand-daughter Fizia Bibi; Fatima Bibi, wife of Abdul Hameed, her daughters Uzma Bibi and Rahela Bibi, and sons Abdul Hafeez and Faizan; and Abdul Rauf, son of Shamsud din.",
            "President Arif Alvi and Prime Minister Imran Khan expressed grief and sorrow over the lives lost in the aircraft crash. They condoled with the bereaved families and prayed for the early recovery of the injured.",
            "Leader of the Opposition in the National Assembly Shehbaz Sharif also offered condolences to the bereaved families.",
            "Pakistan has a chequered aviation safety record, with frequent plane crashes over the years. However, crashes involving military aircraft are rare.",
            "In 2016, a Pakistan International Airlines plane burst into flames after one of its two turboprop engines failed while travelling from Gilgit to Islamabad, killing more than 40 people.",
            "The deadliest air disaster on Pakistani soil was in 2010, when an Airbus 321 operated by Airblue and flying from Karachi crashed into the hills outside Islamabad while coming in to land, killing all 152 on board.",
            "(With additional input from Agencies)"
        ]
    },
    {
        "sr_no": 77,
        "newspaper": "Tribune",
        "headline": "Life remains paralysed as rains continue to lash Karachi",
        "link": "https://tribune.com.pk/story/2024569/1-life-remains-paralysed-rains-continue-lash-karachi/",
        "brief": "",
        "date": "July 30, 2019",
        "detailed_news": [
            "Citizens of Karachi continued to face disruptions to daily life as the current spell of rainfall lashed the city for the second consecutive day.",
            "The Sadoo and Lath dams overflowed after two days of rainfall and water entered different areas of Manghopir, Saadi Town and Superhighway.",
            "The Emergency Operations Centre (EOC) said that the Pakistan Army was called in to assist with the rescue operation in the affected areas.",
            "The current spell of rain has paralysed day-to-day life in Karachi with at least 15 dead in different rain-related incidents.",
            "10 dead as incessant rain paralyses Karachi",
            "Major parts of Karachi also faced prolonged power outages and some areas remained without electricty for more than 24 hours.",
            "Final Power Update(1/2)Power supply to most parts of the city has been restored. KE teams remain on-ground to address any local faults.",
            "— KE (@KElectricPk) July 30, 2019",
            "However, the city’s power utility, K-Electric, claimed that supply has been restored to most parts of the city.",
            "Major thoroughfares also remained inundated affecting traffic and commute.",
            "According to the Pakistan Meteorological Department (PMD), rainfall is likely to continue in Mirpurkhas, Hyderabad, Thatta and Karachi till Tuesday night.",
            "10 killed, 29 injured in five days of torrential rains in K-P",
            "According to Karachi police, four people were electrocuted in separate incidents, with the victims including two minors, one teenager and a 40-year-old man. Two of the deceased were from Malir, with the other two from Gulistan-e-Johar and Paposh Nagar. Meanwhile, the Boat Basin police said that a 30-year-old man was electrocuted in its remits.",
            "Rescue sources added that an eight-year-old girl died in the Akhtar Colony area, while a 30-year-old man died of electric shock in the Defence area. A 12-year-old boy got critically injured when he touched an electric pole in the Mauripur area, said a rescue official."
        ]
    },
    {
        "sr_no": 81,
        "newspaper": "Tribune",
        "headline": "Viral video shows last moments of military plane crash in Rawalpindi",
        "link": "https://tribune.com.pk/story/2024708/1-viral-video-shows-last-moments-military-plane-crash-rawalpindi/",
        "brief": "",
        "date": "July 30, 2019",
        "detailed_news": [
            "RAWALPINDI: A short video clip purportedly showing the crash of a Pakistan Army Aviation aircraft in the Sihala area of Islamabad has gone viral on social media platforms.",
            "At least 18 people – including five crewmembers – were martyred when the plane crashed in a built-up area of Mora Kalu in the early hours of Tuesday.",
            "The video clip was shot by a garment factory worker with his mobile phone camera from the rooftop of Rabi Centre building, situated in a commercial area near Kantrali village.",
            "At least 18 martyred as military plane crashes in Rawalpindi suburb",
            "In summers, most embroiders in the area move their machines to top floors of their factory buildings to avoid heat and humidity of the ground floor.",
            "Last night, one of the factory workers was taking a stroll on the rooftop of Rabi Centre when he spotted a plane flying at a dangerously low altitude.",
            "He managed to switch on his mobile phone camera just in time to capture what turned out to be the last moments of the aircraft before it went down.",
            "He ran downstairs to inform his coworkers about the plane that had crashed in the adjacent locality.",
            "The video clip went viral soon after it was uploaded on social media platforms with millions of views thus far.",
            "Exact moment when plane crashed in Bahria Town Islamabad , it can be seen it was flying very low and ultimately crashed. #BahriaTown #Planecrash pic.twitter.com/VDWUfbMVaZ",
            "— Amjad Afridi (@AafridiPTI) July 29, 2019",
            "Exact moment when plane crashed in Bahria Town Islamabad , it can be seen it was flying very low and ultimately crashed. #BahriaTown #Planecrash pic.twitter.com/yLONEwWKoK",
            "— Rizwan Haider (@razi_haider) July 29, 2019",
            "10 Dead reported and 12 severally injured and 5 houses destroyed in plane crash in Bahria town rawalpindi. pic.twitter.com/NCOnuKnNof",
            "—     (@Keyb0ardMujahid) July 29, 2019",
            "Video of  #planecrash in #BahriaTown Rawalpindi. Hard to believe in but life is just a bubble, it have to finish. pic.twitter.com/g69FZn6qk6",
            "— Talha Rajpoot (@TheTalhaRajpoot) July 30, 2019"
        ]
    },
    {
        "sr_no": 91,
        "newspaper": "Daily Excelsior",
        "headline": "Pak Army plane crashes near Rawalpindi; 19 killed",
        "link": "https://www.dailyexcelsior.com/pak-army-plane-crashes-near-rawalpindi-19-killed/",
        "brief": "",
        "date": "Tue, 30 Jul 2019 13:58:32 +0000",
        "detailed_news": "<p>ISLAMABAD: A small military plane of the Pakistan Army crashed into a residential area in the garrison city of Rawalpindi early Tuesday, killing 19 people, including five military personnel, officials said. The Pakistan Army Aviation aircraft on a routine training flight crashed in the suburbs of Mora Kalu village, killing 12 civilians and five crew [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com/pak-army-plane-crashes-near-rawalpindi-19-killed/\">Pak Army plane crashes near Rawalpindi; 19 killed</a> appeared first on <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com\">Jammu Kashmir Latest News | Tourism | Breaking News J&amp;K</a>.</p>\n"
    },
    {
        "sr_no": 106,
        "newspaper": "Tribune",
        "headline": "Viral video shows last moments of military plane crash in Rawalpindi",
        "link": "https://tribune.com.pk/story/2024708/1-viral-video-shows-last-moments-military-plane-crash-rawalpindi/",
        "brief": "",
        "date": "Tue, 30 Jul 2019 15:52:12 +0000",
        "detailed_news": "<p>Last three-seconds before the crash were captured by a garment factory worker in his mobile phone</p>\n<p>The post <a rel=\"nofollow\" href=\"https://tribune.com.pk/story/2024708/1-viral-video-shows-last-moments-military-plane-crash-rawalpindi/\">Viral video shows last moments of military plane crash in Rawalpindi</a> appeared first on <a rel=\"nofollow\" href=\"https://tribune.com.pk\">The Express Tribune</a>.</p>\n"
    },
    {
        "sr_no": 118,
        "newspaper": "The News",
        "headline": "COAS, DGs ISI, ISPR meet PM",
        "link": "https://www.thenews.com.pk/print/505508-coas-dgs-isi-ispr-meet-pm",
        "brief": "",
        "date": "Tue, 30 Jul 2019 00:00:00 +0500",
        "detailed_news": "ISLAMABAD: Chief of the Army Staff (COAS) General Qamar Javed Bajwa, DG ISI Lieutenant General Faiz Hameed and DG Inter Services Public Relations (ISPR) Major General Asif Ghafoor had an important meeting with Prime Minister Imran Khan at the Prime Minister&rsquo;s Office (PMO) on Monday. It was officially stated that the overall security situation of the country came under discussion in the meeting.The three top generals also discussed the follow-up actions of maiden visit of the prime minister to the United States. They had also accompanied the prime minister during the US visit and had significant meetings during their stay there.General Bajwa and General Faiz Hameed were part of Pakistan&rsquo;s team of interlocutors at the White House, as they also had a chat with President Donald Trump at his Washington residence.Well-placed sources told The News that the civil and military leadership will have rapid and extensive consultations during the coming days since major developments are in the offing with regard to the Afghan peace process and other unfolding events, which would need cohesive coordination of the two leaderships.Imran has been repeatedly saying that the civil and military leadership is on one page on all national issues.Meanwhile, Prime Minister Khan earlier met President Arif Alvi at the President House to brief him on his recent visit to the United States. The president reportedly appreciated the prime minister for his meaningful visit to Washington and maintained that the visit turned up to be pivotal for conveying Pakistan&rsquo;s narrative across on regional and international issues of importance.President Alvi expressed the hope that such high-level visits will greatly help strengthen relations with the countries of the world."
    },
    {
        "sr_no": 120,
        "newspaper": "The News",
        "headline": "US accepted Pak narrative on Afghanistan: Qureshi",
        "link": "https://www.thenews.com.pk/print/505510-us-accepted-pak-narrative-on-afghanistan-qureshi",
        "brief": "",
        "date": "Tue, 30 Jul 2019 00:00:00 +0500",
        "detailed_news": "ISLAMABAD: Foreign Minister Shah Mahmood Qureshi Monday said a major shift had occurred in the policy and thought of the US leadership in the last 11 months and now it was seeking political solution to the Afghan issue.&ldquo;Prime Minister Imran Khan had also been saying that durable peace in Afghanistan will require political settlement instead of opting for use of military force there and the same thought led to the convergence of divergent approaches,&rdquo; he said while responding to the speech of Opposition Leader in the National Assembly Shahbaz Sharif in the National Assembly.The minister said there was a major shift in policy of those who earlier favoured search of peace in Afghanistan through the military means instead of finding a political settlement to the problem.He said the PTI government should be appreciated for this major shift.Qureshi informed the House that owing to the government&rsquo;s effort, the Taliban had come to the negotiating table. He said they had received signals consenting to Pakistan&rsquo;s role in the peace process.He said the visit of Afghan President Ashraf Ghani after a gap of four and a half years to Pakistan helped remove misunderstandings between the two countries.He said the Afghan leaders hailing from five different groups were gathered in Bhurban and Lahore adding that the process of talks with the Taliban, which started in Doha was now moving forward.He said after a gap of five years, the prime minister visited the US on an official invitation and availing himself of the opportunity he presented Pakistan&rsquo;s point of view in the US Congress and at different forums creating a conducive atmosphere for the country.He said the peace process was moving forward but there would still be many problems and to overcome them the whole nation would have to give a message of unity.He said Pakistan wanted peace in Afghanistan because peace in Pakistan was linked with peace in the war-torn country.&ldquo;We need to demonstrate the same unity which we showed on February 26,&rdquo; he said.The foreign minister said he had decided to brief the National Assembly Standing Committee on Foreign Affairs on the prime minister&rsquo;s US visit.He pointed out that the Trump administration announced the South Asia strategy in August 2017 and a finger was pointed out at Pakistan for all problems in Afghanistan.&ldquo;As a result, Pakistan faced suspension of economic and security assistance,&rdquo; he said.Qureshi said the PTI government assumed power at a time when the Republicans and Democrats both criticized Pakistan despite the fact that there was severe polarization with a big gulf in the thinking of leadership of two parties.The minister said Pakistan took a number of steps to seek peace in Afghanistan adding that the National Action Plan (NAP) was also initiated and the former Fata was brought into the political mainstream through a constitutional amendment.He said Pakistan also undertook border fencing to improve border management and a number of security forces personnel were martyred in the process.The minister said miscreants having safe havens in Afghanistan cross the border to undertake acts of terrorism in Pakistan.He pointed out that it was also discussed during meetings in the United States that there were spoilers and they would always remain there. He said Pakistan wanted to take the Afghan reconciliation process to its logical end.He said despite Pakistan&rsquo;s efforts for peace, there were spoilers in Afghanistan who never wanted good relations between the two countries.He said for the sake of reconciliation Pakistan wanted an intra-Afghan dialogue and proved its good intentions for peace process in Afghanistan, as the prime minister had convinced the Trump administration that Pakistan may play its part for this purpose.&ldquo;US envoy Zalmay Khalilzad has also admitted that Pakistan is playing a constructive role for peace in Afghanistan and the peace process is moving forward,&rdquo; he said.The minister said a mechanism for APACS was established and its first meeting was held in Islamabad while five different working groups had also met to discuss areas of problems.The minister said the martyrdom of soldiers in Waziristan showed that our armed forces had the capacity and will to spill their blood for defending the geographical and ideological frontiers of the country.Earlier, Leader of the Opposition in the National Assembly Shahbaz Sharif said the terrorist attacks on armed forces in the wake of prime minister&rsquo;s visit to the US should be investigated as to who is behind them.He also demanded Speaker Asad Qaiser to issue production orders of the members arrested on various charges.Speaking on the floor of the House, Shahbaz asked the government to expose the miscreants who were active in spoiling the Afghan peace process and attacking Pakistani soldiers after crossing the Pak-Afghan border.He suggested that the foreign minister should take the House into confidence on the evil elements and enemies involved in attacking the Pakistani security forces resulting in martyrdom of soldiers.&ldquo;The whole nation should know the enemies wanting to spoil the peace efforts following prime minister&rsquo;s visit to the United States,&rdquo; he said.Demanding issuance of production orders for Shahid Khaqan Abbasi, Asif Zardari, Rana Sanaullah and Khawaja Saad Rafique, he observed that it was responsibility of the chair to ensure sanctity and dignity of the House.&ldquo;It is responsibility of the chair to ensure presence of these members in the House,&rdquo; he said.Shahbaz Sharif also advised the chair to refrain from taking dictation from the prime minister to issue production orders of detained members.The House also offered Fateha for the departed souls of soldiers and officers who laid their lives in two terror attacks in Waziristan and Balochistan.The otherwise smooth proceedings of the House lasting less than two hours ended on a bad note due to a tiff between parliamentarians from the PPP and PTI who attempted to engage in a fisticuff.The ugly situation was created when the PTI parliamentarians from Karachi including Alamgir Khan, Attaullah and Aslam Khan attempted to raise the Karachi-related issues after Deputy Speaker Qasim Suri gave the floor to the PPP parliamentarian Abdul Qadar Patel.The PPP member Zulfiqar Bachani signaled the PTI members to take their seats, which triggered a verbal clash between the two sides.Charged members from the two sides attempted to approach each other but some senior parliamentarians stopped them.In his speech, Minister for Communications Murad Saeed compared the visit of former prime minister Nawaz Sharif and Prime Minister Imran Khan to the United States.He said Nawaz Sharif travelled to the US by a special flight with family members at the cost of huge expenses but the question was that if he had succeeded in presenting Pakistan&rsquo;s narrative.&ldquo;During his meeting with the US ambassadors, Yousuf Raza Gilani asked the US administration to continue drone attacks and his government will continue to stage protest in Parliament,&rdquo; he said, adding that Gilani never talked about sacrifices rendered by the armed forces and civilians in the war on terror.He said the two former prime ministers during their US visits never raised Kashmir issue and efforts of Pakistan for the world peace.&ldquo;The disqualified prime minister visited the US with families spending $4.6 lakh,&rdquo; he said.He said during his US visit, Prime Minister Imran Khan pleaded Pakistan&rsquo;s case and made it clear that Pakistan was not a terrorist state rather it had been advocating for peace in the world and making efforts in this direction.The minister said the prime minister also forcefully raised the Kashmir issue.PPP parliamentarian Syed Khursheed Shah also regretted non-issuance of production orders of Asif Zardari, Rana Sanaullah, Shahid Khaqan and other parliamentarians saying the speaker&rsquo;s office was looking towards the prime minister to seek his directions."
    }
]