[
    {
        "sr_no": 2,
        "newspaper": "kashmir Times",
        "headline": "Pak shells villages, border posts in Poonch on 2nd day",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93118",
        "brief": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.\r\nIndian side also r...",
        "date": "7/30/2019 3:53:20 PM",
        "detailed_news": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.Indian side also retaliated in equal measure. Two sides traded heavy fire till late afternoon.In the meanwhile, around 15-day infant, who had sustained critical splinter injuries in his abdomen along with his mother and another civilian in Pak shelling in Shahpur sector Sunday evening, succumbed to his injuries in Poonch District Hospital this morning. This afternoon, Deputy Commissioner Rahul Yadav also presented cash relief to persons injured in recent cross border firing.Army sources said, “Pakistani army violated ceasefire in Shahpur sector of Poonch this afternoon. Indian army retaliated with equal calibre and exchange of fire continued till 3.50 PM.”PRO Defence Devender Anand said, “At about 1245 hours, Pakistan initiated unprovoked ceasefire violation starting with firing of small arms followed by shelling with mortars along LoC in Shahpur sector (J&K). Indian army retaliated befittingly.”The army spokesperson said information on casualties on the Pakistani side in the retaliatory action was not immediately available.In the meanwhile, around 15-day old infant, who had sustained critical abdominal splinter injuries during heavy shelling by Pakistani troops along the Line of Control (LoC) in Shahpur sector of Poonch district Sunday evening, died at Poonch District hospital on Monday, a police official said.The infant, his mother Fatima Jan (35) and another civilian Mohammad Arif (40) were injured when mortar shells fired by Pakistan hit their village in Shahpur sector late Sunday evening. They were rushed to district hospital Poonch, where the minor succumbed to injuries this morning, he added.He said Jan and Arif were referred to the Government Medical College Hospital, Jammu, for specialised treatment where their condition was stated to be stable. The baby, however, was kept under observation in Poonch district hospital, where he breathed his last.Later this afternoon, Deputy Commissioner Rahul Yadav  presented cash relief to persons injured in recent cross border firing. He met the injured undergoing treatment at the District Hospital and inquired about their condition directed the doctors to provide them best possible treatment. The Deputy Commissioner provided a relief assistance of Rs 10,000 each to the injured out of Red Cross fund.Mortars and small arms were used from across the border to target forward posts and villages in Shahpur, Sawjian and Mendhar sectors between 5 PM and 10 PM on Sunday. Several houses were also damaged in the firing, the official said.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was injured in another incident of cross-border firing by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 4,
        "newspaper": "kashmir Times",
        "headline": "Pak shells Poonch villages, border posts",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93100",
        "brief": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district...",
        "date": "7/29/2019 11:05:01 PM",
        "detailed_news": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district on Sunday eveningPolice said that the Pakistan army resorted to heavy shelling targetting Indian forward posts and civilian areas at Shahpur, Mankote and Sawjian thus leading to heavy exchange of fire from both sides in these sectors.“In Pak shelling, three civilian namely Fatima Jan, 35, wife of Mohammed Qasim resident of Shahpur, her around 15-day old child and Mohammed Arif,33, son of Mohammed Sayeed, also resident of Shahpur were injured. All three injured were rushed to District Hospital Poonch from where Fatima Jan and Mohammed Sayeed were referred to Government Medical College hospital, Jammu. However, the infant, who too had sustained critical injuries in his abdomen, was being treated in Poonch hospital,” Medical Superintendent District Hospital Poonch Shamim-Ul-Nisa told KTNS.   Meanwhile Sarpanch Najab Din said that some shells landed into residential areas at Shahpur . In the incident, two residential houses got damaged and three civilians including mother-child duo sustained injuries. Sarpanch added, “As the heavy shelling continued in the area, it's not possible to assess the exact loss of life and property.”Earlier SSP Poonch Ramesh Kumar Angral, while confirming heavy shelling in border areas of Shahpur, Mankote, Sawjian, said, “ Pakistan army targetted not only army posts on the Line of Control but also civilian population. Some shells landed into residential areas as well. As a result, three civilians were injured. All three injured were immediately shifted to District Hospital Poonch for treatment. Indian army was also responding to the shelling effectively.”DC Poonch Rahul Yadav, who himself was camping at District Hospital Poonch, told reporters that the condition of infant was critical as he too had sustained splinter injury in his abdomen. “He was not referred to GMC, Jammu given his condition. The doctors here are trying to stabilise his condition. That’s the priority. The administration is providing all required assistance to the victims.”  Defence PRO Devender Anand said, “Today at about 1700 hours Pak initiated unprovoked ceasefire violation by firing  of small arms and intense shelling with mortars along LoC in Shahpur and Sawjian sectors in district Poonch. Indian army is retaliating befittingly.”Besides Shahpur, Sawjian, Mankote, the two sides also traded fire along the LoC in Mendhar and Krishna Ghati sectors. Few houses in these areas also got damaged during shelling, reports said.In Sawjian sector, the house of Amna Bi, widow of Said Mohammed Khan, resident of Sawjian was also damaged partially. Heavy shelling continued till the last reports poured in. The cross-border firing by Pakistan has ended a five-day lull in the border skirmishes between India and Pakistan armies.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was also injured in another incident of ceasefire violation by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 19,
        "newspaper": "Greater Times",
        "headline": "Pakistan troops shell border areas along LoC in Rajouri",
        "link": "https://www.greaterkashmir.com/news/kashmir/pakistan-troops-shell-border-areas-along-loc-in-rajouri/?utm_source=rss&utm_medium=rss&utm_campaign=pakistan-troops-shell-border-areas-along-loc-in-rajouri",
        "brief": "",
        "date": "Wed, 31 Jul 2019 05:14:17 +0000",
        "detailed_news": "Pakistani troops on Wednesday opened fire and shelled mortars along the LoC in Jammu and Kashmir&#8217;s Rajouri district, officials said. Indian troops gave a befitting reply, resulting in heavy damage to Pakistani Army posts and casualties to Pakistani soldiers, they said. &#8220;At about 0030 hours, the Pakistan Army initiated unprovoked ceasefire violation by firing of<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/kashmir/pakistan-troops-shell-border-areas-along-loc-in-rajouri/\">Read More</a>"
    },
    {
        "sr_no": 37,
        "newspaper": "Hindustan Times",
        "headline": "V G Siddhartha: An army aspirant who founded India's biggest coffee chain",
        "link": "https://www.hindustantimes.com/india-news/v-g-siddhartha-an-army-aspirant-who-founded-india-s-biggest-coffee-chain/story-pIBbsBKPRFF1YnUokeRIOJ.html",
        "brief": "",
        "date": "Wed, 31 Jul 2019 04:22:12 GMT ",
        "detailed_news": "Coming from a family that has a 140-year history of growing coffee, Cafe Coffee Day owner Siddhartha initially dabbled in stock trading before actually setting his foot in the coffee business."
    },
    {
        "sr_no": 54,
        "newspaper": "Hindustan Times",
        "headline": "Islamabad must walk the talk on terrorism",
        "link": "https://www.hindustantimes.com/editorials/islamabad-must-walk-the-talk-on-terrorism/story-NkUGvmos7GWjGkNyXm9HSK.html",
        "brief": "",
        "date": "Thu, 25 Jul 2019 02:42:33 GMT ",
        "detailed_news": "Imran Khan must root out the terror infrastructure and prosecute the culprits"
    },
    {
        "sr_no": 59,
        "newspaper": "Dawn",
        "headline": "Increased ceasefire violations by Indian troops 'indicate their frustration', says DG ISPR",
        "link": "https://www.dawn.com/news/1497272/increased-ceasefire-violations-by-indian-troops-indicate-their-frustration-says-dg-ispr",
        "brief": "",
        "date": "Updated July 31, 2019",
        "detailed_news": [
            "Inter-Services Public Relations (ISPR) on Wednesday condemned a recent ceasefire violation by Indian troops which resulted in the deaths of two civilians in different villages in Azad Jammu and Kashmir (AJK), saying that the increased frequency of attacks from across the Line of Control (LoC) \"indicates their [the Indian government's] frustration due to failure in IOJ&K [Indian-occupied Jammu and Kashmir]\".",
            "In a tweet posted on ISPR's official Twitter account, director general of the army's media wing Maj Gen Asif Ghafoor said ceasefire violations by the Indian forces \"are being and shall always be effectively responded\". ",
            " ",
            "\"Pak Army shall take all measures to protect innocent civilians along LoC from Indian firing deliberately targeting them,\" he said. ",
            "His statement came after officials evacuated more than 50 Chinese nationals working near the LoC due to the intense firing.",
            "The Chinese were working on a dam being constructed in AJK along the confluence of the Neelam and Jhelum rivers when firing pushed authorities to move the workers late Tuesday, according to Akhtar Ayub from the local disaster management authority. ",
            "Another local official, Raja Shahid Mahmood, said the decision was made after Indian security forces fired a volley of “indiscriminate fire that killed three people including a woman and a child and wounded 31 others during the last 24 hours”. ",
            "Foreign Office Spokesperson Dr Mohammad Faisal today summoned Indian Deputy High Commissioner Gaurav Ahluwalia and condemned the \"unprovoked\" ceasefire violations, a press statement released today said.",
            "The spokesperson urged the Indian side to respect the ceasefire agreement and termed the targeting of the civilian population as \"deplorable and contrary to human dignity, international human rights and humanitarian laws\".",
            "\"The deliberate targeting of civilian populated areas is indeed deplorable and contrary to human dignity, international human rights and humanitarian laws. The ceasefire violations by India are a threat to regional peace and security and may lead to a strategic miscalculation,\" the press release read.",
            "The Indian government must respect the 2003 ceasefire arrangement, investigate these and other incidents of ceasefire violations; instruct the Indian forces to respect the ceasefire, in letter and spirit and maintain peace on the LoC and the Working Boundary, the statement further said.",
            "Tuesday's attacks — that were described by officials as \"carpet bombing\" of several civilian-populated areas in AJK — were the second time the Indian forces had violated the ceasefire agreement of 2003 in two days. Two civilians were killed and at least 19 were injured from Indian shelling in Danna, Dhudhniyal, Jura, Lipa, Sharda and Shahkot. ",
            "The armed forces had responded \"befittingly\", a statement by the media wing had said, adding that there were \"reports of three Indian soldiers dead, many injured, besides damage to Indian posts\".",
            "On Monday, one woman was killed while at least seven were injured from \"unprovoked\" attacks by the Indian troops in different civilian populated villages near the LoC.",
            "Yesterday's indiscriminate shelling has pushed the civilian death toll in the current year to 24, including 14 men and 10 women, while another 133 civilians, including 78 males and 55 females, have sustained injuries.",
            "Saeed Qureshi, a senior director at State Disaster Management Authority (SDMA), had said after Monday's incident that the civilian death toll in the current year has increased to 22, including 13 men and nine women.",
            "Of them, he said, nine have been killed in the Kotli district, six in Haveli district, three in Bhimber district, two in Jhelum Valley district and one each in Neelum Valley and Poonch districts.",
            "About 11 army personnel have also been martyred along the LoC in the ongoing year, Qureshi added.",
            "Around 114 people, including 65 men and 49 women, have been injured, he said. About 36 of the victims hailed from Kotli district, 27 from Poonch district, 24 from Haveli district, 19 from Bhimber district, seven from Jhelum Valley district and one from Neelum Valley district.",
            "Qureshi said that around 18 houses and four shops have been destroyed and 220 houses, one mosque, two schools and five vehicles have been partially damaged.",
            "Villagers have also lost at least 26 cattle heads due to shelling by the Indian forces in the ongoing year, he added."
        ]
    },
    {
        "sr_no": 60,
        "newspaper": "Dawn",
        "headline": "Monsoon spell: After battling extended power outages, Karachiites hit with water shortage",
        "link": "https://www.dawn.com/news/1497270/monsoon-spell-after-battling-extended-power-outages-karachiites-hit-with-water-shortage",
        "brief": "",
        "date": "July 31, 2019",
        "detailed_news": [
            "After two days of sporadic showers and extended power outages, the water supply to large parts of Karachi has been disrupted due to the shutdown of an important pumping station. ",
            "According to a spokesperson for the Karachi Water and Sewerage Board (KWSB), electricity supply to the North-East Karachi (NEK) pump has been disrupted after the grid station supplying it was flooded with rainwater.  ",
            "He said power had been suspended since 8:35pm on Tuesday, as a result of which the pumping of water from the NEK pump had also stopped.",
            "As per the KWSB spokesperson, they were unable to provide 160 million gallons of to water various parts of the city. Gulistan-i-Jauhar, New Karachi, North Karachi and Scheme 33 were completely affected by the disruption while Gulshan-i-Iqbal was partially affected.",
            "While asking citizens to conserve available water, he said that as soon as the electricity supply is restored, the provision of water will resume.",
            "A large number of neighbourhoods in the city had remained in darkness on Tuesday night. According to K-Electric, owing to an overflow of Lath Dam, the situation had turned critical for the KDA Grid station.",
            "\"Monsoon downpour has caused Lath Dam near Super Highway to overflow. The floodwater has entered K-Electric’s KDA Grid station, located at Gulzar-e-Hijri Scheme 33, one of the most critical grids of KE’s 220kV grid and an interconnection point between KE and NTDC,\" said a statement shared by the power provider on Facebook late Tuesday.",
            "\"As an emergency safety measure, we are forced to suspend supply to feeders associated with this grid. This has affected power supply to parts of Sohrab Goth, Abulhassan Isphahani Road, Super Highway, KWSB’s NEK Pumping station among few others,\" the statement continued.",
            "A spokesperson for K-Electric today said that restoration work on the KDA grid had been sped up and power in the affected areas would soon be restored. ",
            "He said that due to flooding in the grid, the electricity supply had been stopped and added that once it was restored, the provision of electricity would improve.",
            "The spokesperson said that K-Electric was grateful to the Pakistan Army for assistance in the drainage process.",
            "The Pakistan Army is also assisting in a drainage operation underway at the Super Highway using heavy machinery.",
            "Meanwhile, KWSB managing director Asadullah Khan said that water levels in the Hub Dam had risen by 12 feet due to the rain. Khan said that now the water level in the dam was 308 feet, adding that there was enough water now stored in the dam for the western district until December 2020. He also said that water was continuing to flow into the dam.",
            "Additional reporting by Asim Khan"
        ]
    },
    {
        "sr_no": 62,
        "newspaper": "Dawn",
        "headline": "North Korea fires two ballistic missiles: South",
        "link": "https://www.dawn.com/news/1497269/north-korea-fires-two-ballistic-missiles-south",
        "brief": "",
        "date": "July 31, 2019",
        "detailed_news": [
            "Pyongyang fired two ballistic missiles on Wednesday, Seoul said, days after a similar launch that the nuclear-armed North described as a warning to the South over planned joint military drills with the United States. ",
            "The two devices were fired from the Wonsan area on the east coast at dawn and flew around 250 kilometres into the sea, said South Korea's Joint Chiefs of Staff. ",
            "“We stress a series of missile launches do not help ease tensions in the Korean Peninsula and urge the North to refrain from such acts,” they said in a statement, while the presidential Blue House expressed “strong concern”.",
            "The North is banned from ballistic missile launches under United Nations Security Council resolutions but it was the second such firing in less than a week, despite a meeting between leader Kim Jong Un and US President Donald Trump last month. ",
            "Pyongyang and Washington are engaged in a long-running diplomatic process over the North's nuclear and missile programmes that has seen three high-profile encounters between their leaders in the space of a year. ",
            "They agreed to resume talks during their impromptu June encounter in the Demilitarised Zone that divides the peninsula, but that working-level dialogue has yet to begin. ",
            "Pyongyang has warned the negotiations could be derailed by Washington and Seoul's refusal to scrap the annual manoeuvres between their forces. ",
            "The North has defied years of isolation and sanctions to develop its arsenal and has not given up any of its weapons, while proving itself adept at dragging out discussions. ",
            "On his way to an Asian regional forum where the North will be high on the agenda — even though its foreign minister will apparently not attend — US Secretary of State Mike Pompeo told reporters that the talks had been expected “within weeks” but were taking “a little bit longer” to start. ",
            "There was no immediate comment from Pyongyang on the latest launch, but Harry Kazianis of the Center for the National Interest in Washington said it was a warning to the two security allies to stop the exercises or the North will \"raise tensions to a slow boil over time\". ",
            "Pyongyang will carry out more launches before the drills begin next week and again afterwards, he predicted. ",
            "\"The only question is: would the Kim regime dare test an ICBM, or a long-range missile, that could hit the US homeland?\"",
            "With its short-range launches, Pyongyang was looking to pressure Washington to “come to the table with more readiness to meet its demands”, added Jeong Young-tae, director of the Institute of North Korean Studies. ",
            "Last Thursday's missiles travelled much further — one of them going nearly 700 kilometres — than Wednesday's, and also reached a higher altitude, 50 kilometres compared to 30. ",
            "Pyongyang said they were newly designed “tactical guided weapons” that were a “solemn warning to the South Korean warmongers” over the planned military drills with the US. ",
            "The North also showed off a new submarine last week, which reports on Wednesday cited the South's defence ministry as saying appeared to be capable of carrying three submarine-launched ballistic missiles. ",
            "Washington stations nearly 30,000 troops in the South to defend it from its neighbour, which invaded in 1950. ",
            "The devices were widely described as ballistic missiles, including by the US-South Korean Combined Forces Command and the government in Seoul. ",
            "But Trump — who has repeatedly touted his relationship with Kim, whose regime is widely accused of human rights abuses — brushed off the North's bellicose language, saying it was warning Seoul rather than Washington. ",
            "“He didn't send a warning to the United States,” Trump said. “They have their disputes, the two of them have their disputes.” ",
            "The Korea Times condemned what it called the US president's “willful ignorance” in an editorial Tuesday, before the latest launches. ",
            "Trump \"gives the impression that he doesn't mind its missile launches as long as they are short-range, and not threatening the US\", it said. ",
            "“Such a way of thinking is frustrating — and dangerous,” it added. \"Most of all, he can give the wrong signal to the North that the US will not step in as long as it does not target the US mainland. What about US allies in Asia?\""
        ]
    },
    {
        "sr_no": 67,
        "newspaper": "Dawn",
        "headline": "At least 28 killed as Afghan bus hits 'Taliban' bomb: official",
        "link": "https://www.dawn.com/news/1497265/at-least-28-killed-as-afghan-bus-hits-taliban-bomb-official",
        "brief": "",
        "date": "July 31, 2019",
        "detailed_news": [
            "Dozens of passengers, mainly women and children, were killed in western Afghanistan early Wednesday when the bus they were travelling in hit a roadside bomb, officials said. ",
            "The attack, which came one day after the United Nations said civilians are being killed and wounded at a “shocking” level in Afghanistan's war, occurred around 6:00 am (0130 GMT), authorities said. ",
            "“A passenger bus travelling on the Kandahar-Herat highway hit a Taliban roadside bomb. So far at least 28 killed, 10 wounded,” said Muhibullah Muhib, the spokesman for Farah province. ",
            "All were civilians, mostly women and children, he said. Farooq Barakzai, a spokesman for Farah's governor, confirmed the toll but warned it may rise higher. ",
            "There was no immediate confirmation from the Taliban that it was behind the blast. ",
            "The group, which has resurged since its regime was toppled by the US invasion in 2001, made a vague pledge this month to reduce civilian casualties. ",
            "Civilians have long paid a disproportionate price in the nearly 18 years since the US invaded Afghanistan. ",
            "On Tuesday, the UN released a report showing that casualties have dropped 27 percent in the first half of 2019 compared to the same period last year, which was a record — but nonetheless 1,366 civilians were killed and another 2,446 injured. ",
            "Child casualties represented almost a third of the overall total of civilian casualties. ",
            "The UN also said that US and pro-government forces caused more civilian deaths than the Taliban and other insurgent groups for the second quarter running. ",
            "It branded efforts to reduce the violence “insufficient”. ",
            "The bloodshed is expected to rise after the launch this week of official campaigning in Afghanistan's presidential election, set for September 28. ",
            "At least 20 people were killed on Sunday, the first official day of the campaign, and 50 wounded when a suicide attacker and gunmen targeted the Kabul office of Afghan President Ashraf Ghani's running mate, Amrullah Saleh. ",
            "There are also doubts the election will happen at all, with lingering questions about whether Afghanistan should hold a key poll amid a months-long, US-led push to forge a peace deal with the Taliban. ",
            "This week US Secretary of State Mike Pompeo said that President Donald Trump wants to begin withdrawing troops before the vote, though he emphasised in comments to reporters Tuesday that there is “no deadline”. ",
            "But the push has ignited widespread concern among Afghans that in Washington's rush to exit its longest war the Taliban will be returned to some semblance of power."
        ]
    },
    {
        "sr_no": 69,
        "newspaper": "Tribune",
        "headline": "Pakistan lodges strong protest with India against LoC firing",
        "link": "https://tribune.com.pk/story/2025032/1-pakistan-lodges-strong-protest-india-loc-firing/",
        "brief": "",
        "date": "July 31, 2019",
        "detailed_news": [
            "ISLAMABAD: The Foreign Office summoned Indian Acting Deputy High Commissioner Gaurav Ahluwalia on Wednesday to lodge a protest against unprovoked firing by Indian forces along the Line of Control (LoC).",
            "At least one civilian was martyred and nine others – including women and children – were injured when the Indian forces fired mortars and artillery at the civilian population on the Pakistani side of the LoC.",
            "“The deliberate targeting of civilian populated areas is indeed deplorable and contrary to human dignity, international human rights and humanitarian laws,” a press release from the Foreign Office stated adding that the ceasefire violations by India were a threat to regional peace and security and may lead to a strategic miscalculation.",
            "Civilian martyred in unprovoked Indian firing",
            "It further said that the Indian occupation forces along the LoC and working boundary were continuously targeting civilian populated areas with heavy mortars and automatic weapons.",
            "“This unprecedented escalation in ceasefire violations by India is continuing from the year 2017 when the Indian forces committed 1970 ceasefire violations,” it added.",
            "Director General (SA & SAARC) Dr Mohammad Faisal urged the Indian side to respect the 2003 ceasefire arrangement; investigate these and other incidents of ceasefire violations; instruct the Indian forces to respect the ceasefire, in letter and spirit and maintain peace on the LoC and the working boundary.",
            "He demanded that the Indian side permit UNMOGIP to play its mandated role as per the UN Security Council resolutions.",
            "DG ISPR Major General Asif Ghafoor, in a tweet, said that the increased ceasefire violations by Indian forces indicate their frustration due to failure in occupied Kashmir.",
            "“Pakistan Army shall take all measures to protect innocent civilians along LOC from Indian firing deliberately targeting them,” he said adding that ceasefire violations are being and shall always be effectively responded."
        ]
    },
    {
        "sr_no": 71,
        "newspaper": "Tribune",
        "headline": "Flooding, power cuts pile on misery for Karachi after rain spell",
        "link": "https://tribune.com.pk/story/2025110/1-flooding-power-cuts-pile-misery-karachi-rain-spell/",
        "brief": "",
        "date": "July 31, 2019",
        "detailed_news": [
            "KARACHI: The heavens stopped pouring and the sun shone down bright as ever but the misery of Karachi and its people continued on Wednesday morning.",
            "Rising water levels caused the Malir River to overflow and the Korangi Causeway and Korangi Crossing areas were flooded in the morning.",
            "Traffic flow was nothing but chaotic and the moring work commute turned into an arduous task for citizens, many of whom spent hours on the Baloch Colony Expressway and other roads leading to Korangi Industrial Area.",
            "The situation in Korangi was preceded by the early Wednesday morning breach at the Lath and Thado dams in Gadap Town, which caused flooding around the Super Highway and its adjacent areas.",
            " ",
            "10 dead as incessant rain paralyses Karachi",
            "The Pakistan Army was called in for rescue operations in the affected areas which included several residential colonies and the cattle market established along the highway.",
            "In a tweet, the city’s power utility, K-Electric, informed citizens that the Lath Dam’s overflowing had led to floodwater entering its KDA Grid station in Scheme 33 of Gulzar-e-Hijri.",
            "Overflow of Lath Dam creates critical situation at KDA Grid. (8)Pakistan Army has come to support our efforts. All possible resources including trenches, water pumps & sand bags around the grid have been deployed to block the water & our teams are on ground to manage situation. pic.twitter.com/27EWjlKv8T",
            "— KE (@KElectricPk) July 30, 2019",
            "Since the station serves as an “interconnection point between KE and NTDC”, power supply was to various parts of Karachi was affected, including Sohrab Goth, Abul Hasan Isphahani Road and Super Highway.",
            "KE warned that it may be “forced to completely shut down power from this grid” which would impact supply to areas including Gulshan, Azizabad, Liaqatabad, Malir, Federal B Area, Surjani Town, Shadman Town and Shah Faisal.",
            "The death toll in the current spell of rain also climbed to 15 on Wednesday as two deaths caused by electrocution were reported in Shah Latif Town and Moinabad.",
            "Blame game continues",
            "Amid incessant reports of traffic jams, water accumulation and power outages, officials of the provincial and local governments remained preoccupied with shifting blame from themselves.",
            "At a press conference on Wednesday morning, Sindh Local Government Minister Saeed Ghani accused “people sitting in Islamabad” of unfairly blaming the Sindh government for the post-rain situation.",
            " ",
            "10 killed, 29 injured in five days of torrential rains in K-P",
            " ",
            "He asserted that the Pakistan Peoples Party’s provincial government had done all in its power to avert the crisis. “Our government had already allocated funds to the tune of Rs125 billion for the cleaning of sewers and stormwater drains. That is why most major roads of Karachi were clear for traffic despite the heavy downpour.”",
            "Speaking about the rolling power outages, the PPP minister said the provincial government had no mechanism to keep a check on the “incompetence” of K-Electric. “The federal government has the power to do that but the reality is there for all of us to see.”",
            "He also criticised the performance of local government representatives and called for their accountability. “Who is responsible for draining out rainwater and cleaning the city’s drains? The mayor of Karachi and his subordinates have failed to not fulfill their responsibilities,” said Ghani.",
            "“Will he [Mayor Wasim Akhtar] answer our queries on the promises he made about a cleanliness drive in Karachi? He should tell us if he can’t handle this job – we will do what needs to be done.”",
            "The LG minister also issued a call for all political parties to work together instead of engaging in a “blame game”.",
            "“Water accumulation is a reality in the most developed of cities. Instead of criticising each other, we should all work together for the people of Karachi.”",
            "Sindh Chief Minister Syed Murad Ali Shah asserted that the entire provincial government machinery was active and working tirelessly to serve the people of Karachi.",
            "Speaking to reporters during an inspection visit to different areas, Shah pointed out that all major drains in Karachi were affected by encroachments.",
            "“The width of these drains has been reduced to hardly a few feet. This is a recipe for disaster and that is what we have seen repeatedly,” said the CM."
        ]
    },
    {
        "sr_no": 72,
        "newspaper": "Tribune",
        "headline": "Five dead as bomb rips through police van in Quetta",
        "link": "https://tribune.com.pk/story/2024710/1-least-three-martyred-several-injured-quetta-explosion/",
        "brief": "",
        "date": "July 30, 2019",
        "detailed_news": [
            "QUETTA: A powerful bomb tore through a police patrol van at a busy roundabout in Quetta Tuesday evening, killing at least five people – among them two policemen.",
            "Thirty-two people – including Additional SHO Shafaat Ali – were also wounded in the attack targeting the police vehicle parked outside the City Police Station at Bacha Khan Chowk, according to DIG Quetta Abdul Razzaq Cheema.",
            "“The bomb went off as soon as SHO Shaffat got down from the vehicle,” DIG Cheema told media persons at the crime scene.",
            "He said it was too early to confirm whether it was a suicide attack or a remotely triggered device.",
            "Officials from Bomb Disposal Squad and Counter-Terrorism Department have gathered forensic evidence from the site to determine the nature of the blast, he added. “Until then, the crime scene would remain off-limit to the media.”",
            "A contingent of law enforcement agencies threw a security cordon around the area as rescuers evacuated the casualties.",
            "DIG Cheema confirmed five fatalities: two policemen and three civilian passers-by. He said women and children are among the injured who have been driven to the Civil Hospital.",
            "Additional SHO Shaffat was shifted to Quetta’s Trauma Centre, where medics said his condition was critical.",
            "The powerful explosion shattered the windows of buildings in the neighbourhood. The Express Tribune reporter saw blood and debris scattered at the scene where the targeted police vehicle stood with its front side blown off.",
            "No group immediately claimed responsibility for the deadly attack in the capital city of Balochistan which has been wrecked by ethnic, sectarian and separatist violence for more than a decade now.",
            "Government and military officials have repeatedly blamed hostile agencies – India’s RAW in particular – for stoking terrorism in the province, which is at the centre of the multibillion-dollar China-Pakistan Economic Corridor.",
            "The March 2016 arrest of a serving Indian navy commander, Kulbhushan Jadhav, and his subsequent confession about India’s involvement in terrorism in Pakistan lends further credence to the Pakistani claims.",
            "Home Minister Mir Zia Langove said the government would not be cowed down by such cowardly attacks and that the mission to purge the province of the menace of terrorism would continue till the elimination of last terrorist.",
            "When asked, he said the Safe City Project has become imperative for the security of the provincial capital. “The fencing of Pak-Afghan border would also deny terrorists ease of movement,” he added.",
            "Provincial Governor Justice (retd) Amanullah Khan Yasinzai, Chief Minister Jam Kamal Khan and his cabinet condemned the blast and expressed their grief and sorrow over the human losses.",
            "The cabinet, which was in session at the time, vowed to bring terrorists and their facilitators to justice. It reiterated that such cowardly attacks would not weaken the government resolve to rid the province of terrorism.",
            "The cabinet paid rich tributes to the security forces for their sacrifices for the restoration of peace in the province. The cabinet also offered condolences to the bereaved families and prayed for the early recovery of the injured."
        ]
    },
    {
        "sr_no": 73,
        "newspaper": "Tribune",
        "headline": "Nine of a family among Pindi crash victims",
        "link": "https://tribune.com.pk/story/2024911/1-nine-family-among-pindi-crash-victims/",
        "brief": "",
        "date": "July 31, 2019",
        "detailed_news": [
            "RAWALPINDI: For Muhammad Khan and Abdul Hameed, the night of July 29 will remain seared in their memories as the nightmare during which the brothers lost nine members of their joint family.",
            "Along with the devastated family, five other people were killed and another nine were injured when a small military plane on a training mission crashed in a ‘built-up’ area in the Kantrali village of Mora Kalu early on Tuesday morning.",
            "The fuel tank of the aircraft exploded soon after impact, setting off a fire that damaged five houses and reduced two shanties to ashes.",
            "Firdous, a local, said that such was the intensity of the fire that hours after firefighters had put the flames out, they could still feel the heat radiating from the burnt, smoking structures.",
            "Rescue 1122 officials said that they had pulled as many as nine bodies from a single house, three from another and two — including a woman and a  child — from a shanty.",
            "This was corroborated by the Sihala police who said that the nine bodies pulled from one house belonged to the family of Abdul Hameed.",
            "The bodies were identified as Hameed’s wife Fatima, his 14-year-old son Abdul Hafeez, daughters three-year-old Uzma, three-year-old Raheela, and a year-old-toddler Faizan. Rescue workers also pulled the bodies of Hameed’s mother-in-law Parri Bibi, his 22-year-old brother-in-law Muhammad Shabbir, and his three-year-old daughter Faiza.",
            "Three bodies pulled from the second house belonged to the family of 26-year-old Muhammad Jamil. Rescue workers also recovered the body of his 20-year-old wife Robina and four-year-old son Zohaib.",
            "A further two bodies were pulled from Shamsuddin’s shanty, including that of his wife and son Abdul Rauf.",
            "Of those injured, officials at the burns ward of the Holy Family Hospital in Rawalpindi said that 13-year-old Iqra Hameed, 30-year-old Shamim Kabeer and 26-year-old Nadeem Ghulam Fareed had suffered severe burns of 100%, 76% and 50% respectively.",
            "Others who suffered burns included 25-year-old Surayya Nadeem — 26%, 70-year-old Nazeer Kareem — 15%, 12-year-old Wasem Nazeer and 42-year-old Fatima Nazeer suffered two per cent burns on their bodies.",
            "In mourning",
            "As the sun rose on Tuesday morning, the sleepy village was in mourning.",
            "Relatives and villagers gathered in hastily-set-up enclosures consoling family members and survivors. Sabar Jaan, who lost three members of her family including her son, daughter-in-law, and a child in the crash while suffering injuries to her left arm wailed inconsolably.",
            "Most of the victims worked medial jobs in the nearby private housing scheme and commercial areas.",
            "Later on Tuesday evening, 10 of the victims were laid to rest. Wrapped in the national flag, their coffins were taken to the graveyard in Dhoke Awan.",
            "A large number of residents, government officials and military personnel participated in the funeral prayers.",
            "Tough security measures were adopted for the funeral.",
            "Later, Hameed, who had survived the crash but lost nine members of his family, lodged a complaint with the Sihala police to register a first information report for the incident.",
            "Hospitals on alert",
            "As word spread about the plane crash on the outskirts of the garrison city, all the three tertiary care hospitals in the city, including HFH, Benazir Bhutto General Hospital (BBH) and District Headquarters Hospital (DHQ) were put on high alert. All medical and paramedical staff were also summoned to the hospital. Owing to the nature of injuries, most of the injured were brought to the burns ward at HFH while some were sent to DHQ.",
            "Even though no casualty was brought to BBH, the hospital’s Medical Superintendent Dr Rafiq Ahmed stayed in the hospital along with his team and coordinated supply of blood.",
            "The hospitals remained on alert until 7am when the critically injured were shifted to the Combined Military Hospital (CMH) for further treatment.",
            "Viral video",
            "Soon after the crash, a video of the incident — showing the exact moment of impact — went viral on social media. However, the short seven-second clip which captured the incident did so purely out of luck.",
            "The video had been shot by a hand embroidery weaver who works near the site of the crash.",
            "The weaver told The Express Tribune that he works at the Rabi Centre in the commercial area located just half a kilometre from the crash site.",
            "“We were busy finishing orders for Eidul Azha. Because it gets warm in our workshop, we take our embroidery frames to top floor where there is a cool breeze and it is easy to work,” he explained.",
            "He added that around 2am, they could hear the loud noise and saw a small aircraft flying quite low over the populace.",
            "Noting that the sight was unusual, the embroiderer said that he and some of his colleagues took out their camera-equipped smartphones and started recording videos.",
            "While others stopped, he managed to turn his camera on at the just the right moment to capture the horrific sight.",
            "Aghast at what they had just seen, the embroiderer said that they immediately rushed inside and informed the authorities.",
            "Published in The Express Tribune, July 31st, 2019."
        ]
    },
    {
        "sr_no": 76,
        "newspaper": "Tribune",
        "headline": "Karachi faces massive power breakdown after Lath Dam overflow",
        "link": "https://tribune.com.pk/story/2024831/1-karachi-faces-massive-power-breakdown-lath-dam-overflow/",
        "brief": "",
        "date": "July 31, 2019",
        "detailed_news": [
            "KARACHI: Many areas of the city plunged into darkness on Tuesday night after K-Electric, the city’s power utility, suspended supply to feeders associated with the KDA Grid Station at Gulzar-e-Hijri Scheme 33 due to flooding.",
            "Sohrab Goth, Abul Hassan Isphahani Road, Super Highway and KWSB’s NEK Pumping station among few other areas were the first to be affected, the power distribution company announced on social media.",
            "“Monsoon downpour has caused Lath Dam near Super Highway to overflow. The floodwater has entered K-Electric’s KDA Grid station, one of the most critical grids of KE’s 220kV grid and an interconnection point between KE and NTDC. As an emergency safety measure we are forced to suspend supply to feeders associated with this grid,” it said.",
            "Life remains paralysed as rains continue to lash Karachi",
            "K-Electric warned that it may be forced to completely shut down power from this grid station to ensure safety of the staff and equipment. “We are working closely with all authorities to control this situation. All possible resources including trenches, water pumps and sand bags around the grid have been deployed to block the water,” it added.",
            "Overflow of Lath Dam creates critical situation at KDA Grid.(4)",
            "We are working closely with all authorities to control this situation. All possible resources including trenches, water pumps and sand bags around the grid have been deployed to block the water.",
            "— KE (@KElectricPk) July 30, 2019",
            "However, due to importance of the grid to the KE network, power supply would also be affected to several areas including Gulshan-e-Iqbal, Azizabad, Liaquatabad, Malir, FB Area, Surjani Town, Shadman Town, Gulistan-e-Johar and Shah Faisal Colony among many others if water level continued to rise.",
            "The K-Electric said the armed forces troops had also arrived on the spot to ‘support our efforts’. “All possible resources including trenches, water pumps and sand bags around the grid have been deployed to block the water and our teams are on ground to manage this emergency,” it added.",
            "Overflow of Lath Dam creates critical situation at KDA Grid. (8)Pakistan Army has come to support our efforts. All possible resources including trenches, water pumps & sand bags around the grid have been deployed to block the water & our teams are on ground to manage situation. pic.twitter.com/27EWjlKv8T",
            "— KE (@KElectricPk) July 30, 2019",
            "The day-to-day life has remained paralysed after the current spell of rainfall lashed the port city for the second consecutive day with at least 15 dead in different rain-related incidents.",
            "Floodwater entered different areas of Manghopir, Saadi Town and Superhighway after Thado and Lath dams overflowed.",
            "The Emergency Operations Centre (EOC) said that the Pakistan Army was called in to assist with the rescue operation in the affected areas.",
            "Major parts of Karachi also faced prolonged power outages and some areas remained without electricity for more than 24 hours. Major thoroughfares also remained inundated affecting traffic and commute."
        ]
    },
    {
        "sr_no": 78,
        "newspaper": "Tribune",
        "headline": "Dozens of villages flooded as dams overflow in district West",
        "link": "https://tribune.com.pk/story/2024879/1-dozens-villages-flooded-dams-overflow-district-west/",
        "brief": "",
        "date": "July 31, 2019",
        "detailed_news": [
            "KARACHI: Dozens of small villages near the Northern Bypass were flooded on Tuesday as the first spell of the monsoon rain continued to lash the city for the second consecutive day. The rainwater gushed onto the main Super Highway from the Lat Dam, which overflowed and stopped at the median dividing the two sides of the motorway, which ultimately proved be the saviour for Saadi Town and its adjacent areas. The Super Highway, meanwhile, was blocked for traffic for hours.",
            "Residents of the residential societies built along the Super Highway panicked as they heard news of the incoming torrent. Meanwhile, dozens of heavy and light vehicles were stranded on the Super Highway, leading from the Northern Bypass to the Toll Plaza. Rescue workers and officials of the district administration reached the site to control the situation, but given the circumstances, the army was requisitioned to assist the rescue efforts.",
            "Dozens of villages, including Shahbaz Goth, Wazir Goth, Rasool Bux Brohi Goth and Gabol Goth, located in the area were flooded, with scores of families moving to safer ground out of fear that the situation could deteriorate in case of a breach in the Thado and Lat dams.",
            "Saving grace",
            "Pointing to the three-foot-high wall that acts as the median on the Super Highway, a villager, Abdul Sattar, said that the water was gushing so fast that it would flood Saadi Town and other residential areas located on the right side of the road. “The water could not cross the wall,” he added.",
            "Sattar told The Express Tribune that the roads leading to the villages were submerged in knee-deep water. “We can’t even go to our relatives’ houses and there is no contact with them,” he informed this correspondent, adding that the water was coming from the hilly areas of Balochistan. “It happens when heavy rains fall in the mountains, but there is no planning to handle it.” He said that he, along with his friends and other villagers, were engaged in the rescue work since early morning.",
            "Residents panic",
            "A resident of Saadi Town, Danish Rehmani, told The Express Tribune that though the situation was not like that in 2013, there was panic among the residents. “The news of villages flooding is coming from other side of the road [Super Highway],” he said, adding that some of his friends living near the Thado Dam were in critical situation.",
            "Observing the situation, Rehmani, like other residents, has purchased rations for a week. “Currently, fear exists and residents are not leaving for any safer place but if it [rain] continues, it will certainly bring no good news for residents on this side of the road,” he said.",
            "Another resident of Saadi Town, who had gone to observe the situation around the Super Highway, said that the situation would be critical if the administration failed to take appropriate measures soon. “It [water] is coming to our area but I think the administration will be able to limit its flow,” said Kamran Ahmed.",
            "“At least 15 smaller villagers have been badly disturbed by the recent rains,” Pakistan Tehreek-e-Insaf’s (PTI) president for Sindh chapter and area MPA Haleem Adil Sheikh said. “I have myself visited these villages and found them flooded.” He said that all these villages were located in the limits of District West.",
            "The PTI leader blamed the Sindh government for poor infrastructure. “There is panic among the villagers,” he said. “No one from the government has reached them yet.” He said the situation had been created due to the small dams constructed by local PPP leaders.  He added that several villagers were disconnected from the city.",
            "For his part, Karachi Commissioner Iftikhar Shallwani, who visited the area on Tuesday, said that there was currently no danger of flooding in Saadi Town, Scheme 33 and their adjoining areas.",
            "Published in The Express Tribune, July 31st, 2019."
        ]
    },
    {
        "sr_no": 85,
        "newspaper": "Daily Excelsior",
        "headline": "Tributes paid to soldier in Akhnoor",
        "link": "https://www.dailyexcelsior.com/tributes-paid-to-soldier-in-akhnoor/",
        "brief": "",
        "date": "Wed, 31 Jul 2019 08:12:16 +0000",
        "detailed_news": "<p>JAMMU: Army on Wednesday paid tributes to a jawan in Akhnoor area, here on city outskirts. Naik Krishan Lal on Tuesday attained martyrdom in Sunderbani sector of Rajouri when Pakistan violated ceasefire by firing unprovoked. Defence Spokesperson here said that tributes were paid to him in a ceremonial wreath laying ceremony Major General R Dewan, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com/tributes-paid-to-soldier-in-akhnoor/\">Tributes paid to soldier in Akhnoor</a> appeared first on <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com\">Jammu Kashmir Latest News | Tourism | Breaking News J&amp;K</a>.</p>\n"
    },
    {
        "sr_no": 116,
        "newspaper": "The News",
        "headline": "Army called out as Karachi rain death toll rises to 26",
        "link": "https://www.thenews.com.pk/print/505936-army-called-out-as-karachi-rain-death-toll-rises-to-26",
        "brief": "",
        "date": "Wed, 31 Jul 2019 00:00:00 +0500",
        "detailed_news": "KARACHI: Life in Karachi remained paralysed for the second consecutive day on Tuesday in the aftermath of light-to-moderate rainfall with 12 more deaths besides massive suspension of water and power supplies across the metropolitan city.&nbsp;The city administration had to call the army to rescue people marooned in the city's low-lying outskirts of Surjani Town, Gadap and North Karachi and for saving a major grid station as the Super Highway connecting the city to the upcountry was threatened by hill torrents.&ldquo;Different areas of Karachi continued to receive light to moderate showers from Tuesday morning till afternoon under the influence of a monsoon system that has weakened drastically and would be cleared tonight,&rdquo; Sardar Sarfraz, chief meteorological officer of Sindh, said while talking to The News. &ldquo;The Saddar area received the heaviest rain during the two days where 149 millimeters of rain was recorded since Monday morning.&rdquo; The met office said except for some occasional showers on late Tuesday night or during early Wednesday morning, there were no more chances of rain in the city on Wednesday, bringing the death toll to two days of rainfall to 26. Another 11 people, including children, were injured as roofs and walls of their houses collapsed.Furthermore, a massive water and power crisis hit the city as most of the areas remained without electricity for 20 to 30 hours. The electricity crisis suspended water supply to a large number of areas of Karachi. The National Electric Power Regulatory Authority took serious notice of reports of the massive power breakdown in Karachi, the K-Electric&rsquo;s failure to respond to citizens&rsquo; complaints, and the electrocution incidents, and sought an explanation from the K-Electric.But the K-Electric insisted that the power supply situation was under control. &ldquo;Two days of rainfall put a strain on the system but upgrades across the entire system have allowed response to queries with greater efficiency to address the outages.\"After it rained heavily, the rainwater gushed out of the Thaddo Dam in Gadap Town, overflowing several natural storm water drains and other small dams in Gadap, including Luth and Veeru dams. The water stored in the Lath Dam, situated on the city's suburbs, started overflowing, flooding three goths in the Gadap Town. The raging water suspended traffic movement over a 4-km section of the M9 Motorway (Super Highway) connecting Karachi to Hyderabad and upcountry.Meanwhile, the Motorway Police in a press statement also forbade citizens from using the motorway unnecessarily as an intense wave of water was passing through it. &ldquo;Traffic from the Northern Bypass towards the Karachi Toll Plaza is disrupted,&rdquo; the statement added. Several small settlements, villages in Taiser Town, Malir and Lyari were inundated, including KDA Scheme 33&rsquo;s Saadi Garden and Saadi Town situated near the Karachi-Hyderabad motorway. A contingent of army rescued the people stranded on the Super Highway by boats. The floodwater had entered Shahbaz Goth where people were waiting for help at the time of the story being filed. The water was also heading towards the Saadi Town. The water also entered the K-Electric&rsquo;s 220kV KDA Grid station at Gulzar-e-Hijri Scheme 33, suspending supply to parts of Sohrab Goth, Abul Hassan Isphahani Road, Super Highway, KWSB&rsquo;s NEK Pumping station among few others. The K-Electric warned of power supply suspension to wider areas of Districts Central and East if the water level further rises. Due to prolonged power breakdowns at the pumping stations of the Karachi Water and Sewerage Board, most of the city areas remained without water.The failure of the city&rsquo;s local government and KMC under the mayor to clear the major drains of the city ahead of the rains caused urban flooding across Karachi. The tiff over issue of denial of funds and lack of authority by the mayor pitted the city to the worst urban flooding and that too after light to moderate rainfall. The situation was the worst in Surjani Town and Khuda Ki Basti, where streets were not only flooded but the rainwater entered the houses. Knee-deep water at the main Power House Chowrangi blocked the road for traffic. &ldquo;We don&rsquo;t know what authorities do with these rain drains every year. They always fail to drain out the water from the locality,&rdquo; complained a resident of the Haroon Royal Apartments near the Power House Chowrangi, Owais Muhammad.In District West, hill torrents from the Manghopir hills inundated the entire Khuda Ki Basti from where few residents were evacuated. Residents of the area pooled in money and drained out the water through machinery themselves, as they had no hope from the authorities. &ldquo;Our children fall in gutters and rain drains but the city administration does not pay any heed,&rdquo; said young resident, Ali. &ldquo;This time we didn&rsquo;t wait for the authorities, we collected money, brought pumps and drained out the water.&rdquo;The old city area, Garden, Kharadar and streets leading to the Karachi Zoological Garden in district East were all flooded with rainwater, as the local government failed to deploy any pumps for drainage. Roads in front of the Wazir Mansion, the birthplace museum of Quaid-e-Azam, in Kharadar, were all submerged in rainwater.Due to the construction of three flyovers at District Central's Sher Shah Suri Road, the Sakhi Hassan Chowrangi, the Five Star Chowrangi and the KDA Chowrangi remained inundated on the second day of the rain, as authorities completely failed to drain water. &ldquo;The solid waste swept along the rainwater and flooded the entire Sakhi Hassan Graveyard. The trash and garbage was pooling alongside several graves, with no one to turn to for help. There wasn&rsquo;t any drainage at Nipa Chowrangi, which was also flooded with knee-deep water. A huge crater emerged on a road leading to Sharae Faisal from Tariq Road shutting it down for traffic.Unable to manage the situation, Mayor Akhtar wrote to the federal minister for maritime affairs, Ali Haider Zaidi, for his support. He also appealed to Prime Minister Imran Khan for help, saying since people of Karachi are facing a hard time and the Sindh government has failed owing to its lack of interest, the federal government should help the citizens. He feared that if it rained more, many localities in the city would be completely inundated. He complained that the Sindh government did not give a single vehicle to the KMC despite persistent rains in Karachi.Talking to media at the Liaquatabad Underpass, he said the city was inundated with rainwater after 40 hours of continuous rain due to blocked sewerage lines. Responding to mayor&rsquo;s letter, Zaidi in a tweet said that he also discussed the matter with PM Imran Khan in detail. &ldquo;The federal govt through the maritime ministry will do all it can to address the emergency in Karachi,&rdquo; he said."
    },
    {
        "sr_no": 117,
        "newspaper": "The News",
        "headline": "Army called out as Karachi rain death toll rises to 26",
        "link": "https://www.thenews.com.pk/print/505936-army-called-out-as-karachi-rain-death-toll-rises-to-26",
        "brief": "",
        "date": "Wed, 31 Jul 2019 00:00:00 +0500",
        "detailed_news": "KARACHI: Life in Karachi remained paralysed for the second consecutive day on Tuesday in the aftermath of light-to-moderate rainfall with 12 more deaths besides massive suspension of water and power supplies across the metropolitan city.&nbsp;The city administration had to call the army to rescue people marooned in the city's low-lying outskirts of Surjani Town, Gadap and North Karachi and for saving a major grid station as the Super Highway connecting the city to the upcountry was threatened by hill torrents.&ldquo;Different areas of Karachi continued to receive light to moderate showers from Tuesday morning till afternoon under the influence of a monsoon system that has weakened drastically and would be cleared tonight,&rdquo; Sardar Sarfraz, chief meteorological officer of Sindh, said while talking to The News. &ldquo;The Saddar area received the heaviest rain during the two days where 149 millimeters of rain was recorded since Monday morning.&rdquo; The met office said except for some occasional showers on late Tuesday night or during early Wednesday morning, there were no more chances of rain in the city on Wednesday, bringing the death toll to two days of rainfall to 26. Another 11 people, including children, were injured as roofs and walls of their houses collapsed.Furthermore, a massive water and power crisis hit the city as most of the areas remained without electricity for 20 to 30 hours. The electricity crisis suspended water supply to a large number of areas of Karachi. The National Electric Power Regulatory Authority took serious notice of reports of the massive power breakdown in Karachi, the K-Electric&rsquo;s failure to respond to citizens&rsquo; complaints, and the electrocution incidents, and sought an explanation from the K-Electric.But the K-Electric insisted that the power supply situation was under control. &ldquo;Two days of rainfall put a strain on the system but upgrades across the entire system have allowed response to queries with greater efficiency to address the outages.\"After it rained heavily, the rainwater gushed out of the Thaddo Dam in Gadap Town, overflowing several natural storm water drains and other small dams in Gadap, including Luth and Veeru dams. The water stored in the Lath Dam, situated on the city's suburbs, started overflowing, flooding three goths in the Gadap Town. The raging water suspended traffic movement over a 4-km section of the M9 Motorway (Super Highway) connecting Karachi to Hyderabad and upcountry.Meanwhile, the Motorway Police in a press statement also forbade citizens from using the motorway unnecessarily as an intense wave of water was passing through it. &ldquo;Traffic from the Northern Bypass towards the Karachi Toll Plaza is disrupted,&rdquo; the statement added. Several small settlements, villages in Taiser Town, Malir and Lyari were inundated, including KDA Scheme 33&rsquo;s Saadi Garden and Saadi Town situated near the Karachi-Hyderabad motorway. A contingent of army rescued the people stranded on the Super Highway by boats. The floodwater had entered Shahbaz Goth where people were waiting for help at the time of the story being filed. The water was also heading towards the Saadi Town. The water also entered the K-Electric&rsquo;s 220kV KDA Grid station at Gulzar-e-Hijri Scheme 33, suspending supply to parts of Sohrab Goth, Abul Hassan Isphahani Road, Super Highway, KWSB&rsquo;s NEK Pumping station among few others. The K-Electric warned of power supply suspension to wider areas of Districts Central and East if the water level further rises. Due to prolonged power breakdowns at the pumping stations of the Karachi Water and Sewerage Board, most of the city areas remained without water.The failure of the city&rsquo;s local government and KMC under the mayor to clear the major drains of the city ahead of the rains caused urban flooding across Karachi. The tiff over issue of denial of funds and lack of authority by the mayor pitted the city to the worst urban flooding and that too after light to moderate rainfall. The situation was the worst in Surjani Town and Khuda Ki Basti, where streets were not only flooded but the rainwater entered the houses. Knee-deep water at the main Power House Chowrangi blocked the road for traffic. &ldquo;We don&rsquo;t know what authorities do with these rain drains every year. They always fail to drain out the water from the locality,&rdquo; complained a resident of the Haroon Royal Apartments near the Power House Chowrangi, Owais Muhammad.In District West, hill torrents from the Manghopir hills inundated the entire Khuda Ki Basti from where few residents were evacuated. Residents of the area pooled in money and drained out the water through machinery themselves, as they had no hope from the authorities. &ldquo;Our children fall in gutters and rain drains but the city administration does not pay any heed,&rdquo; said young resident, Ali. &ldquo;This time we didn&rsquo;t wait for the authorities, we collected money, brought pumps and drained out the water.&rdquo;The old city area, Garden, Kharadar and streets leading to the Karachi Zoological Garden in district East were all flooded with rainwater, as the local government failed to deploy any pumps for drainage. Roads in front of the Wazir Mansion, the birthplace museum of Quaid-e-Azam, in Kharadar, were all submerged in rainwater.Due to the construction of three flyovers at District Central's Sher Shah Suri Road, the Sakhi Hassan Chowrangi, the Five Star Chowrangi and the KDA Chowrangi remained inundated on the second day of the rain, as authorities completely failed to drain water. &ldquo;The solid waste swept along the rainwater and flooded the entire Sakhi Hassan Graveyard. The trash and garbage was pooling alongside several graves, with no one to turn to for help. There wasn&rsquo;t any drainage at Nipa Chowrangi, which was also flooded with knee-deep water. A huge crater emerged on a road leading to Sharae Faisal from Tariq Road shutting it down for traffic.Unable to manage the situation, Mayor Akhtar wrote to the federal minister for maritime affairs, Ali Haider Zaidi, for his support. He also appealed to Prime Minister Imran Khan for help, saying since people of Karachi are facing a hard time and the Sindh government has failed owing to its lack of interest, the federal government should help the citizens. He feared that if it rained more, many localities in the city would be completely inundated. He complained that the Sindh government did not give a single vehicle to the KMC despite persistent rains in Karachi.Talking to media at the Liaquatabad Underpass, he said the city was inundated with rainwater after 40 hours of continuous rain due to blocked sewerage lines. Responding to mayor&rsquo;s letter, Zaidi in a tweet said that he also discussed the matter with PM Imran Khan in detail. &ldquo;The federal govt through the maritime ministry will do all it can to address the emergency in Karachi,&rdquo; he said."
    },
    {
        "sr_no": 118,
        "newspaper": "The News",
        "headline": "Army called out as Karachi rain death toll rises to 26",
        "link": "https://www.thenews.com.pk/print/505936-army-called-out-as-karachi-rain-death-toll-rises-to-26",
        "brief": "",
        "date": "Wed, 31 Jul 2019 00:00:00 +0500",
        "detailed_news": "KARACHI: Life in Karachi remained paralysed for the second consecutive day on Tuesday in the aftermath of light-to-moderate rainfall with 12 more deaths besides massive suspension of water and power supplies across the metropolitan city.&nbsp;The city administration had to call the army to rescue people marooned in the city's low-lying outskirts of Surjani Town, Gadap and North Karachi and for saving a major grid station as the Super Highway connecting the city to the upcountry was threatened by hill torrents.&ldquo;Different areas of Karachi continued to receive light to moderate showers from Tuesday morning till afternoon under the influence of a monsoon system that has weakened drastically and would be cleared tonight,&rdquo; Sardar Sarfraz, chief meteorological officer of Sindh, said while talking to The News. &ldquo;The Saddar area received the heaviest rain during the two days where 149 millimeters of rain was recorded since Monday morning.&rdquo; The met office said except for some occasional showers on late Tuesday night or during early Wednesday morning, there were no more chances of rain in the city on Wednesday, bringing the death toll to two days of rainfall to 26. Another 11 people, including children, were injured as roofs and walls of their houses collapsed.Furthermore, a massive water and power crisis hit the city as most of the areas remained without electricity for 20 to 30 hours. The electricity crisis suspended water supply to a large number of areas of Karachi. The National Electric Power Regulatory Authority took serious notice of reports of the massive power breakdown in Karachi, the K-Electric&rsquo;s failure to respond to citizens&rsquo; complaints, and the electrocution incidents, and sought an explanation from the K-Electric.But the K-Electric insisted that the power supply situation was under control. &ldquo;Two days of rainfall put a strain on the system but upgrades across the entire system have allowed response to queries with greater efficiency to address the outages.\"After it rained heavily, the rainwater gushed out of the Thaddo Dam in Gadap Town, overflowing several natural storm water drains and other small dams in Gadap, including Luth and Veeru dams. The water stored in the Lath Dam, situated on the city's suburbs, started overflowing, flooding three goths in the Gadap Town. The raging water suspended traffic movement over a 4-km section of the M9 Motorway (Super Highway) connecting Karachi to Hyderabad and upcountry.Meanwhile, the Motorway Police in a press statement also forbade citizens from using the motorway unnecessarily as an intense wave of water was passing through it. &ldquo;Traffic from the Northern Bypass towards the Karachi Toll Plaza is disrupted,&rdquo; the statement added. Several small settlements, villages in Taiser Town, Malir and Lyari were inundated, including KDA Scheme 33&rsquo;s Saadi Garden and Saadi Town situated near the Karachi-Hyderabad motorway. A contingent of army rescued the people stranded on the Super Highway by boats. The floodwater had entered Shahbaz Goth where people were waiting for help at the time of the story being filed. The water was also heading towards the Saadi Town. The water also entered the K-Electric&rsquo;s 220kV KDA Grid station at Gulzar-e-Hijri Scheme 33, suspending supply to parts of Sohrab Goth, Abul Hassan Isphahani Road, Super Highway, KWSB&rsquo;s NEK Pumping station among few others. The K-Electric warned of power supply suspension to wider areas of Districts Central and East if the water level further rises. Due to prolonged power breakdowns at the pumping stations of the Karachi Water and Sewerage Board, most of the city areas remained without water.The failure of the city&rsquo;s local government and KMC under the mayor to clear the major drains of the city ahead of the rains caused urban flooding across Karachi. The tiff over issue of denial of funds and lack of authority by the mayor pitted the city to the worst urban flooding and that too after light to moderate rainfall. The situation was the worst in Surjani Town and Khuda Ki Basti, where streets were not only flooded but the rainwater entered the houses. Knee-deep water at the main Power House Chowrangi blocked the road for traffic. &ldquo;We don&rsquo;t know what authorities do with these rain drains every year. They always fail to drain out the water from the locality,&rdquo; complained a resident of the Haroon Royal Apartments near the Power House Chowrangi, Owais Muhammad.In District West, hill torrents from the Manghopir hills inundated the entire Khuda Ki Basti from where few residents were evacuated. Residents of the area pooled in money and drained out the water through machinery themselves, as they had no hope from the authorities. &ldquo;Our children fall in gutters and rain drains but the city administration does not pay any heed,&rdquo; said young resident, Ali. &ldquo;This time we didn&rsquo;t wait for the authorities, we collected money, brought pumps and drained out the water.&rdquo;The old city area, Garden, Kharadar and streets leading to the Karachi Zoological Garden in district East were all flooded with rainwater, as the local government failed to deploy any pumps for drainage. Roads in front of the Wazir Mansion, the birthplace museum of Quaid-e-Azam, in Kharadar, were all submerged in rainwater.Due to the construction of three flyovers at District Central's Sher Shah Suri Road, the Sakhi Hassan Chowrangi, the Five Star Chowrangi and the KDA Chowrangi remained inundated on the second day of the rain, as authorities completely failed to drain water. &ldquo;The solid waste swept along the rainwater and flooded the entire Sakhi Hassan Graveyard. The trash and garbage was pooling alongside several graves, with no one to turn to for help. There wasn&rsquo;t any drainage at Nipa Chowrangi, which was also flooded with knee-deep water. A huge crater emerged on a road leading to Sharae Faisal from Tariq Road shutting it down for traffic.Unable to manage the situation, Mayor Akhtar wrote to the federal minister for maritime affairs, Ali Haider Zaidi, for his support. He also appealed to Prime Minister Imran Khan for help, saying since people of Karachi are facing a hard time and the Sindh government has failed owing to its lack of interest, the federal government should help the citizens. He feared that if it rained more, many localities in the city would be completely inundated. He complained that the Sindh government did not give a single vehicle to the KMC despite persistent rains in Karachi.Talking to media at the Liaquatabad Underpass, he said the city was inundated with rainwater after 40 hours of continuous rain due to blocked sewerage lines. Responding to mayor&rsquo;s letter, Zaidi in a tweet said that he also discussed the matter with PM Imran Khan in detail. &ldquo;The federal govt through the maritime ministry will do all it can to address the emergency in Karachi,&rdquo; he said."
    },
    {
        "sr_no": 120,
        "newspaper": "The News",
        "headline": "19 martyred of plane crash laid to rest",
        "link": "https://www.thenews.com.pk/print/505938-19-martyred-of-plane-crash-laid-to-rest",
        "brief": "",
        "date": "Wed, 31 Jul 2019 00:00:00 +0500",
        "detailed_news": "ISLAMABAD: The Namaz-e-Janaza of martyred pilots and crew members who embraced Shahadat in a plane crash near Mora Kalu was offered on Tuesday at Chaklala Garrison.Chief of the Army Staff (COAS) General Qamar Javed Bajwa, serving and retired military personnel and relatives of Shuhada attended the funeral. At least 19 people, including five military personnel and 13 civilians, were martyred when a military aircraft crashed in Mohra Kalu locality near Rawat in the wee hours of Tuesday.Five military officials, including two officers of theranks of Lieutenant Colonel, Saqib and Wasim, Naib Subedar Mohammad Afzal and two Hawaldars, Amin and Rehmat, were martyred in the crash, the ISPR said. It said the aircraft was on a routine training flight when it crashed but there was no immediate word on the cause of the accident or the type of aircraft involved.Thirteen civilians who were martyred in the incident included Muhammad Jamil, Robena, Habib, Parri Bibi, Muhammad Shabbir, Fatma Bibi, Uzma Bibi, Abdul Hafeez, Rahela Bibi, Fiazan Hameed, Fozia Bibi, Audul Rauf, Amna Bibi and Iqra. The injured were identified as Muhammad Yousaf, Shamim, Iqra Bibi, Suria Bibi, Saba Jan and Muhammad Nadeem. Three residents also got minor wounds who were discharged from hospital after medical treatment. The funerals of the martyred civilians were also held in their respective areas.People of the area noticed at around 2:00am the falling aircraft with heavy sound in the Rawat area. A local person said he saw the aircraft crashing with big bang, which caused fire which engulfed four houses. &ldquo;Locals rushed to the scene but the aircraft had burnt to ashes,&rdquo; he said. Volunteers took out the wounded people from the burning houses and shifted them to hospitals.Corps Commander Rawalpindi General Bilal Akbar visited the scene of the crash and met with the locals. Heavy contingent of Police, Rescue 1122 and Army personnel reached the scene soon after the incident and initiated the rescue operation. The rescue operation was completed before dawn when bodies and injured civilians were shifted to the CMH and Holy Family Hospital. Earlier, emergency was declared in all hospitals of Rawalpindi and Islamabad to tackle the situation. Many residents were trapped in derbis of the destroyed houses, a rescuer said, adding that three minors, five women and many people were among the trapped persons who had died before they were retrieved from the debris.After a day-long controversy between Rawalpindi and Islamabad administration regarding the jurisdiction of occurrence, the authorities finally declared that the incident happened in the jurisdiction of Sihala police station falling in the federal capital.President Arif Alvi and Prime Minister Imran Khan expressed their grief and sorrow over the loss of lives in the aircraft crash. In their separate statements, they condoled with the bereaved families and prayed for early recovery of those injured in the incident.Foreign Minister Shah Mehmood Qureshi and PM&rsquo;s Special Assistant on Information and Broadcasting Dr Firdous Ashiq Awan also expressed deep grief and sorrow over the loss of precious lives in the crash and prayed for high reward of the martyrs and courage for the bereaved families to bear this loss with fortitude."
    },
    {
        "sr_no": 123,
        "newspaper": "The News",
        "headline": "‘Pakistan not guarantor but facilitator in Afghan peace process’",
        "link": "https://www.thenews.com.pk/print/505941-pakistan-not-guarantor-but-facilitator-in-afghan-peace-process",
        "brief": "",
        "date": "Wed, 31 Jul 2019 00:00:00 +0500",
        "detailed_news": "ISLAMABAD: Foreign Minister Shah Mehmood Qureshi on Tuesday made it clear that Pakistan was not a guarantor but only a facilitator in the Afghan peace process.Talking to reporters here, Qureshi said the entire onus of the Afghan peace process could not be put on Pakistan, as Pakistan had been maintaining all along that it was a shared responsibility of all stakeholders to take the peace process forward. He said Prime Minister Imran Khan wanted to have a meeting with the Taliban to woo them for the intra-Afghan dialogue. He said Pakistan was moving forward in good faith.&ldquo;The convergence was seen on the Afghan issue during a meeting between PM Imran and the US President Donald Trump,&rdquo; he added. To a question, he said India was neither ready to hold talks bilaterally with Pakistan on the Kashmir dispute nor did it accept the third party mediation.Qureshi said Kashmir was a disputed territory and any demographic changes in the occupied valley will not be acceptable to Pakistan as well as to the Kashmiri people.Days after urgency to resolve the unrest in the Indian Held Kashmir (IHK) was raised in a high-profile meeting between Prime Minister Imran Khan and US President Donald Trump in Washington, Foreign Minister Shah Mehmood Qureshi lauded the European parliamentarians for highlighting the issue in Europe.&ldquo;Successive reports by the Office of the High Commissioner for Human Rights (OHCHR), the UK Parliament&rsquo;s All Parties Parliamentary Kashmir Group (APPKG) report, as well as the hearing by European Parliament&rsquo;s Sub-Committee on Human Rights in Brussels lent credence to Pakistan&rsquo;s stance on the Jammu and Kashmir dispute and helped raise awareness in the international community about the horrendous human rights situation in the IHK,&rdquo; said Foreign Minister Shah Mehmood Qureshi. He was speaking to a 10-member delegation of European parliamentarians which called on him and discussed the deteriorating human rights situation in the IHK.The delegation comprises MEP Richard Corbett, leader of the Labour Party in Europe MEP Irina Von Wiese, Member of the Foreign Affairs Committee and MP Nazia Rehman. The delegation is on an 8-day visit to Pakistan and Azad Jammu and Kashmir, says a statement issued by the office of the Foreign Minister.Highlighting the Jammu and Kashmir dispute, the foreign minister appreciated the efforts of Pakistani and Kashmiri diaspora and of those involved in raising the issue of gross human rights violations in the IHK in Europe and beyond.&ldquo;The foreign minister stressed the need for consistent efforts to build upon the current momentum and sensitize the international community to the deplorable situation of human rights in the IHK,&rdquo; said the statement.He also reaffirmed Pakistan&rsquo;s principled political, diplomatic and moral support to Kashmiris in their just struggle for the right to self-determination."
    }
]