[
    {
        "sr_no": 9,
        "newspaper": "kashmir Times",
        "headline": "Civilian injured in Pak shelling in Poonch",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92933",
        "brief": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the se...",
        "date": "7/24/2019 3:07:43 PM",
        "detailed_news": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the second consecutive day on Tuesday.One civilian sustained minor injuries during ceasefire at 20.00 hours. The injured has been identified as Sher Mohd, 45, son of Mohammed Muneer resident of Mohalla  Bahchari Baloni.Defense PRO Lt Col Devender Anand, while confirming ceasefire violation by Pakistan, said, “This afternoon Pakistani army violated ceasefire in Dalhan sector of Poonch district. Indian army retaliated with equal caliber.”“Later Pakistan violated the ceasefire in Krishna Ghati, Mankote & Mendhar sectors of Poonch district. Pak initiated unprovoked ceasefire violation at around 1220 hours along LoC with firing of small arms in Poonch sector. Indian army befittingly retaliated the cross-border firing by the Pakistani army,’ he added.Local army sources said this afternoon at about 12.20 PM, Pakistani army opened indiscriminate fire towards Indian forward posts and civilian areas in Dalhan sector in Haveli. “Heavy mortar shelling was witnessed during ceasefire violation which was retaliated by India in equal measure. Both sides exchanged heavy gun fire and mortar shelling in the area,” Mohammed Sadiq, a local said. “In Pak shelling, two houses in our village were partially damaged. A number of forward LoC locations remained affected due to shelling and civilians were forced to remain inside their houses. The exchange of fire stopped at around 2.55 PM,” he added.Later this afternoon at around 3.25 PM, Pakistani army initiated unprovoked firing and shelling along the LoC in Krishna Ghati, Mankote sectors of Mendhar tehsil of Poonch district. Indian side too retaliated effectively and strongly.This was the third such violation in the past four days which left an army jawan dead and a civilian injured, the officials said. On Monday, Rifleman Mohammad Arif Shafi Alam Khan Pathan was killed in unprovoked firing by Pakistani troops in Sunderbani sector of Rajouri district.A civilian was injured in Pakistani firing in Balnoi village along the LoC in Mendhar sector of Poonch district on Saturday."
    },
    {
        "sr_no": 10,
        "newspaper": "kashmir Times",
        "headline": "Teenager shoots herself to death in Reasi",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92912",
        "brief": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. \r\nPolice stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at p...",
        "date": "7/24/2019 1:04:04 PM",
        "detailed_news": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. Police stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at present staying at Mamankote in the house of her maternal uncle Chamail Singh, son of Punjab Singh, who is serving in Indian army and presently posted in Haryana. “This evening she shot herself with her maternal uncle’s 12 bore rifle and died on spot. A case in this regard registered at Police Station Chassana and police started investigation to find the cause behind this extreme step,” police added."
    },
    {
        "sr_no": 12,
        "newspaper": "kashmir Times",
        "headline": "Rifleman killed in Pak firing in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92909",
        "brief": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.\r\nPRO Defence Lt Col Devender Anand, while confir...",
        "date": "7/24/2019 1:02:45 PM",
        "detailed_news": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.PRO Defence Lt Col Devender Anand, while confirming the ceasefire violation by neighbouring nation and death of a soldier, said, “Pakistan resorted to unprovoked ceasefire violation on the Line of Control (LoC). It resorted to mortar shelling and firing of small arms in the Sunderbani sector in the early hours. In the incident, Rifleman Mohammed Atif Shafi Alam Khan Pathan was critically injured. Rifleman was air evacuated to army hospital, where he succumbed to the injuries.”  “Indian troops responded strongly and inflicted heavy damage to Pakistan army posts and casualties to Pakistan soldiers in retaliation. However, the details of the damage on the Pakistan side are yet to be ascertained,” he added.“Rifleman Pathan, a young soldier, belonged to village Nawayard, tehsil Fatehganj district Vadodara, Gujarat and is survived by his parents, father Shafi Alam Khan Pathan and mother Habiban Banu. Rifleman Mohammed Atif Shafi Alam Khan Pathan was a brave, highly motivated and sincere soldier. The nation will always remain indebted to him for the supreme sacrifice and devotion to duty,” Defence spokesperson Lt Col Anand said.A police official said the cross-border firing started around 6.30 AM and continued intermittently for several hours, causing panic among the border residents who were advised to take necessary precautionary measures for their safety. This was the second ceasefire violation by Pakistan along the LoC in Jammu region in last three days.On Saturday, during the visit of Defence Minister Rajnath Singh to different parts of the state, Pakistani troops targeted Mendhar sector of Poonch district causing bullet injuries to a civilian in Balnoi village."
    },
    {
        "sr_no": 26,
        "newspaper": "Greater Times",
        "headline": "Burglars wearing army fatigues, holding toy guns loot family in north Kashmir's Sopore",
        "link": "https://www.greaterkashmir.com/news/kashmir/burglars-wearing-army-fatigues-holding-toy-guns-loot-family-in-north-kashmirs-sopore/?utm_source=rss&utm_medium=rss&utm_campaign=burglars-wearing-army-fatigues-holding-toy-guns-loot-family-in-north-kashmirs-sopore",
        "brief": "",
        "date": "Sun, 28 Jul 2019 06:31:25 +0000",
        "detailed_news": "A group of burglars wearing army fatigues and holding toy guns looted a family in Sopore area of Baramulla district in north Kashmir last night. Reports said that a group of masked men holding toy guns barged inside the house of Mohammad Altaf Janwari son of Ghulam Qadir Janwari of Alamdar Mohallah in Krankshivan area<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/kashmir/burglars-wearing-army-fatigues-holding-toy-guns-loot-family-in-north-kashmirs-sopore/\">Read More</a>"
    },
    {
        "sr_no": 34,
        "newspaper": "Greater Times",
        "headline": "10 Pakistani soldiers killed",
        "link": "https://www.greaterkashmir.com/news/todays-paper/world-todays-paper/10-pakistani-soldiers-killed/?utm_source=rss&utm_medium=rss&utm_campaign=10-pakistani-soldiers-killed",
        "brief": "",
        "date": "Sat, 27 Jul 2019 19:32:55 +0000",
        "detailed_news": "Unidentified militants attacked Pakistani security forces in the tribal North Waziristan district and the restive Balochistan province on Saturday, killing 10 soldiers, including an officer. In the first incident, six Pakistan Army soldiers were killed when the terrorists opened fire on a border patrolling party near Gurbaz area of North Waziristan district bordering Afghanistan. The<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/todays-paper/world-todays-paper/10-pakistani-soldiers-killed/\">Read More</a>"
    },
    {
        "sr_no": 72,
        "newspaper": "Dawn",
        "headline": "Taliban reject direct talks with Afghan government",
        "link": "https://www.dawn.com/news/1496714/taliban-reject-direct-talks-with-afghan-government",
        "brief": "",
        "date": "Updated July 28, 2019",
        "detailed_news": [
            "The Taliban said on Sunday they will not hold direct talks with Afghan government and rejected a statement from a senior minister about plans to hold the meeting within the next two weeks, a senior Taliban official said. ",
            "\"Intra-Afghan talks will start only after a foreign force withdrawal is announced,\" said Suhail Shaheen, a spokesman for the Taliban's political office in Qatar. ",
            "On Saturday, Afghanistan's state minister for peace affairs Abdul Salam Rahimi said the government would be represented by a 15-member delegation during direct talks with the Taliban \"in the coming two weeks\".",
            "The Taliban have been holding peace talks with the United States (US) for nearly a year but have refused to meet with the government, which it views as a puppet regime. ",
            "US envoy Zalmay Khalilzad, who is currently visiting Kabul, tweeted that another round of \"intra-Afghan\" talks will occur \"after we conclude our own agreements.\" ",
            "He said it would include the Taliban and \"an inclusive and effective national negotiating team consisting of senior government officials, key political party representatives, civil society and women.\""
        ]
    },
    {
        "sr_no": 83,
        "newspaper": "Tribune",
        "headline": "Captain among 10 soldiers martyred in two terrorist attacks",
        "link": "https://tribune.com.pk/story/2022737/1-six-soldiers-martyred-cross-border-attack/",
        "brief": "",
        "date": "July 27, 2019",
        "detailed_news": [
            "PESHAWAR / QUETTA: Two deadly attacks in the northwest and southwest of the country broke a relative lull in terrorist violence on Saturday. Ten soldiers – among them a captain – were martyred in the assaults on the security forces in North Waziristan tribal district of Khyber-Pakhtunkhwa and Turbat city of Balochistan.",
            "Army chief General Qamar Javed Bajwa described the two attacks as “dying efforts of frustrated inimical forces” while urging the international community to “facilitate regional peace”.",
            "“Salute to martyrs & families.We shall ensure defence & security of motherland at the cost of our sweat & blood.These are dying efforts of frustrated inimical forces while Pakistan moves from stability to enduring peace. It’s time for the world to facilitate regional peace”,COAS.",
            "— DG ISPR (@OfficialDGISPR) July 27, 2019",
            "In the first assault, six soldiers were martyred when their patrol came under attack in the Shawal tehsil of North Waziristan district close to the border with Afghanistan. According to the Inter-Services Public Relations (ISPR), the attack, which happened in the Gurbaz area of Shawal, was perpetrated by terrorists from across the border.",
            "The martyrs were shifted to Miramshah, the main city of North Waziristan, while the injured were ferried to a military hospital in the neighbouring Dera Ismail Khan district. The military has identified the martyrs as Havaldar Khalid, Sepoy Naveed, Sepoy Bachal, Sepoy Ali Raza, Sepoy M Babar, and Sepoy Ehsan.",
            "The area was cordoned off and a search operation was mounted after the deadly assault which, according to the media has been claimed by the Tehreek-e-Taliban Pakistan, the outlawed terrorist group which has found sanctuaries in Afghanistan after they were routed in a series of military offensives in the erstwhile tribal regions.",
            "North Waziristan – once a focal point in the global war on terror – held provincial elections for the first time earlier this month, a key step in bringing the region into the political mainstream after years of turmoil fuelled by terrorism.",
            "In the second attack, terrorists ambushed a patrol of the Frontier Corps in an area between Hushab and Turbat city on Friday, according to the military’s media wing. Four paramilitary soldiers were martyred in the ambush, the ISPR said while identifying the fatalities as Captain Aaqib, Sepoy Nadir, Sepoy Atif Altaf and Sepoy Hafeezullah.",
            "There was no immediate claim of responsibility for the attack, but Baloch terrorist groups fighting a low key insurgency in the province have carried out such attacks in the past. The deadliest of all these groups, the Balochistan Liberation Army (BLA), was designated by the United States as a global terrorist entity earlier this month.",
            "Balochistan is an important part of transport and energy projects that form part of China’s Belt and Road initiative, which has brought $57 billion of investment to Pakistan. India has publicly opposed the massive project, called China-Pakistan Economic Corridor.",
            "Pakistan has successfully stemmed the tide of terrorist violence as a result of a massive military operation, code-named Zarb-e-Azb, in 2014 in which the command and control centre of terrorists and their bomb-making factories had been decimated. The significant drop in terrorist violence has been acknowledged by national and international think tanks and monitors.",
            "According to the annual report of The Center for Research and Security Studies, violence-related casualties continued to decline in 2018, registering 45% drop from the previous year and 86% drop since 2013. However, the year 2019 saw a relative resurge in terrorist violence which Pakistani officials say is being fuelled by hostile agencies, India’s RAW in particular.",
            "The chief military spokesperson hinted at the possible involvement of foreign forces in the latest attacks. “Shahadat of 6 soldiers on Pak-Afghan border & 4 in Balochistan is the sacrifice Pakistan [is] making for peace in the region,” Maj Gen Asif Ghafoor wrote on his official Twitter handle.",
            "“While security of [erstwhile] tribal areas has been improved with efforts now focused to solidify [the] border, inimical forces are attempting to destabilise Balochistan. Their efforts shall Insha Allah fail,” he said in his tweet.",
            "Shahadat of 6 sldrs on Pak-Afg Bdr & 4 in Bln is the sacrifice Pakistan making for peace in the region. While security of tribal areas has been improved with efforts now focused to solidify border, inimical forces are attempting to destabilise Bln. Their efforts shall IA fail.",
            "— DG ISPR (@OfficialDGISPR) July 27, 2019",
            "Army chief Gen Qamar while paying tributes to the martyrs called upon the international community to facilitate peace in the region. “Salute to [the] martyrs & families. We shall ensure defence & security of [the] motherland at the cost of our sweat & blood,” Maj Gen Ghafoor quoted him as saying.",
            "“These are dying efforts of frustrated inimical forces while Pakistan moves from stability to enduring peace. It’s time for the world to facilitate regional peace,” the army chief further said.",
            "The two deadly attacks came days after a meeting between US President Donald Trump and Prime Minister Imran Khan which focused on Pakistan’s crucial role in helping to broker a political settlement to America’s longest, costliest and deadliest war in Afghanistan.",
            "The timing of the attacks is a telling reminder that whenever Pakistan moved to play a direct role in restoring peace in the strife-torn Afghanistan, inimical forces sabotaged these efforts in an attempt to deny Islamabad any credit for putting an end to the bloody war in its neighbourhood.",
            "Prime Minister Imran Khan also took to Twitter to condemn the attacks and laud the resolve of the armed forces in the country’s fight against terrorism.",
            "“My condolences and prayers go to the families of the 10 brave soldiers, including an officer, martyred fighting terrorists in North Waziristan and Balochistan today,” he wrote.",
            "I salute our armed forces personnel who continue to lay down their lives fighting terrorists to keep the nation safe. My condolences & prayers go to the families of the10 brave soldiers, including an officer, martyred fighting terrorists in North Waziristan & Balochistan today.",
            "— Imran Khan (@ImranKhanPTI) July 27, 2019",
            "K-P Chief Minister Mahmood Khan expressed grief over the martyrdom of the army soldiers. “We will eliminate terrorism from the country as the morale of the population is high,” he said. “Enemies of the country will never be successful in their plans.”",
            "Balochistan Chief Minister Jam Kamal Khan also condemned the terror attack in Turbat. “Coward terrorists have once again attacked the security forces that are making endless sacrifices for our country,” he said in a statement.",
            "(With additional input from agencies)"
        ]
    },
    {
        "sr_no": 94,
        "newspaper": "Daily Excelsior",
        "headline": "Two Army jawans injured  in road accident in Srinagar",
        "link": "https://www.dailyexcelsior.com/two-army-jawans-injured-in-road-accident-in-srinagar/",
        "brief": "",
        "date": "Sun, 28 Jul 2019 08:38:53 +0000",
        "detailed_news": "<p>SRINAGAR: Two Army jawans were injured in a road accident in the outskirts of the summer capital, on Sunday. Official sources said that an Army vehicle, which was part of a convoy, skidded off the road and turned turtle near Nowgam in the city outskirts. “Two jawans were injured in the accident,” they said. They [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com/two-army-jawans-injured-in-road-accident-in-srinagar/\">Two Army jawans injured  in road accident in Srinagar</a> appeared first on <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com\">Jammu Kashmir Latest News | Tourism | Breaking News J&amp;K</a>.</p>\n"
    },
    {
        "sr_no": 96,
        "newspaper": "Daily Excelsior",
        "headline": "Army pays tribute to soldier martyred in operation to foil infiltration bid",
        "link": "https://www.dailyexcelsior.com/army-pays-tribute-to-soldier-martyred-in-operation-to-foil-infiltration-bid/",
        "brief": "",
        "date": "Sun, 28 Jul 2019 08:25:36 +0000",
        "detailed_news": "<p>SRINAGAR: The Army Sunday paid floral tributes to Lance Naik Rajinder Singh who was martyred as troops foiled an infiltration bid along the Line of Control (LoC) in Machhil sector of Jammu and Kashmir on Saturday. \u0093In a solemn ceremony at Badamibagh Cantonment, Chinar Corps Commander Lt Gen K J S Dhillon and all ranks [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com/army-pays-tribute-to-soldier-martyred-in-operation-to-foil-infiltration-bid/\">Army pays tribute to soldier martyred in operation to foil infiltration bid</a> appeared first on <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com\">Jammu Kashmir Latest News | Tourism | Breaking News J&amp;K</a>.</p>\n"
    },
    {
        "sr_no": 110,
        "newspaper": "State Times",
        "headline": "Top Pakistani JeM terrorist, associate killed in Shopian",
        "link": "http://news.statetimes.in/top-pakistani-jem-terrorist-associate-killed-in-shopian/",
        "brief": "",
        "date": "Sat, 27 Jul 2019 20:03:15 +0000",
        "detailed_news": "‘Security forces given free hand’ STATE TIMES NEWS Srinagar: Two terrorists, including a top Jaish-e-Mohammed (JeM) commander from Pakistan responsible for a car blast last month that claimed the lives of two Army jawans, were killed on Saturday in an encounter with security forces in Shopian district, police said. Munna Lahori, a Pakistani national, was [&#8230;]"
    },
    {
        "sr_no": 112,
        "newspaper": "State Times",
        "headline": "Lt Gen Paramjit Singh to be new DGMO of Army",
        "link": "http://news.statetimes.in/lt-gen-paramjit-singh-to-be-new-dgmo-of-army/",
        "brief": "",
        "date": "Sat, 27 Jul 2019 19:59:51 +0000",
        "detailed_news": "STATE TIMES NEWS New Delhi: Lt Gen Paramjit Singh, who has vast experience in counter-terror operations, will be the next Director General of Military Operations (DGMO) of the Indian Army, official sources said on Saturday. Lt Gen Singh, currently serving as General Officer Commanding of the Army&#8217;s Nagrota-based XVI Corps, will take over as the [&#8230;]"
    }
]