[
    {
        "sr_no": 3,
        "newspaper": "kashmir Times",
        "headline": "Civilian injured in Pak shelling in Poonch",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92933",
        "brief": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the se...",
        "date": "7/24/2019 3:07:43 PM",
        "detailed_news": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the second consecutive day on Tuesday.One civilian sustained minor injuries during ceasefire at 20.00 hours. The injured has been identified as Sher Mohd, 45, son of Mohammed Muneer resident of Mohalla  Bahchari Baloni.Defense PRO Lt Col Devender Anand, while confirming ceasefire violation by Pakistan, said, “This afternoon Pakistani army violated ceasefire in Dalhan sector of Poonch district. Indian army retaliated with equal caliber.”“Later Pakistan violated the ceasefire in Krishna Ghati, Mankote & Mendhar sectors of Poonch district. Pak initiated unprovoked ceasefire violation at around 1220 hours along LoC with firing of small arms in Poonch sector. Indian army befittingly retaliated the cross-border firing by the Pakistani army,’ he added.Local army sources said this afternoon at about 12.20 PM, Pakistani army opened indiscriminate fire towards Indian forward posts and civilian areas in Dalhan sector in Haveli. “Heavy mortar shelling was witnessed during ceasefire violation which was retaliated by India in equal measure. Both sides exchanged heavy gun fire and mortar shelling in the area,” Mohammed Sadiq, a local said. “In Pak shelling, two houses in our village were partially damaged. A number of forward LoC locations remained affected due to shelling and civilians were forced to remain inside their houses. The exchange of fire stopped at around 2.55 PM,” he added.Later this afternoon at around 3.25 PM, Pakistani army initiated unprovoked firing and shelling along the LoC in Krishna Ghati, Mankote sectors of Mendhar tehsil of Poonch district. Indian side too retaliated effectively and strongly.This was the third such violation in the past four days which left an army jawan dead and a civilian injured, the officials said. On Monday, Rifleman Mohammad Arif Shafi Alam Khan Pathan was killed in unprovoked firing by Pakistani troops in Sunderbani sector of Rajouri district.A civilian was injured in Pakistani firing in Balnoi village along the LoC in Mendhar sector of Poonch district on Saturday."
    },
    {
        "sr_no": 4,
        "newspaper": "kashmir Times",
        "headline": "Teenager shoots herself to death in Reasi",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92912",
        "brief": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. \r\nPolice stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at p...",
        "date": "7/24/2019 1:04:04 PM",
        "detailed_news": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. Police stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at present staying at Mamankote in the house of her maternal uncle Chamail Singh, son of Punjab Singh, who is serving in Indian army and presently posted in Haryana. “This evening she shot herself with her maternal uncle’s 12 bore rifle and died on spot. A case in this regard registered at Police Station Chassana and police started investigation to find the cause behind this extreme step,” police added."
    },
    {
        "sr_no": 6,
        "newspaper": "kashmir Times",
        "headline": "Rifleman killed in Pak firing in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92909",
        "brief": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.\r\nPRO Defence Lt Col Devender Anand, while confir...",
        "date": "7/24/2019 1:02:45 PM",
        "detailed_news": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.PRO Defence Lt Col Devender Anand, while confirming the ceasefire violation by neighbouring nation and death of a soldier, said, “Pakistan resorted to unprovoked ceasefire violation on the Line of Control (LoC). It resorted to mortar shelling and firing of small arms in the Sunderbani sector in the early hours. In the incident, Rifleman Mohammed Atif Shafi Alam Khan Pathan was critically injured. Rifleman was air evacuated to army hospital, where he succumbed to the injuries.”  “Indian troops responded strongly and inflicted heavy damage to Pakistan army posts and casualties to Pakistan soldiers in retaliation. However, the details of the damage on the Pakistan side are yet to be ascertained,” he added.“Rifleman Pathan, a young soldier, belonged to village Nawayard, tehsil Fatehganj district Vadodara, Gujarat and is survived by his parents, father Shafi Alam Khan Pathan and mother Habiban Banu. Rifleman Mohammed Atif Shafi Alam Khan Pathan was a brave, highly motivated and sincere soldier. The nation will always remain indebted to him for the supreme sacrifice and devotion to duty,” Defence spokesperson Lt Col Anand said.A police official said the cross-border firing started around 6.30 AM and continued intermittently for several hours, causing panic among the border residents who were advised to take necessary precautionary measures for their safety. This was the second ceasefire violation by Pakistan along the LoC in Jammu region in last three days.On Saturday, during the visit of Defence Minister Rajnath Singh to different parts of the state, Pakistani troops targeted Mendhar sector of Poonch district causing bullet injuries to a civilian in Balnoi village."
    },
    {
        "sr_no": 17,
        "newspaper": "kashmir Times",
        "headline": "Onus, now, on separatists: Rajnath",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92827",
        "brief": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.\r\nHis assertion came with a reminder that he had al...",
        "date": "7/21/2019 12:48:14 PM",
        "detailed_news": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.His assertion came with a reminder that he had already made exhaustive efforts to bring them to dialogue table as the Home Minister of the country, (in first tenure of Modi-government). Now it’s for them (separatists) to act to make things move - whatever way, he plainly told when queried about stand-off on the need of political initiative in Kashmir after effectively containing militancy in the Valley, as claimed by the government. The Defence Minister was speaking to media persons after inaugurating the 1000-meter long Ujh bridge along the International Border (IB) in Kathua district. “What stand-off..? There’s no stand-off. Jitni Pehl Iss Desh Key Griha-Mantri Ko Karni Chahiye Thi Utni Pehl To Maine Pehle Kardi… Ab Uskay Baad Woh Faisla Karengay Key Kya Karna Hai.. (The efforts and initiatives, expected from the Home Minister of this country, have already been exhausted by me in my tenure as the Union Home Minister… Now it is for them to take a call as what they want to do…),” he said.  Responding to another query related to “Operation All–Out” in the Valley to weed-out terrorism, Rajnath said that day was not far off to achieve that mark. “There are no two opinions about it that the Kashmir will get rid of terrorism very soon. Rest assured….it’s going to happen very soon. More so, I believe- as in case of any act of terror occurring anywhere in the world, the way the international community is rallying around on one platform, joining hands to take on this threat, it (terrorism) will be wiped out of - not only Kashmir, Jammu ...but the entire world,” he said.What was that challenge which was main obstacle in resolving Kashmir, in the Defence Minister’s opinion as he had earlier served as the Union Home Minister also? Faced with this query, Rajnath said, “There’s no need to analyse that challenge here. Whatever be the challenge, it will be tackled. We very well know all the reasons, we’ll sort them out and J&K will be rid of terrorism, for sure.”   In response to queries related to recurrent ceasefire violations by Pakistan on IB and LoC, even on the day of his visit to J&K today and the probability of another Kargil-like misadventure by the neighbouring nation (Pak), his terse reply was, “This message is for all the countrymen- Have faith in our country’s leadership - the Prime Minister Narendra Modi and the valiant jawans and officers of our armed forces. They will not let down your faith in them.”Earlier he said, “I’ve just returned from Kargil. Accompanied by the Army Chief General Bipin Rawat and Union Minister of State in PMO Dr Jitendra Singh, I saw those majestic peaks, which were freed from the clutches of Pakistan by our valiant soldiers by laying down their lives yet not before incurring a crushing defeat to the enemy and failing its evil designs. I’ve just witnessed the testimonies to their (gallant soldiers’) valour and heroic deeds which earned India a proud victory.”Rajnath stated that the Ujh bridge, which as per Director General-Border Road Organisation’s assertion, was the longest bridge constructed by the organization anywhere in the country, would ease problems of border residents related to connectivity. “In the form of bridge, the long pending demand of border residents has been realized. The strenuous efforts of Border Road Organisation (BRO) to complete this bridge in stipulated period despite lot of problems and hostile conditions are, undoubtedly, laudable,” the Defence Minister said."
    },
    {
        "sr_no": 22,
        "newspaper": "kashmir Times",
        "headline": "Army pays tribute to brave-heart",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92766",
        "brief": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. \r\nToday, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid hom...",
        "date": "7/19/2019 10:28:45 AM",
        "detailed_news": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. Today, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid homage to the martyr on behalf of a proud nation.Singh was 35 years old and had joined the Army in 2002. He belonged to Village Tibba of Dhuri Tehsil in Sangrur District of Punjab and is survived by wife, a son and a daughter."
    },
    {
        "sr_no": 25,
        "newspaper": "kashmir Times",
        "headline": "Village girl turned IAF fighter pilot inspiring J&K youngsters",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92763",
        "brief": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. \r\nIn a series of motivational lectures, Thakur told s...",
        "date": "7/19/2019 10:28:04 AM",
        "detailed_news": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. In a series of motivational lectures, Thakur told students on Thursday that the decision to come to Bhadarwah to take part in the \"Sangam Youth Festival\" organised by the army changed her life forever as she decided to join the armed forces. Hailing from Billan Bowlian in Udhampur district, Thakur joined the IAF as a fighter pilot this year, one of the first few women in the country to have done so. Her motivational lectures, organised by the Rashtriya Rifles unit based at Bhadarwah, are inspiring youngsters, especially girls, in the state to make a mark in life. “I decided that I had to go for it, whatever it took. I would want every young boy and girl wanting to become a fighter pilot to dream big,” Thakur told. In her message to the students of Kendriya Vidyalaya and PG College Bhadarwah, she said, “Your dreams may seem unconquerable at the moment. But you must chase those so hard that they become reality.” Stating that a \"combination of average qualities\" in her made her unique, Thakur said, “I climbed the ladder step by step, committing some mistakes as well, but kept going as I learned it the hard way. Instead of mourning over your failures and get into self pity, you should work harder to achieve your goals.” She said being an NCC cadet helped her keep her nerves in the most difficult situations. The lectures were followed by question-answer sessions with the students. Aarushi, a Class 12 science student of Kendriya Vidyalaya, said she always thought becoming a doctor was the only option for her but Thakur''s words changed that. “I already feel like flying as joining the army is my childhood dream. I will definitely strive harder to make my dream a reality,” she said. Komal Katal (27) of Garh Bhadarwah village said, “I always wanted to join the Army but in this part of the state, I never got an opportunity to try my luck. Although I could not appear in AFCAT (Air Force Common Admission Test) because of the age bar, after attending the lecture of Jubiksha, I will work harder and give it a try to join the Territorial Army.” Besides Thakur, Commanding Officer, 4 Rashtriya Rifles Colonel D D Pandey also shared his experiences with the students. “You should be passionate about your dreams and to reach your destination, you should not hesitate and think longer to take your first step. Just start your journey today and you will definitely reach your destination,” he said."
    },
    {
        "sr_no": 42,
        "newspaper": "Dawn",
        "headline": "Europe's record-setting heatwave to spike even higher\n",
        "link": "https://www.dawn.com/news/1496144/europes-record-setting-heatwave-to-spike-even-higher",
        "brief": "",
        "date": "July 25, 2019",
        "detailed_news": [
            "A dangerously intense heatwave across much of Europe is to spike even higher on Thursday after already breaking records in several countries, impacting rail traffic and sending people in search of shade and water. ",
            "Paris was expected to see the mercury soar to as much as 41 or 42 degrees Celsius, breaking a 70-year-plus record of 40.4C and turning the Unesco-listed capital into a baking urban bowl. ",
            "Britain's Met Office predicted a chance that the UK record of 38.5C, which was recorded in Faversham, Kent, in August 2004, would also be exceeded on Thursday. ",
            "On Wednesday, Belgium, Germany and the Netherlands all recorded their all-time highest temperatures. ",
            "Thursday was forecast to be the peak of Europe's latest heatwave — the second in less than a month and impetus for new focus to be given to climate change. Cooler weather with rain was expected to provide relief from Friday. ",
            "The body-sapping, leaden, shrivelling heat was posing difficulties for humans, animals and crops across the continent. ",
            "The northern third of France, including Paris, was under a red alert while the rest of the country had a yellow warning and water-use restrictions were in force. ",
            "Cyclists in the Tour de France in southern France had to puff their way over the course in well over 30C. ",
            "In the Netherlands, farmers have been leaving their cows outside to sleep, rather than bringing them in at night, while Dutch media said hundreds of pigs died when a ventilator failed at Middelharnis. ",
            "On Wednesday, the southern Dutch town of Gilze-Rijen experienced 38.8C heat, surpassing a record dating back 75 years. ",
            "Belgium registered an all-time high of 39.9C at the Kleine-Brogel military base, beating a record that dated back to June 1947. ",
            "And Germany's western town of Geilenkirche sweltered through 40.5C. ",
            "Trains in Britain and France were slowed in response to the extreme weather. ",
            "French rail operator SNCF advised travellers in the worst affected areas to delay journeys planned at the peak of the heatwave Thursday. ",
            "Thalys and Eurostar train services between Brussels, Paris and London were on Wednesday disrupted by a failure on an overhead power line, although it was not immediately clear if this was due to the heatwave. ",
            "A Eurostar train bound for London tore down part of the cable support just outside Brussels. The 600 passengers were eventually taken back to Brussels, the Belga news agency said. ",
            "Across the area affected by the unusually high heat, people tried to cool off in lakes and rivers. ",
            "In London, police were searching for three people who went missing in the River Thames after going swimming while three people have drowned in Germany since Tuesday. ",
            "France's weather office said the scorching conditions “require particular care, notably for vulnerable or exposed people” with almost the entire country under an orange-level weather alert, the second-highest level. ",
            "Paris, in particular, remains haunted by the early summer of 2003 when 15,000 deaths were blamed on the heat and the authorities were bitterly criticised for not mobilising fast enough. ",
            "“We need to take care of ourselves but above all others especially those who are alone, and be able to detect the first symptoms of heatstroke,” said Prime Minister Edouard Philippe. ",
            "Local authorities have placed restrictions on water usage in many areas due to drought-like conditions that have seen ground and river water levels fall dramatically. ",
            "This summer's second heatwave has amplified concerns in Europe that human activity is heating the planet at a dangerous rate. ",
            "The June 26-28 blast of heat in France was four degrees Celsius hotter than an equally rare June heatwave would have been in 1900, the World Weather Attribution (WWA) team said this month.",
            "One study by the Swiss Federal Institute of Technology said the deadly, weeks-long heatwave across northern Europe in 2018 would have been statistically impossible without climate change. "
        ]
    },
    {
        "sr_no": 48,
        "newspaper": "Dawn",
        "headline": "At least 7 killed as multiple blasts rock Kabul\n",
        "link": "https://www.dawn.com/news/1496134/at-least-7-killed-as-multiple-blasts-rock-kabul",
        "brief": "",
        "date": "Updated July 25, 2019",
        "detailed_news": [
            "At least seven people were killed and 21 wounded by three blasts that rocked the Afghan capital on Thursday ahead of the election season. ",
            "The bombing comes amid an increase in violence in Kabul and around Afghanistan, where the war is taking a continued toll even amid a US-led effort to make a peace deal with the Taliban. ",
            "No group immediately claimed responsibility for the attacks, which came just three days before the official campaign season for the September 28 presidential election gets underway. ",
            "Previous polls have been marred by violence and bloodshed from the Taliban and other insurgent groups who refuse to recognise Afghanistan's fragile democracy. ",
            "According to interior ministry spokesman Nasrat Rahimi, the first blast came around 8:10am Kabul time when a suicide bomber riding a motorcycle hit a bus in eastern Kabul. He said the bus belonged to the ministry of mines and petroleum. ",
            "Rahimi said two other blasts had occurred, including a car bomb, also in eastern Kabul. ",
            "Rahimi put the death toll at seven with another 21 wounded. It was not immediately clear if this was from all the blasts or just the first. ",
            "Health ministry spokesman Wahidullah Mayar gave the same toll. ",
            " ",
            "Pakistan condemned the attacks. In a post shared on Twitter, Foreign Office Spokesperson Dr Mohammad Faisal said: \"We express our condolences to the bereaved families and pray for speedy recovery of the injured.\"",
            "In a subsequent tweet, he added: \"Pakistan condemns terrorism in all its forms and manifestations. We express  solidarity with the people of Afghanistan. Pakistan will continue to support international efforts to restore complete peace and stability in Afghanistan.\"",
            "The US is negotiating for a deal that would see foreign forces pull out of Afghanistan in return for various Taliban security guarantees, including a pledge that the country will not become a safe haven for terror groups. ",
            "Some observers say the insurgents are increasing attacks to gain greater leverage in the talks. ",
            "US peace envoy Zalmay Khalilzad, who is in Kabul this week, is expected to travel to Qatar's capital Doha in coming days for the new round of talks with the Taliban. ",
            "The US has also stepped up its air campaign against the Taliban this year, and all sides claim to have inflicted heavy casualties on each other. ",
            "Still, the US and the Taliban insist they are making progress, and the insurgents and a group of Afghans this month made a vague and unbinding pledge to try to reduce civilian deaths to \"zero\". ",
            "But civilians continue to pay a heavy price in Afghanistan's raging conflict, with last year the deadliest on record for civilians. ",
            "According to a UN tally, at 3,804 civilians died in the war in 2018, including 927 children. ",
            "President Donald Trump has said he wants the US to quit Afghanistan as soon as possible. ",
            "He provoked outrage in Afghanistan this week when he claimed he could easily win the war but didn't \"want to kill 10 million people\" or wipe Afghanistan \"off the face of the Earth\"."
        ]
    },
    {
        "sr_no": 50,
        "newspaper": "Dawn",
        "headline": "Trump vetoes congressional effort to block Saudi, UAE arms sales\n",
        "link": "https://www.dawn.com/news/1496133/trump-vetoes-congressional-effort-to-block-saudi-uae-arms-sales",
        "brief": "",
        "date": "July 25, 2019",
        "detailed_news": [
            "President Donald Trump on Wednesday vetoed a trio of congressional resolutions aimed at blocking his administration from selling billions of dollars of weapons to Saudi Arabia and the United Arab Emirates. ",
            "Secretary of State Mike Pompeo last month cited threats from Iran as a reason to approve the $8.1 billion arms sale to the two US allies in the Persian Gulf. ",
            "Saudi Arabia is an enemy of Iran and tension has mounted between the UAE and Tehran over several issues, including the UAE's coordination with US efforts to curb what it calls Iran's malign activities in the region. ",
            "But Trump's decision in May to sell the weapons in a way that would have bypassed congressional review infuriated lawmakers. In a partisan pushback to Trump's foreign policy, Democrats and Republicans banded together to pass resolutions to block the weapons sale. ",
            "The White House had argued that stopping the sale would send a signal that the United States doesn't stand by its partners and allies, particularly at a time when threats against them are increasing. ",
            "The arms package included thousands of precision-guided munitions, other bombs and ammunition and aircraft maintenance support. ",
            "Anger has been mounting in Congress over the Trump administration's close ties to the Saudis, fuelled by the high civilian casualties in the Saudi-led war in Yemen a military campaign the US is assisting and the killing of US-based columnist Jamal Khashoggi by Saudi agents. ",
            "Trump's decision in May to sell the weapons further inflamed the tensions. ",
            "“The president's shameful veto tramples over the will of the bipartisan, bicameral Congress and perpetuates his administration's involvement in the horrific conflict in Yemen, which is a stain on the conscience of the world,” House Speaker Nancy Pelosi said in a statement. ",
            "It didn't appear that lawmakers opposed to the sale had enough votes to override Trump's veto. ",
            "Sen. Bob Menendez of New Jersey, the top Democrat on the Senate Foreign Relations Committee, led the effort, but he had support from two of Trump's GOP allies in Congress: Sens. Lindsey Graham of South Carolina and Rand Paul of Kentucky. ",
            "Last month, members of the House Foreign Affairs Committee grilled State Department officials about the sale. Chairman Eliot Engel, D-N.Y., said it was a “slap in the face” to Congress and accused the Trump administration of using threats from Iran as a “convenient excuse” to push through the sale. ",
            "In a statement released Wednesday night, Engel said, \"The president's veto sends a grim message that America's foreign policy is no longer rooted in our core values namely a respect for human rights and that he views Congress not as a coequal branch of government, but an irritant to be avoided or ignored.\""
        ]
    },
    {
        "sr_no": 53,
        "newspaper": "Dawn",
        "headline": "Jubilant Imran on first anniversary of 2018 general elections promises ruthless accountability\n",
        "link": "https://www.dawn.com/news/1496131/jubilant-imran-on-first-anniversary-of-2018-general-elections-promises-ruthless-accountability",
        "brief": "",
        "date": "Updated July 25, 2019",
        "detailed_news": [
            " ",
            "KARACHI / WASHINGTON: On the first anniversary of 2018 general elections, Prime Minister Imran Khan has vowed to carry out ruthless accountability of those found involved in loot and plunder.",
            "“We have to transform all institutions which had been destroyed by thieves who only want to loot Pakistan,” he said while speaking to charged party workers who thronged Islamabad International Airport in the wee hours of Thursday morning to welcome him.",
            "The PM, who returned aboard a commercial flight from the US after completing his three-day visit, was given a warm welcome by senior party leaders and workers of the Pakistan Tehreek-i-Insaf amid slogans and applause. ",
            "Take a look: A pictoral diary of Prime Minister Imran Khan's inaugural visit to the United States",
            "In response to scenes of jubilation at the airport, Mr Khan said he felt as if he had come home after winning the World Cup and not from an official visit.",
            " In response to scenes of jubilation at the Islamabad airport, Prime Minister #ImranKhan said he felt as if he had come home after winning the World Cup and not from an official visit. #DawnToday",
            "A post shared by  Dawn Today (@dawn.today) on Jul 24, 2019 at 10:19pm PDT",
            " ",
            "Without naming former rulers, the PM said he had asked the United States and other western countries to help Pakistan in getting back its looted wealth that the ‘thieves and robbers’ had stashed abroad.",
            "Returns to Islamabad where cheering party workers warmly welcome him; PM says Pakistan, US share same objective of Afghan peace",
            "He promised to make Pakistan a great nation. ",
            "Earlier in Washington, the PM told members of the US Congress that Pakistan and the United States shared the same objective of reaching a peaceful solution in Afghanistan.",
            "The need for better coordination between the US and Pakistan for restoring peace to the war-ravaged Afghanistan was also discussed at a meeting on Tuesday between PM Khan and US Secretary of State Michael R. Pompeo.",
            "The prime minister said that Pakistan would continue to work with the US to promote the Afghan peace process, but it would not be easy. Pakistan was trying its best to get the Taliban engaged not just with the US but also with the Afghan government and would continue to do so, said Mr Khan.",
            "“Secretary Pompeo emphasised the continued importance of the United States and Pakistan working together to advance shared priorities, including Pakistan’s significant role in supporting the Afghan peace process and counterterrorism,” said a statement issued by the US State Department after the meeting.",
            "“Secretary Pompeo welcomed the occasion to discuss opportunities for enhanced cooperation including expanded trade and investment opportunities.”",
            "Mr Pompeo looked forward to continued progress from Pakistan on shared security priorities, including defeating terrorist organizations, which he hoped would form the basis of a reinvigorated partnership, the statement added.",
            "This was a follow-up on their Sept 5, 2018 meeting in Islamabad and took place at the Pakistani ambassador’s residence in Washington.",
            "Unlike the formal setting of the ambassador’s residence, the meeting on the Hill outside the House Speaker Nancy Pelosi’s office was informal and friendly. It was organised by the Pakistan caucus, which is co-chaired by Congresswoman Sheila Jackson Lee, a Democrat, and Congressman James Banks, a Republican. The caucus made elaborate arrangements for PM Khan’s first visit to the Hill, with halal food — sushi and vegetable samosas included — arranged neatly on one side, and non-alcoholic drinks on the other.",
            "Ahead of the PM’s address, Speaker Pelosi told the audience how she was introduced to Pakistan as an undergrad, when another student, dressed in a sari, asked her to read books on Mohammad Ali Jinnah. That woman was Naila Ahmed, the daughter of former ambassador Aziz Ahmed. Reading those books taught her the “greatness of statesmanship” and made her realise that the relationship between Pakistan and the US was “important”.",
            "The prime minister said Pakistan was trying its best to get the Taliban engaged not just with the US but also with the Afghan government and would continue to do so. “The whole country is standing behind me, the Pakistan Army, the security forces, all are behind me. We all have one object and it is exactly the same objective as the US, which is to have a peaceful solution as quickly as possible in Afghanistan,” he added.",
            "PM Khan said his meetings with President Donald Trump and Secretary Pompeo were very encouraging and he told them that moving forward the bilateral relationship required mutual trust. “I hope that from now onwards our relationship is on a different level,” he said, noting that unfortunately over the past 40 years, specifically the last 15 years, a lot of misunderstandings had developed.",
            "“So what I hope is that by the time I leave, I would have made people here understand our point of view,” he said, explaining that 70,000 Pakistanis had been killed and billions of dollars were lost when the country was “fighting the US War on Terror”.",
            "“Pakistan had nothing to do with 9/11. Al Qaeda was in Afghanistan. There were no militant Taliban in Pakistan. But we joined the US war,” he said, adding that 40 different militant groups were operating in Pakistan and the governments weren’t in control.",
            "“So, while the US expected us to do more and help [the] US win the war, Pakistan was at that time was fighting for its own existence” and felt that their sacrifices were not appreciated, he said.",
            "“We hope from now onwards our relationship will be completely different and rest assured I will make sure that our relationship is now based on truth … and mutual respect.”",
            "Ms Pelosi assured Mr Khan that the US “values the critical relationship, the partnership between the United States and Pakistan”.",
            "Published in Dawn, July 25th, 2019"
        ]
    },
    {
        "sr_no": 54,
        "newspaper": "Dawn",
        "headline": "Editorial: Trump's problematic comments about the Afghan war\n",
        "link": "https://www.dawn.com/news/1496130/editorial-trumps-problematic-comments-about-the-afghan-war",
        "brief": "",
        "date": "Updated July 25, 2019",
        "detailed_news": [
            "THE American president is not known for his politically correct remarks, be it on pressing domestic issues or delicate matters of foreign affairs. ",
            "In his recent interaction with Prime Minister Imran Khan, Donald Trump spoke about the Afghan issue — a concern that largely shapes the Trump administration’s views vis-à-vis Pakistan. ",
            "However, what Mr Trump said has raised a furore of sorts, with the Afghan government seeking clarification of his comments. ",
            "Perhaps meaning to indicate his lack of appetite for further foreign wars, the US president said while meeting Mr Khan that he could easily win the Afghan conflict but did not “want to kill 10m people”, while adding that the US could wipe Afghanistan “off the face of the earth”. ",
            "Whatever Mr Trump meant to say, his comments have come across as arrogant and insensitive; oddly, the presidential bluster comes as the US peace envoy is headed to Kabul for talks with the Afghan Taliban.",
            "Unfortunately, the US has been unable to extricate itself from Afghanistan for nearly two decades. ",
            "What started off as a mission to punish those supposedly involved in the Sept 11 terror attacks has transformed into an open-ended war; moreover, the Americans have also attempted nation-building in Afghanistan, trying to transplant a Western model of democracy in a tribal society already reeling from instability and war since the 1970s. ",
            "However, these attempts have failed to bear fruit, as the nation remains divided along ethno-linguistic lines, while the Taliban are said to control nearly half of the country. ",
            "The fact is that the US must acknowledge that its ‘shock-and-awe’ tactics in the country, and its attempts to engineer a political and social structure, have utterly failed. ",
            "Instead of making misguided comments about obliterating Afghanistan and killing millions of people, the American president needs to highlight a doable exit strategy. ",
            "Moreover, the American establishment must admit that its cavalier attempts at nation-building in Afghanistan, Iraq, Syria and Libya were wrong and that its efforts have left these nations worse off.",
            "However, Mr Trump was right when he said Pakistan could help the US exit Afghanistan. ",
            "Indeed, this country has played and should continue to play a role in bringing peace to Afghanistan. ",
            "Moreover, instability in the latter has been one of the major factors behind the sociopolitical upheaval in Pakistan, especially in the wake of the Soviet invasion. ",
            "Yet while Pakistan, the US, and all neighbours of Afghanistan have key roles to play where facilitating peace between Kabul and the Taliban is concerned, the process needs to be Afghan-led and Afghan-owned. ",
            "The shuttle diplomacy between Kabul, Doha and other cities is continuing to persuade the Taliban to sign a peace deal. ",
            "But the process is slow and painstaking, which is why foreign players must be careful about the comments they make, and not risk inflaming the situation with loose talk.",
            "Published in Dawn, July 25th, 2019"
        ]
    },
    {
        "sr_no": 62,
        "newspaper": "Tribune",
        "headline": "PM Imran wants Pakistan-US ties ‘based on mutual trust’",
        "link": "https://tribune.com.pk/story/2019717/1-pm-imran-reiterates-desire-iron-differences-neighbours/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "KARACHI: Prime Minister Imran Khan on Tuesday expressed the desire to establish unconditional bilateral relations between Islamabad and Washington based on mutual trust and friendship.",
            "“We would like to have a relationship based on mutual trust, as equals, as friends and not as before when Pakistan wanted aid and in return it was asked to perform certain tasks for the US,” said the prime minister while speaking at the United States Institute of Peace on the last day of his three-day maiden visit to Washington.",
            "“I am happy to leave the US now, as we have relationship based on mutual interest, which is peace in Afghanistan,” he added.",
            "Prime Minister Imran said that he hated the idea of asking for funds not just from the US but from any other country. “Because, aid has been one of the biggest curses for my country… what it has done is, it has created the dependency syndrome,” he remarked.",
            "“When I returned home from Saudi Arabia, everybody asked what have you got from there, as if I went there asking for money… and I think it’s humiliating for a country. Countries rise because of self-respect and self-esteem and no country rise by begging for money.",
            "“I would like to have dignified relationship with the US, where never again should we have this humiliating phase… I can tell you as a Pakistani, never did I feel more humiliated when Osama bin Laden was taken out in Pakistan by the US troops.",
            "“We want to have a relationship of friendship… and doesn’t really matter you know as one friend can be rich and the other can be not that rich, but so what… it’s all about dignified relationship. That’s what I hope to have from here.”",
            "The premier also reiterated the desire to have friendly relations with all immediate neighbours of the country including India.",
            "He said that his Pakistan Tehreek-e-Insaf (PTI) government reached out to all neighbouring countries to iron out differences and rebuild confidence to establish better trade ties after coming into power last year.",
            "Commenting on the Afghan peace process, Prime Minister Imran vowed that he would try to pursue the Taliban to come to the negotiation table after returning from Washington.",
            "He said that a Taliban delegation wanted to meet him a few months back but he did not because of opposition from the Afghan government. “Now I will meet the Taliban and I will try my best to get them to talk to the Afghan government,” he said, adding that he has gained their trust for professing right from the first day that the issue could only be resolved through dialogue.",
            "The US and the Taliban are getting closer to a deal that is expected to be centered on a US pledge to withdraw troops in exchange for a Taliban promise not to let Afghanistan be used as a base for terrorism.",
            "However, the Taliban have refused to negotiate with President Ashraf Ghani’s government, denouncing it as a US puppet, but in an effort to foster Afghan reconciliation, a 60-strong delegation of citizens met the Taliban for two days of talks in Qatar from Sunday.",
            "Afghan government forces mistakenly killed seven civilians, including children, in an attack on militants south of the capital, a provincial official said on Monday, the latest victims of a war undiminished by peace talks.",
            "The prime minister started off the address by narrating his life’s struggle from cricketing days to becoming a social worker and building a cancer hospital and how he formed his political party 23 years ago after realising that the country’s sufferings would not finish just by doing social work.",
            "Prime Minister Imran said Pakistan was the fastest growing country in the region in the 1960s. But, like other colonial countries, corruption held it back after the mid-1980s.",
            "He said his movement for justice party only started to take shape about seven years back following massive public rallies throughout the country before the 2013 general elections.",
            "He said massive fiscal deficit and corruption remained the two biggest challenges for his government after coming into power in the last year’s polls. He blamed the last two governments of Pakistan Peoples Party and Pakistan Muslim League-Nawaz for the country’s crippling economy.",
            "“Money which should have been used for public welfare, laundered to foreign countries by the corrupt rulers. In order to take the money out, these political elite destroyed state institutions,” he maintained.",
            "“I felt that I was fighting with a mafia, which has been termed as ‘Sicilian mafia’ by the Supreme Court as well.”",
            "The prime minister gave credit to his election victory to the country’s youth, saying that over 60 per cent of the country’s population consisted of youth, who became his biggest support. “Without social media we wouldn’t have beaten these political mafia parties,” he added.",
            "Commenting on the rising inflation and rupee’s down-slope against dollar, Prime Minister Imran said his political opponents spread ‘fake news’ about the country’s economy and that the IMF wanted rupee at a certain value. “We nearly ran out of dollars. Now things are stabilising because of our hard work,” he maintained.",
            "“We are also fixing taxation system. Without expanding tax net, no country can progress. It’s imperative that every Pakistani pays taxes.”",
            "Blaming former rulers – Nawaz Sharif and Asif Zardari – for increasing the country’s external debt in the last 10 years, he said Pakistan’s total debt in 60 years was Rs6 trillion after Pervez Musharraf’s government, which was increased it to Rs30 trillion in the last 10 years. “They burdened the country with Rs24 trillion through looting and plundering,” he added.",
            "With additional input from Reuters",
            " "
        ]
    },
    {
        "sr_no": 69,
        "newspaper": "Tribune",
        "headline": "\nPM Imran pulls off a PR coup in US\n",
        "link": "https://tribune.com.pk/story/2019827/1-pm-imran-pulls-off-pr-coup-us/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "ISLAMABAD: When Prime Minister Imran Khan was preparing for his maiden visit to the US after assuming office, he was unsure of what to expect given US President Donald Trump’s unpredictable nature and his diatribe against Pakistan in the past.",
            "The prime minister was advised to tread carefully as the world would be watching and any misstep could undermine the summit.",
            "Speaking at the US Institute for Peace, Imran confirmed that he was “inundated with suggestions from all quarters” about what to discuss with the US President.",
            "Even Railways Minister Sheikh Rashid, who is known for his quips, before the prime minister’s visit remarked: “Both Imran and Trump are same. God help us, I am scared.”",
            "His statement was meant to suggest that given the unpredictability of both the leaders, anything could happen.",
            "PM Imran wants Pakistan-US ties ‘based on mutual trust’",
            "Amid this backdrop, when the prime minister finally stepped inside the White House and was greeted by President Trump, the other members of the Pakistani delegation were anxious. Even Imran visibly looked more cautious.",
            "Inside the Oval Office, the two leaders sat down for a photo op and brief remarks.",
            "Trump began by saying that he was honoured to welcome to the White House one of the greatest athletes of all times and now a popular leader.",
            "The media interaction was supposed to be brief but with Trump in the driving seat, almost nothing goes as per plan. The interaction lasted over 40 minutes where Trump unexpectedly and perhaps unintentionally handed Imran and Pakistan a major PR victory.",
            "In meetings such as the one between the leaders of two estranged allies, optics always matter. What Trump said on Kashmir was not only surprising for Pakistan but also rattled India and its jingoistic media given that it had always boasted a personal bond between Prime Minister Narendra Modi and Trump. They were expecting Trump to speak Modi’s language with Imran.",
            "But contrary to India’s expectations, Trump not only praised Pakistan’s efforts for facilitating the Afghan peace talks but also offered to mediate on the Kashmir dispute.",
            "‘Trump’s a liar’ — Indian fury over US president’s Kashmir mediation offer",
            "What came as a shock to everyone was Trump’s revelation that Modi himself had recently requested him to mediate between Pakistan and India over the Kashmir issue.",
            "His statement stirred uproar in India, which was quick to reject Trump’s claim that Modi had requested mediation. The controversy echoed in the Indian parliament where the opposition sought a personal clarification from Modi despite the Indian external affairs ministry’s denial.",
            "Before the visit, everyone was expecting the issue of Afghanistan to dominate the discussions. It certainly did, but only a few had expected that Kashmir and Pakistan-India relationship would steal the limelight.",
            "It is undoubtedly a PR victory for Pakistan because India, under the Modi regime, has been working to isolate Pakistan globally for quite some time. The Indian media proudly claims that the Trump administration favours New Delhi over Islamabad.",
            "Michael Kugelman, a senior associate working on South Asia at the Washington-based Wilson Center, summed up Imran-Trump meeting in his following tweet: “At any rate, my main takeaway is that Trump’s comments here, for the most part, are exactly what Pakistan wanted to hear. An unintended PR win for Islamabad.”",
            "Imran and his team members, who went to the White House with lot of skepticism on the back of their minds, returned with an outcome that Pakistan would be pretty glad with.",
            "Imran himself had acknowledged that he and his delegation were ‘blown away’ by President Trump’s hospitality and straight talk.",
            "Nevertheless, ultimately what determines the future of Pak-US relations or Trump-Imran bonhomie is how far Islamabad will be able to deliver on two key US demands that include persuading Afghan Taliban for a permanent ceasefire and convince them for an intra-Afghan dialogue.",
            "In a tweet, Prime Minister Imran while thanking Trump for his “warm and gracious hospitality”, assured him that Pakistan would do “everything within its power to facilitate the Afghan peace process”."
        ]
    },
    {
        "sr_no": 73,
        "newspaper": "Daily Excelsior",
        "headline": "MS Dhoni to serve in Kashmir, will perform patrolling and guard duty",
        "link": "https://www.dailyexcelsior.com/ms-dhoni-to-serve-in-kashmir-will-perform-patrolling-and-guard-duty/",
        "brief": "<p>Former Team India captain MS Dhoni will be with his Territorial Army unit of the Parachute Regiment (106 Para TA battalion) in Kashmir from July 31 to August 15. The 38-year-old will undertake duties of patrolling, guard and post duty and will be staying with the troops. Notably, Dhoni holds the honorary rank of Lieutenant [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com/ms-dhoni-to-serve-in-kashmir-will-perform-patrolling-and-guard-duty/\">MS Dhoni to serve in Kashmir, will perform patrolling and guard duty</a> appeared first on <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com\">Jammu Kashmir Latest News | Tourism | Breaking News J&amp;K</a>.</p>\n",
        "date": "Thu, 25 Jul 2019 06:11:42 +0000",
        "detailed_news": ""
    },
    {
        "sr_no": 82,
        "newspaper": "State Times",
        "headline": "Lot of resources been shifted from other arms of PLA to its navy: Indian Navy chief",
        "link": "http://news.statetimes.in/lot-of-resources-been-shifted-from-other-arms-of-pla-to-its-navy-indian-navy-chief/",
        "brief": "New Delhi: A day after the Chinese Defence Ministry released a white paper on its military development, Navy chief Admiral Karambir Singh on Thursday said a lot of resources have been shifted to the PLA Navy from other arms of the People&#8217;s Liberation Army and India will have to watch it carefully. The white paper [&#8230;]",
        "date": "Thu, 25 Jul 2019 08:43:26 +0000",
        "detailed_news": ""
    },
    {
        "sr_no": 84,
        "newspaper": "State Times",
        "headline": "North Korea fires short-range missiles in latest provocation",
        "link": "http://news.statetimes.in/north-korea-fires-short-range-missiles-in-latest-provocation/",
        "brief": "Seoul: North Korea fired two short-range missiles into the sea on Thursday, complicating efforts to resume stalled nuclear talks with Washington and signalling its anger over planned US-South Korea joint military exercises. It was Pyongyang&#8217;s first missile test since an impromptu meeting between US President Donald Trump and North Korean leader Kim Jong Un last [&#8230;]",
        "date": "Thu, 25 Jul 2019 08:42:57 +0000",
        "detailed_news": ""
    },
    {
        "sr_no": 100,
        "newspaper": "The News",
        "headline": "Gathering Taliban for parleys not easy: Imran",
        "link": "https://www.thenews.com.pk/print/503107-gathering-taliban-for-parleys-not-easy-imran",
        "brief": "\n\n\t\t\t\t\n    \n\nWASHINGTON: Prime Minister Imran Khan has assured members of the US Congress that Pakistan will continue to play its role to help achieve the shared objective of a political solution in Afghanistan.He said Pakistan was trying its level best to bring Taliban to the negotiating table and a significant achievement has been made in this regard. He, however, said it was not an easy task. He said the entire country including the army and security forces are on the same page for the common objective of peaceful solution to the Afghan conflict.At a reception hosted by the Congressional Pakistan Caucus on Tuesday, the prime minister maintained that peace in the region was vitally important for the promotion of Pakistan&rsquo;s development agenda. He said that Pakistan had extended its full support to facilitate direct talks between the US and Taliban, which had made progress. He said Pakistan was in defensive position in this war so how could the demand to &lsquo;do more&rsquo; have been made to it. He added that the past governments did not express ground realities to the US.Hours before concluding his historical trip to the United States, Imran Khan visited the Capitol Hill, and addressed a number of Congress members including Sen Gary Peters, Sen Sherrod Brown and Sen Chris Van Hollen and several members of the House Foreign Affairs Committee. He was introduced to members of the Caucus including Republican Co-Chair Rep Jim Banks (R-IN) and Democratic Co-Chair Rep Thomas Suozzi (D-NY).The prime minister also met with the Speaker of the US House of Representatives, Nancy Pelosi and House Minority Leader Kevin McCarthy also joined the event.Speaking at the reception, Imran Khan thanked the attendees for the warm welcome and said that his government was committed to rebuilding the relationship on the basis of mutual trust and mutual respect.The prime minister said that Pakistan had facilitated the Afghan peace and reconciliation process as peace and stability in Afghanistan was vital for Pakistan. While cautioning about the complicated nature of the process and possible challenges, he said that Pakistan will continue to extend all possible facilitation in the process.Extending a warm welcome, Speaker Pelosi said it was a pleasure to welcome Prime Minister of Pakistan to the US Capitol and to discuss the vital ties between &ldquo;our economies, people & nations.&rdquo;  During the meeting, views were exchanged on matters relating to the Pakistan-US relations and regional developments.The prime minister told the Speaker that through his visit to the United States, he intended to enhance better understanding and renew and reinvigorate long-standing ties between the two countries. He said that Pakistan would continue to work with the United States for building an enduring partnership and promoting regional stability.The prime minister also shared his vision of peace, progress and prosperity in South Asia. He stressed that this could be achieved through peaceful resolution of outstanding disputes and building stable and cooperative relationships.The members of Congress also appreciated Pakistan&rsquo;s invaluable contribution in the Afghan peace and reconciliation process. They appreciated the role of the Pakistani American community in the US. They presented the prime minister copy of the special resolution, which had been introduced in the Congress to welcome the prime minister&rsquo;s inaugural visit to the US and to reaffirm the continuing support and commitment to the long and enduring friendship between Pakistan and the US.Congresswoman Jackson Lee thanked the Prime Minister for visiting the Congress and expressed the hope that relations between the two countries could be deepened by enhancing exchanges between the parliamentary representatives of both sides. They were of the view that Prime Minister Khan&rsquo;s visit to the Capitol will help generate greater interest and foster better understanding of Pakistan in the US Congress.Agencies add: Prime Minister Imran Khan has said after his visit and interaction with the US leadership, the people of America will have a better understanding about Pakistan. Speaking to the US Congressmen at the Capitol Hill, he said Pakistan had always close ties with the United States and expressed the hope to get back to the relationship, which was based on truth and trust as well as mutual respect.Imran Khan expressed the hope that from now onward, relationship between the two countries would be at different level. He said unfortunately, he felt that Pakistan was not understood there, specifically in the last 15 years when the war on terror was being fought in Afghanistan and on the border of Pakistan.More than 70,000 Pakistani people died and our economy suffered billions of dollars loss in the war against terror. The prime minister said over 40 terrorist groups came to Pakistan because of the US war that it fought and its own existence was endangered by it. He said Pakistan was fighting the US war on terror while Pakistan had nothing to do with the 9/11. Al Qaida was in Afghanistan and there were no militant Taliban in Pakistan. He said it was very important that he met President Donald Trump and Secretary of State Mike Pompeo and explained to them the way forward that the relationship has to be based on mutual trust.Prime Minister Imran Khan said he would meet with the Taliban after returning to his country, as part of efforts to end the 18 years of war in Afghanistan.He said he had also spoken with Afghan President Ashraf Ghani and now, when he goes back, \"I will meet the Taliban and I will try my best to get them to talk to the Afghan government.\"Speaking at the US Institute for Peace, a bipartisan federal body, Khan said he had been contacted by the Islamist extremist Afghan Taliban \"a few months back\", after his election win in July 2018, but did not take a meeting at that time because Kabul was not in favor of it. The militants reached out to him \"because I always maintained there was no military solution\" to the war in Afghanistan, he said.\"So because of that, I had a certain amount of credibility amongst them,\" added Khan. Khan earlier Tuesday met with US Secretary of State Mike Pompeo, who emphasised the importance of working together and \"Pakistan&rsquo;s significant role in supporting the Afghan peace process and counterterrorism,\" according to a US statement.\"It&rsquo;s not going to be easy because there&rsquo;s no centralised command, it&rsquo;s a devolved movement,\" Khan cautioned about the insurgent group. \"But we feel that if we all work together, we feel this is the best chance of there to be peace in Afghanistan.\"Khan also stressed that Afghanistan&rsquo;s presidential election in September \"must be an inclusive election where the Taliban also participate\". A breakthrough could pave the way for a withdrawal of international troops about 18 years after the 9/11 attacks on the United States, which led the US to launch an offensive that dislodged the Taliban government from Kabul. \"Today, there is no concept in Pakistan of &lsquo;strategic depth&rsquo; because we feel that by interfering in Afghanistan... we have actually done a lot of damage to our own country,\" he said.At the reception, Foreign Minister Shah Mahmood Qureshi, while addressing the ceremony, said the role of Congress is vital to further fortify the ties between Pakistan and the United States. The prime minister left for home Tuesday evening after the three-day visit to Washington.Congressmen presented Imran Khan a copy of the special resolution, which had been introduced in the Congress to welcome the prime minister&rsquo;s inaugural visit to the US and to reaffirm the continuing support and commitment to the long and enduring friendship between Pakistan and the US.\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 106,
        "newspaper": "The News",
        "headline": "COAS meets Pompeo, US military leadership",
        "link": "https://www.thenews.com.pk/print/503113-coas-meets-pompeo-us-military-leadership",
        "brief": "\n\n\t\t\t\t\n    \n\nWASHINGTON/RAWALPINDI: Chief of the Army Staff (COAS) General Qamar Bajwa visited the US State Department and met with Secretary of State Mike Pompeo, said Director General Inter-Services Public Relations (ISPR) Major General Asif Ghafoor.According to the army&rsquo;s spokesperson, during the meeting the two leaders discussed regional security issues and Afghan peace process. In the meeting, the importance of an Afghan-led process and Afghan-controlled solution were noted, according to the ISPR.In another tweet, the DG ISPR quoted the COAS as saying Pakistan attaches great importance to restoring a robust bilateral relationship based on mutual respect, trust and shared values. During his series of meetings, the COAS also met with Senator Lindsey Graham and General (retd) Jack Keane to talk about the security situation. Senator Graham recalled his visit to Pakistan, appreciating the country&rsquo;s role in improving the security dynamics, stated the DG ISPR.The army chief briefed about the improved security situation in the country resulting in opportunities for foreign businesses to invest in Pakistan. Bilateral relationship holds potential for both countries and would also assist in regional stability, said the army chief.Meanwhile, Chief of the Army Staff (COAS) General Qamar Javed Bajwa visited Pentagon, according to the official web page of Inter-Services Public Relations (ISPR) on Wednesday.On arrival, the COAS was received by Chairman Joint Chief of Staff General Joseph F Dunford. The COAS was presented a guard of honour with 21 gun salute. The COAS had a discussion session with Acting Secretary of Defence Richard V Spencer and CJCS.Regional security situation including the Afghan peace process was discussed. The secretary and CJCS acknowledged contributions of Pakistan Army in the war against terrorism and the role towards Afghan peace process.The COAS also met Chief of Staff US Army General Mark A Milley.Matters related to security and bilateral military cooperation were discussed.Later, the COAS visited the Arlington National Cemetery to pay homage to US national heroes. A special ceremony was held at the cemetery playing national anthem of both countries.&nbsp;\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 112,
        "newspaper": "The News",
        "headline": "Pak intelligence agencies didn’t know OBL was in Pakistan: ex-CIA chief",
        "link": "https://www.thenews.com.pk/print/503119-pak-intelligence-agencies-didn-t-know-obl-was-in-pakistan-ex-cia-chief",
        "brief": "\n\n\t\t\t\tISLAMABAD: Former CIA Director General David Petraeus has said that he is \"convinced\" that the Pakistani intelligence agencies did not know Osama bin Laden (OBL) was in Pakistan, countering Prime Minister Imran Khan's claims that the ISI provided a lead to the CIA that helped the US track down and kill the terror group al-Qaeda&rsquo;s chief in 2011.Imran Khan's statement on Osama bin Laden during an interview with Fox News on Monday was significant as Pakistan had so far denied that it had any information about the hideout of the al-Qaeda chief before he was killed in a covert raid by US Navy SEAL commandos in the garrison city of Abbottabad.According to media report, David Petraeus, during an interactive session at the Indian Consulate in New York City on Tuesday, asserted the US is convinced that the Pakistani intelligence was not aware that the terrorist leader was hiding in their country.\"We are quite convinced that the ISI, Pakistani intelligence, no one else knew that OBL was there in Pakistan. They were not harbouring him or hiding him or anything like that. We have very good insights on that. We probably differ with those who said that the Pakistanis were allowing him to live in that particular compound in Abbottabad,\" he said.David Petraeus said during counter-insurgency campaigns, Pakistani authorities could never close in on North Waziristan where terror outfits such as the Haqqani network, al-Qaeda and others had their headquarters.He said that the US learnt later on that OBL was not in that area but near the Pakistan Military Academy in Abbottabad.\"I figured out later that I had probably flown right over his compound in a helicopter as I went to address the cadets at the military academy one time,\" he said, referring to the Pakistan Military Academy. David Petraeus said he hopes Imran Khan will be able to deal with the challenges of his country, where the economy is &ldquo;very distorted&rdquo; and where the \"realities of the situation are really quite difficult.\"\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 120,
        "newspaper": "The News",
        "headline": "President Alvi rejects leakage of judge’s reference contents",
        "link": "https://www.thenews.com.pk/print/503127-president-alvi-rejects-leakage-of-judge-s-reference-contents",
        "brief": "\n\n\t\t\t\tISLAMABAD: President Dr Arif Alvi on Wednesday strongly rebuffed that the contents of a reference against a judge of the Supreme Court were leaked from the Aiwan-e-Sadr as he had held thorough investigation into it.In an interview with a private TV channel he explained that he had received the reference against Justice Qazi Faez Isa, judge of the Supreme Court, moved by the Ministry of Law and Justice.To a question in that regard the President further elaborated that after receiving the reference, he had three options over its disposal. First to sit over it like those who used such things for blackmailing (threats), second for holding a media trial, and the third one to proceed in accordance with relevant laws.He said that he preferred the legal one by sending the presidential reference to the Supreme Judicial Council (SJC) under the specific laws and expressed the confidence that SJC would decide it in accordance with the law.To another question, the President credited Prime Minister Imran Khan for effectively representing Pakistan&rsquo;s stance on various issues including a peaceful resolution to the Afghan issue during his visit to the United States. He said during the prime minister&rsquo;s visit, comprehensive talks were held on the peaceful resolution of the Afghan issue. Pakistan had assured the US about making all out efforts to bring Taliban to hold dialogue for the peaceful solution of the issue, he said adding, the US wanted a peaceful exit from Afghanistan and afterward, Pakistan could assist in the rehabilitation and restructuring efforts.The president to a question said the prime minister had already reminded the world and the US particularly that war was no solution to the issues as it was easy to flare up the conflicts without any end in the sight. President Trump thought out of the box which was his quality, he added.Parting ways with the transactional ties, the prime minister rightly projected that Pakistan wanted to live among the comity of nations with dignity and self respect which also correlated with PTI&rsquo;s motive of transforming the country into modern, Islamic and welfare state.President Alvi said that he had regular interaction with the opposition parties. In response to a question, he said media had a greater role than any other organ in the country to bring about social change by highlighting the social issues. The media should show the people the difference between the good and bad. It should further enhance its role and play its effective part in the national building, he added.The president informed that he had asked Pemra to provide him ranking of those TV channels concentrating on the social issues, so that they could be awarded.To another question, he said the process for the plea bargain as envisaged under the National Accountability law must be more open and should not be reached behind the closed doors. To make his point, the president cited a decision of the Supreme Court in which it opted for an offer over land encroachment case with Malik Riaz, the property tycoon.The president also advocated women&rsquo;s inheritance rights by saying that relevant laws were not being implemented. Recommendations in that regard had been forwarded to the Islamic Ideology Council, he said, adding religious elements, media and the prayers leaders should also play their respective roles in that regard.About International Court of Justice&rsquo;s decision on convicted Indian spy Kulbhushan Jadhav, the president said that the Attorney General for Pakistan and people in the Law Ministry had the opinion that consular access should have been provided to him. The ICJ held the same which was expected.The president said being an ordinary man, he wanted promotion of new technology in Pakistan and would like to work for provision of health facilities and ensuring women&rsquo;s hereditary rights, besides making efforts aimed at catering to the needs of the special people.He opined that MQM had changed itself and only the time would prove it how much the party had reformed itself. He stressed upon televising of special programmes at the PTV for those people who were suffering from hearing impairment.The president to a query said that he and his spouse had learnt many things from Imran Khan and his wife, including their passion for the welfare work.\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 127,
        "newspaper": "The News",
        "headline": "Rouhani suggests deal possible over seized oil tanker",
        "link": "https://www.thenews.com.pk/print/503187-rouhani-suggests-deal-possible-over-seized-oil-tanker",
        "brief": "\n\n\t\t\t\tTEHRAN: Iran&rsquo;s president has signalled a deal could be possible regarding the British-flagged tanker seized in the Strait of Hormuz.President Hassan Rouhani suggested on Wednesday that the Stena Impero vessel could be released if the UK takes similar steps to hand back an Iranian oil tanker seized by the Royal Navy off Gibraltar earlier this month.The remarks could help reduce tensions between the two countries as Boris Johnson takes over as Prime Minister. &ldquo;We do not seek the continuation of tension with some European countries,&rdquo; Rouhani said in comments carried on his website.&ldquo;Should they be committed to international frameworks and give up their wrong actions, including what they did in Gibraltar, they will receive a proportional response from Iran.&rdquo; Rouhani described the Iranian seizure of the UK-flagged Stena Impero as &ldquo;professional and brave&rdquo;.The comments came after the tanker&rsquo;s owners said the crew are safe following communications with them in Iran. The vessel was taken by Iran&rsquo;s Revolutionary Guard on Friday amid worsening relations between Tehran and the West.Stena Bulk confirmed it has had direct contact with the crew of the impounded vessel.The ship&rsquo;s master said they were all safe and there had been good cooperation with the Iranian personnel on board. Stena Bulk said the crew&rsquo;s family members were being kept updated on the latest developments and being offered the firm&rsquo;s full support. Erik Hanell, president and CEO of Stena Bulk, said: &ldquo;We do of course appreciate this step of development and that this is a first sign that we will soon see more positive progress from the Iranian authorities.&rdquo;The development came as the head of the Iranian supreme leader&rsquo;s office said the UK was sending a mediator to negotiate for the release of the vessel.&ldquo;A country that at one time appointed ministers and lawyers in Iran has reached a point where they send a mediator and plead for their ship to be freed,&rdquo; Mohammad Mohammadi-Golpayegani said, according to the semi-official Tasnim news site.UK sources insisted they were not aware of any mediator being sent to Iran, insisting that diplomatic contacts were through the ambassador and embassy in Tehran. .\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 134,
        "newspaper": "The News",
        "headline": "Bringing Taliban to negotiating table won’t be easy: Imran",
        "link": "https://www.thenews.com.pk/print/503193-bringing-taliban-to-negotiating-table-won-t-be-easy-imran",
        "brief": "\n\n\t\t\t\tBy News DeskWASHINGTON: Prime Minister Imran Khan has said Pakistan is now trying to bring the Afghan Taliban to the negotiating table and, despite the current progress, he cautioned US members of Congress that &ldquo;it is not going to be very easy&rdquo;.Speaking at Capitol Hill where a reception was held in his honour on Tuesday, the Prime Minister said the situation in Afghanistan is &ldquo;very complicated&rdquo;, but he assured the US leadership that the Pakistan government would be trying its best as the whole country is standing behind him, the Pakistan Army, and security forces all are behind him.&ldquo;We all have the same objective, and it is exactly the same objective the US had, and which is a peaceful solution of the Afghan issue as quickly as possible,&rdquo; he said. &ldquo;We were fighting the US war of terror as Pakistan had nothing to do with the 9/11. Al-Qaeda was in Afghanistan and there were no militant Taliban in Pakistan. &ldquo;We join the US war, but unfortunately when things went wrong and when I blame my government as we did not tell the US exactly the truth on the ground, part of the reason was our government was not in control. There were 40 different militant groups operating within Pakistan,&rdquo; he said.&ldquo;So Pakistan went through this scare, so why the US expected us to &lsquo;do more&rsquo; and help the US in this war,&rdquo; he said and added that Pakistan was at that time fighting for its own existence.The Prime Minister said it was very important that he met US President Donald Trump and Secretary of State Mike Pompeo, and explained to them the way forward that the relationship had to be based on mutual trust. &ldquo;Trust me, I will be telling the truth, I will be telling the US what we can do in this peace process.&ldquo;Pakistan had always close ties with the United States and expressed the hope to get back to the relationship, which was based on truth and trust as well as mutual respect.&rdquo;\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 136,
        "newspaper": "The News",
        "headline": "Gathering Taliban for parleys not easy: Imran",
        "link": "https://www.thenews.com.pk/print/503313-gathering-taliban-for-parleys-not-easy-imran",
        "brief": "\n\n\t\t\t\tWASHINGTON: Prime Minister Imran Khan has assured members of the US Congress that Pakistan will continue to play its role to help achieve the shared objective of a political solution in Afghanistan.He said Pakistan was trying its level best to bring Taliban to the negotiating table and a significant achievement has been made in this regard. He, however; said it was not an easy task. He said the entire country including army and security forces are on same page for a common objective of peaceful solution to the Afghan conflict. At a reception hosted by the Congressional Pakistan Caucus on Tuesday, the prime minister maintained that peace in the region was vitally important for the promotion of Pakistan&rsquo;s development agenda.He said that Pakistan had extended its full support to facilitate direct talks between the US and Taliban, which had made progress. He said Pakistan was in defensive position in this war so how could the demand to &lsquo;do more&rsquo; have been made to it. He added that the past governments did not express ground realities to the US.Hours before concluding his historical trip to the United States, Imran Khan visited the Capitol Hill, and addressed a number of Congress members including Sen Gary Peters, Sen Sherrod Brown and Sen Chris Van Hollen and several members of the House Foreign Affairs Committee. He was introduced to members of the Caucus including Republican Co-Chair Rep Jim Banks (R-IN) and Democratic Co-Chair Rep Thomas Suozzi (D-NY).The prime minister also met with the Speaker of the US House of Representatives, Nancy Pelosi and House Minority Leader Kevin McCarthy also joined the event. Speaking at the reception, Imran Khan thanked the attendees for the warm welcome and said that his government was committed to rebuild the relationship on the basis of mutual trust and mutual respect.The Prime Minister said that Pakistan had facilitated the Afghan peace and reconciliation process as peace and stability in Afghanistan was vital for Pakistan. While cautioning about the complicated nature of the process and possible challenges, he said that Pakistan will continue to extend all possible facilitation in the process.Extending a warm welcome, Speaker Pelosi said it was a pleasure to welcome Prime Minister of Pakistan to the US Capitol and to discuss the vital ties between &ldquo;our economies, people & nations.&rdquo;  During the meeting, views were exchanged on matters relating to Pakistan-US relations and regional developments.The Prime Minister told the Speaker that, through his visit to the United States, he intended to enhance better understanding and renew and reinvigorate long-standing ties between the two countries. He said that Pakistan would continue to work with the United States for building an enduring partnership and promoting regional stability.The Prime Minister also shared his vision of peace, progress and prosperity in South Asia. He stressed that this could be achieved through peaceful resolution of outstanding disputes and building stable and cooperative relationships.The members of Congress also appreciated Pakistan&rsquo;s invaluable contribution in the Afghan peace and reconciliation process. They appreciated the role of the Pakistani American community in the US. They presented the Prime Minister copy of the special resolution, which had been introduced in the Congress to welcome the Prime Minister&rsquo;s inaugural visit to the U.S. and to reaffirm the continuing support and commitment to the long and enduring friendship between Pakistan and the U.S.Congresswoman Jackson Lee thanked the Prime Minister for visiting the Congress and expressed hope that relations between the two countries could be deepened by enhancing exchanges between the parliamentary representatives of both sides. They were of the view that Prime Minister Khan&rsquo;s visit to the Capitol will help generate greater interest and foster better understanding of Pakistan in the US Congress.Agencies add: Prime Minister Imran Khan has said after his visit and interaction with the US leadership, the people of America will have better understanding about Pakistan. Speaking to the US Congressmen at the Capitol Hill, he said Pakistan had always close ties with the United States and expressed the hope to get back to the relationship, which was based on truth and trust as well as mutual respect.Imran Khan expressed the hope that from now onward relationship between the two countries would be at different level. He said unfortunately, he felt that Pakistan was not understood there, specifically in the last 15 years when the war on terror was being fought in Afghanistan and on the border of Pakistan.More than 70,000 Pakistani people died and our economy suffered billions of dollars loss in the war against terror. The Prime Minister said over 40 terrorist groups came to Pakistan because of the US war that it fought and its own existence was endangered by it. he said Pakistan was fighting the US war on terror while Pakistan had nothing to do with the 9/11. Al Qaida was in Afghanistan and there were no militant Taliban in Pakistan. He said it was very important that he met President Donald Trump and Secretary of State Mike Pompeo and explained to them the way forward that the relationship has to be based on mutual trust.Prime Minister Imran Khan said he would meet with the Taliban after returning to his country, as part of efforts to end 18 years of war in Afghanistan.He said he had also spoken with Afghan President Ashraf Ghani, and now, when he goes back, \"I will meet the Taliban and I will try my best to get them to talk to the Afghan government.\"Speaking at the US Institute for Peace, a bipartisan federal body, Khan said he had been contacted by the Islamist extremist Afghan Taliban \"a few months back\", after his election win in July 2018, but did not take a meeting at that time because Kabul was not in favor of it.The militants reached out to him \"because I always maintained there was no military solution\" to the war in Afghanistan, he said.\"So because of that, I had a certain amount of credibility amongst them,\" added Khan. Khan earlier Tuesday met with US Secretary of State Mike Pompeo, who emphasised the importance of working together and \"Pakistan&acute;s significant role in supporting the Afghan peace process and counterterrorism,\" according to a US statement.\"It&acute;s not going to be easy because there&acute;s no centralised command, it&acute;s a devolved movement,\" Khan cautioned about the insurgent group. \"But we feel that if we all work together, we feel this is the best chance of there to be peace in Afghanistan.\"Khan also stressed that Afghanistan&acute;s presidential election in September \"must be an inclusive election where the Taliban also participate\". A breakthrough could pave the way for a withdrawal of international troops about 18 years after the 9/11 attacks on the United States, which led the US to launch an offensive that dislodged the Taliban government from Kabul.\"Today, there is no concept in Pakistan of &acute;strategic depth&acute; because we feel that by interfering in Afghanistan... we have actually done a lot of damage to our own country,\" he said.At the reception, Foreign Minister Shah Mahmood Qureshi, while addressing the ceremony, said the role of congress is vital to further fortify the ties between Pakistan and the United States.The Prime Minister left for home Tuesday evening after the three-day visit to Washington.Congressmen presented Imran Khan a copy of the special resolution, which had been introduced in the Congress to welcome the prime minister&rsquo;s inaugural visit to the US and to reaffirm the continuing support and commitment to the long and enduring friendship between Pakistan and the US.\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 139,
        "newspaper": "The News",
        "headline": "COAS meets Pompeo, US military leadership",
        "link": "https://www.thenews.com.pk/print/503316-coas-meets-pompeo-us-military-leadership",
        "brief": "\n\n\t\t\t\tWASHINGTON/RAWALPINDI: Chief of Army Staff (COAS) General Qamar Bajwa visited the US State Department and met with Secretary of State Mike Pompeo, said Director General Inter Services Public Relations (ISPR) Major General Asif Ghafoor.According to the army&rsquo;s spokesperson during the meeting the two leaders discussed regional security issues and Afghan peace process. In the meeting the importance of an Afghan-led process and Afghan-controlled solution were noted, according to the ISPR.In another tweet the DG ISPR quoted the COAS as saying Pakistan attaches great importance to restoring a robust bilateral relationship based on mutual respect trust and shared values. During his series of meetings the COAS also met with Senator Lindsay Graham and General (R) Jack Keane to talk about the security situation. Senator Graham recalled his visit to Pakistan appreciating the country&rsquo;s role in improving the security dynamics, stated the DG ISPR.The army chief briefed about the improved security situation in the country resulting in opportunities for foreign businesses to invest in Pakistan. Bilateral relationship holds potential for both countries and would also assist in regional stability, said the army chief.Meanwhile Chief of Army Staff (COAS) General Qamar Javed Bajwa visited Pentagon, according to the official web page of Inter Services Public Relations (ISPR) on Wednesday.On arrival, COAS was received by Chairman Joint Chief of Staff General Joseph F Dunford. COAS was presented guard of honour with 21 gun salute. COAS had discussion session with Acting Secretary of Defence Richard V Spencer and CJCS.Regional security situation including Afghan peace process was discussed. Secretary and CJCS acknowledged contributions of Pakistan Army in war against terrorism and role towards Afghan peace process.COAS also met Chief of Staff US Army General Mark A Milley. Matters related to security and bilateral military cooperation were discussed.Later, COAS visited Arlington National Cemetery to pay homage to US National heroes. A special ceremony was held at cemetery playing national anthem of both countries.\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 148,
        "newspaper": "The News",
        "headline": "President Alvi rejects leakage of judge’s reference contents",
        "link": "https://www.thenews.com.pk/print/503325-president-alvi-rejects-leakage-of-judge-s-reference-contents",
        "brief": "\n\n\t\t\t\tISLAMABAD: President Dr Arif Alvi on Wednesday strongly rebuffed that the contents of a reference against a judge of the Supreme Court were leaked from the Aiwan-e-Sadr as he had held thorough investigation into it.In an interview with a private TV channel he explained that he had received the reference against Justice Qazi Faez Isa, judge of the Supreme Court, moved by the Ministry of Law and Justice.To a question in that regard the President further elaborated that after receiving the reference, he had three options over its disposal. First to sit over it like those who used such things for blackmailing (threats), second for holding a media trial, and the third one to proceed in accordance with relevant laws. He said that he preferred the legal one by sending the presidential reference to the Supreme Judicial Council (SJC) under the specific laws and expressed the confidence that SJC would decide it in accordance with the law. To another question, the President credited Prime Minister Imran Khan for effectively representing Pakistan&rsquo;s stance on various issues including a peaceful resolution to the Afghan issue during his visit to the United States. He said during the prime minister&rsquo;s visit, comprehensive talks were held on the peaceful resolution of the Afghan issue. Pakistan had assured the US about making all out efforts to bring Taliban to hold dialogue for the peaceful solution of the issue, he said adding, the US wanted a peaceful exit from Afghanistan and afterward, Pakistan could assist in the rehabilitation and restructuring efforts. The president to a question said the prime minister had already reminded the world and the US particularly that war was no solution to the issues as it was easy to flare up the conflicts without any end in the sight. President Trump thought out of the box which was his quality, he added.Parting ways with the transactional ties, the prime minister rightly projected that Pakistan wanted to live among the comity of nations with dignity and self respect which also correlated with PTI&rsquo;s motive of transforming the country into modern, Islamic and welfare state. President Alvi said that he had regular interaction with the opposition parties. In response to a question, he said media had a greater role than any other organ in the country to bring about social change by highlighting the social issues. The media should show the people the difference between the good and bad. It should further enhance its role and play its effective part in the national building, he added. The president informed that he had asked Pemra to provide him ranking of those TV channels concentrating on the social issues, so that they could be awarded.To another question, he said the process for the plea bargain as envisaged under the National Accountability law must be more open and should not be reached behind the closed doors. To make his point, the president cited a decision of the Supreme Court in which it opted for an offer over land encroachment case with Malik Riaz, the property tycoon. The president also advocated women&rsquo;s inheritance rights by saying that relevant laws were not being implemented. Recommendations in that regard had been forwarded to the Islamic Ideology Council, he said, adding religious elements, media and the prayers leaders should also play their respective roles in that regard. About International Court of Justice&rsquo;s decision on convicted Indian spy Kulbhushan Jadhav, the president said that the Attorney General for Pakistan and people in the Law Ministry had the opinion that consular access should have been provided to him. The ICJ held the same which was expected.The president said being an ordinary man, he wanted promotion of new technology in Pakistan and would like to work for provision of health facilities and ensuring women&rsquo;s hereditary rights, besides making efforts aimed at catering to the needs of the special people.He opined that MQM had changed itself and only the time would prove it how much the party had reformed itself. He stressed upon televising of special programmes at the PTV for those people who were suffering from hearing impairment.The president to a query said that he and his spouse had learnt many things from Imran Khan and his wife, including their passion for the welfare work.\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 153,
        "newspaper": "The News",
        "headline": "Intelligence agencies didn’t know OBL was in Pakistan: ex-CIA chief",
        "link": "https://www.thenews.com.pk/print/503330-intelligence-agencies-didn-t-know-obl-was-in-pakistan-ex-cia-chief",
        "brief": "\n\n\t\t\t\tISLAMABAD: Former CIA Director General David Petraeus has said that he is \"convinced\" that the Pakistani intelligence agencies did not know Osama bin Laden (OBL) was in Pakistan, countering Prime Minister Imran Khan's claims that the ISI provided a lead to the CIA that helped the US track downContinued on page 4and kill the terror group al-Qaeda&rsquo;s chief in 2011. Imran Khan's statement on Osama bin Laden during an interview with Fox News on Monday was significant as Pakistan had so far denied that it had any information about the hideout of the al-Qaeda chief before he was killed in a covert raid by US Navy SEAL commandos in the garrison city of Abbottabad.According to media report, David Petraeus, during an interactive session at the Indian Consulate in New York City on Tuesday following his address on Indo-Pacific, asserted the US is convinced that the Pakistani intelligence was not aware that the terrorist leader was hiding in their country.\"We are quite convinced that the ISI, Pakistani intelligence, no one else knew that OBL was there in Pakistan. They were not harbouring him or hiding him or anything like that. We have very good insights on that. We probably differ with those who said that the Pakistanis were allowing him to live in that particular compound in Abbottabad,\" he said. David Petraeus said that during counter-insurgency campaigns, Pakistani authorities could never close in on North Waziristan where terror outfits such as the Haqqani network, al-Qaeda and others had their headquarters and some of their forces. He said that the US learnt later on that OBL was not in that area but near the Pakistan Military Academy (PMA) in Abbottabad. \"I figured out later that I had probably flown right over his compound in a helicopter as I went to address the cadets at the military academy one time,\" he said, referring to the PMA. David Petraeus said he hopes Imran Khan will be able to deal with the challenges of his country, where the economy is &ldquo;very distorted&rdquo; and where the \"realities of the situation are really quite difficult.\"\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 158,
        "newspaper": "The News",
        "headline": "Gathering Taliban for parleys not easy: Imran",
        "link": "https://www.thenews.com.pk/print/503388-gathering-taliban-for-parleys-not-easy-imran",
        "brief": "\n\n\t\t\t\tWASHINGTON: Prime Minister Imran Khan has assured members of the US Congress that Pakistan will continue to play its role to help achieve the shared objective of a political solution in Afghanistan.He said Pakistan was trying its level best to bring Taliban to the negotiating table and a significant achievement has been made in this regard. He, however; said it was not an easy task. He said the entire country including army and security forces are on same page for a common objective of peaceful solution to the Afghan conflict.At a reception hosted by the Congressional Pakistan Caucus on Tuesday, the prime minister maintained that peace in the region was vitally important for the promotion of Pakistan&rsquo;s development agenda. He said that Pakistan had extended its full support to facilitate direct talks between the US and Taliban, which had made progress. He said Pakistan was in defensive position in this war so how could the demand to &lsquo;do more&rsquo; have been made to it. He added that the past governments did not express ground realities to the US.Hours before concluding his historical trip to the United States, Imran Khan visited the Capitol Hill, and addressed a number of Congress members including Sen Gary Peters, Sen Sherrod Brown and Sen Chris Van Hollen and several members of the House Foreign Affairs Committee. He was introduced to members of the Caucus including Republican Co-Chair Rep Jim Banks (R-IN) and Democratic Co-Chair Rep Thomas Suozzi (D-NY).The prime minister also met with the Speaker of the US House of Representatives, Nancy Pelosi and House Minority Leader Kevin McCarthy also joined the event.Speaking at the reception, Imran Khan thanked the attendees for the warm welcome and said that his government was committed to rebuild the relationship on the basis of mutual trust and mutual respect.The Prime Minister said that Pakistan had facilitated the Afghan peace and reconciliation process as peace and stability in Afghanistan was vital for Pakistan. While cautioning about the complicated nature of the process and possible challenges, he said that Pakistan will continue to extend all possible facilitation in the process.Extending a warm welcome, Speaker Pelosi said it was a pleasure to welcome Prime Minister of Pakistan to the US Capitol and to discuss the vital ties between &ldquo;our economies, people & nations.&rdquo; During the meeting, views were exchanged on matters relating to Pakistan-US relations and regional developments.The Prime Minister told the Speaker that, through his visit to the United States, he intended to enhance better understanding and renew and reinvigorate long-standing ties between the two countries. He said that Pakistan would continue to work with the United States for building an enduring partnership and promoting regional stability.The Prime Minister also shared his vision of peace, progress and prosperity in South Asia. He stressed that this could be achieved through peaceful resolution of outstanding disputes and building stable and cooperative relationships.The members of Congress also appreciated Pakistan&rsquo;s invaluable contribution in the Afghan peace and reconciliation process. They appreciated the role of the Pakistani American community in the US. They presented the Prime Minister copy of the special resolution, which had been introduced in the Congress to welcome the Prime Minister&rsquo;s inaugural visit to the U.S. and to reaffirm the continuing support and commitment to the long and enduring friendship between Pakistan and the U.S.Congresswoman Jackson Lee thanked the Prime Minister for visiting the Congress and expressed hope that relations between the two countries could be deepened by enhancing exchanges between the parliamentary representatives of both sides. They were of the view that Prime Minister Khan&rsquo;s visit to the Capitol will help generate greater interest and foster better understanding of Pakistan in the US Congress.Agencies add: Prime Minister Imran Khan has said after his visit and interaction with the US leadership, the people of America will have better understanding about Pakistan. Speaking to the US Congressmen at the Capitol Hill, he said Pakistan had always close ties with the United States and expressed the hope to get back to the relationship, which was based on truth and trust as well as mutual respect.Imran Khan expressed the hope that from now onward relationship between the two countries would be at different level. He said unfortunately, he felt that Pakistan was not understood there, specifically in the last 15 years when the war on terror was being fought in Afghanistan and on the border of Pakistan.More than 70,000 Pakistani people died and our economy suffered billions of dollars loss in the war against terror. The Prime Minister said over 40 terrorist groups came to Pakistan because of the US war that it fought and its own existence was endangered by it. he said Pakistan was fighting the US war on terror while Pakistan had nothing to do with the 9/11. Al Qaida was in Afghanistan and there were no militant Taliban in Pakistan. He said it was very important that he met President Donald Trump and Secretary of State Mike Pompeo and explained to them the way forward that the relationship has to be based on mutual trust.Prime Minister Imran Khan said he would meet with the Taliban after returning to his country, as part of efforts to end 18 years of war in Afghanistan.He said he had also spoken with Afghan President Ashraf Ghani, and now, when he goes back, &ldquo;I will meet the Taliban and I will try my best to get them to talk to the Afghan government.&rdquo;Speaking at the US Institute for Peace, a bipartisan federal body, Khan said he had been contacted by the Islamist extremist Afghan Taliban &ldquo;a few months back&rdquo;, after his election win in July 2018, but did not take a meeting at that time because Kabul was not in favor of it.The militants reached out to him &ldquo;because I always maintained there was no military solution&rdquo; to the war in Afghanistan, he said.&ldquo;So because of that, I had a certain amount of credibility amongst them,&rdquo; added Khan. Khan earlier Tuesday met with US Secretary of State Mike Pompeo, who emphasised the importance of working together and &ldquo;Pakistan&rsquo;s significant role in supporting the Afghan peace process and counterterrorism,&rdquo; according to a US statement.&ldquo;It&rsquo;s not going to be easy because there&rsquo;s no centralised command, it&rsquo;s a devolved movement,&rdquo; Khan cautioned about the insurgent group. &ldquo;But we feel that if we all work together, we feel this is the best chance of there to be peace in Afghanistan.&rdquo;Khan also stressed that Afghanistan&rsquo;s presidential election in September &ldquo;must be an inclusive election where the Taliban also participate&rdquo;. A breakthrough could pave the way for a withdrawal of international troops about 18 years after the 9/11 attacks on the United States, which led the US to launch an offensive that dislodged the Taliban government from Kabul.&ldquo;Today, there is no concept in Pakistan of &lsquo;strategic depth&rsquo; because we feel that by interfering in Afghanistan... we have actually done a lot of damage to our own country,&rdquo; he said.At the reception, Foreign Minister Shah Mahmood Qureshi, while addressing the ceremony, said the role of congress is vital to further fortify the ties between Pakistan and the United States.The Prime Minister left for home Tuesday evening after the three-day visit to Washington. Congressmen presented Imran Khan a copy of the special resolution, which had been introduced in the Congress to welcome the prime minister&rsquo;s inaugural visit to the US and to reaffirm the continuing support and commitment to the long and enduring friendship between Pakistan and the US.\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 161,
        "newspaper": "The News",
        "headline": "COAS meets Pompeo, US military leadership",
        "link": "https://www.thenews.com.pk/print/503391-coas-meets-pompeo-us-military-leadership",
        "brief": "\n\n\t\t\t\tWASHINGTON/RAWALPINDI: Chief of Army Staff (COAS) General Qamar Bajwa visited the US State Department and met with Secretary of State Mike Pompeo, said Director General Inter Services Public Relations (ISPR) Major General Asif Ghafoor.According to the army&rsquo;s spokesperson during the meeting the two leaders discussed regional security issues and Afghan peace process. In the meeting the importance of an Afghan-led process and Afghan-controlled solution were noted, according to the ISPR.In another tweet the DG ISPR quoted the COAS as saying Pakistan attaches great importance to restoring a robust bilateral relationship based on mutual respect trust and shared values. During his series of meetings the COAS also met with Senator Lindsay Graham and General (R) Jack Keane to talk about the security situation. Senator Graham recalled his visit to Pakistan appreciating the country&rsquo;s role in improving the security dynamics, stated the DG ISPR.The army chief briefed about the improved security situation in the country resulting in opportunities for foreign businesses to invest in Pakistan. Bilateral relationship holds potential for both countries and would also assist in regional stability, said the army chief.Meanwhile Chief of Army Staff (COAS) General Qamar Javed Bajwa visited Pentagon, according to the official web page of Inter Services Public Relations (ISPR) on Wednesday.On arrival, COAS was received by Chairman Joint Chief of Staff General Joseph F Dunford. COAS was presented guard of honour with 21 gun salute. COAS had discussion session with Acting Secretary of Defence Richard V Spencer and CJCS.Regional security situation including Afghan peace process was discussed. Secretary and CJCS acknowledged contributions of Pakistan Army in war against terrorism and role towards Afghan peace process.COAS also met Chief of Staff US Army General Mark A Milley. Matters related to security and bilateral military cooperation were discussed. Later, COAS visited Arlington National Cemetery to pay homage to US National heroes. A special ceremony was held at cemetery playing national anthem of both countries.\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 168,
        "newspaper": "The News",
        "headline": "President Alvi rejects leakage of judge’s reference contents",
        "link": "https://www.thenews.com.pk/print/503398-president-alvi-rejects-leakage-of-judge-s-reference-contents",
        "brief": "\n\n\t\t\t\tISLAMABAD: President Dr Arif Alvi on Wednesday strongly rebuffed that the contents of a reference against a judge of the Supreme Court were leaked from the Aiwan-e-Sadr as he had held thorough investigation into it.In an interview with a private TV channel he explained that he had received the reference against Justice Qazi Faez Isa, judge of the Supreme Court, moved by the Ministry of Law and Justice.To a question in that regard the President further elaborated that after receiving the reference, he had three options over its disposal. First to sit over it like those who used such things for blackmailing (threats), second for holding a media trial, and the third one to proceed in accordance with relevant laws. He said that he preferred the legal one by sending the presidential reference to the Supreme Judicial Council (SJC) under the specific laws and expressed the confidence that SJC would decide it in accordance with the law.To another question, the President credited Prime Minister Imran Khan for effectively representing Pakistan&rsquo;s stance on various issues including a peaceful resolution to the Afghan issue during his visit to the United States. He said during the prime minister&rsquo;s visit, comprehensive talks were held on the peaceful resolution of the Afghan issue. Pakistan had assured the US about making all out efforts to  bring Taliban to hold dialogue for the peaceful solution of the issue, he said adding, the US wanted a peaceful exit from Afghanistan and afterward, Pakistan could assist in the rehabilitation and restructuring efforts.The president to a question said the prime minister had already reminded the world and the US particularly that war was no solution to the issues as it was easy to flare up the conflicts without any end in the sight. President Trump thought out of the box which was his quality, he added.Parting ways with the transactional ties, the prime minister rightly projected that Pakistan wanted to live among the comity of nations with dignity and self respect which also correlated with PTI&rsquo;s motive of transforming the country into modern, Islamic and welfare state. during his visit to the United States. In a series of tweets, she said the prime minister during his US visit, strongly highlighted the importance of resolution of outstanding dispute.She said Shahbaz Sharif should have also learnt from the simplicity and austerity of Imran Khan instead of criticising him for riding on the buses.Dr Awan claimed the popularity of the prime minister was increasing amongst the masses despite Shahbaz Sharif&rsquo;s efforts to misguide the people out of enviousness. &ldquo;Shahbaz Sahab! You do gimmickry by walking on London roads and when return to Pakistan, you fall back on the habit of protocol,&rdquo; she contended.Meanwhile, Dr Firdous Ashiq Awan on Wednesday said that provision of rights to the people, who were entitled to them, was mission of Prime Minister Imran Khan.\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 176,
        "newspaper": "The News",
        "headline": "Intelligence agencies didn’t know OBL was in Pakistan: ex-CIA chief",
        "link": "https://www.thenews.com.pk/print/503406-intelligence-agencies-didn-t-know-obl-was-in-pakistan-ex-cia-chief",
        "brief": "\n\n\t\t\t\tISLAMABAD: Former CIA Director General David Petraeus has said that he is \"convinced\" that the Pakistani intelligence agencies did not know Osama bin Laden (OBL) was in Pakistan, countering Prime Minister Imran Khan's claims that the ISI provided a lead to the CIA that helped the US track down and kill the terror group al-Qaeda&rsquo;s chief in 2011.Imran Khan's statement on Osama bin Laden during an interview with Fox News on Monday was significant as Pakistan had so far denied that it had any information about the hideout of the al-Qaeda chief before he was killed in a covert raid by US Navy SEAL commandos in the garrison city of Abbottabad.According to media report, David Petraeus, during an interactive session at the Indian Consulate in New York City on Tuesday following his address on Indo-Pacific, asserted the US is convinced that the Pakistani intelligence was not aware that the terrorist leader was hiding in their country.&ldquo;We are quite convinced that the ISI, Pakistani intelligence, no one else knew that OBL was there in Pakistan. They were not harbouring him or hiding him or anything like that. We have very good insights on that. We probably differ with those who said that the Pakistanis were allowing him to live in that particular compound in Abbottabad,&rdquo; he said. David Petraeus said that during counter-insurgency campaigns, Pakistani authorities could never close in on North Waziristan where terror outfits such as the Haqqani network, al-Qaeda and others had their headquarters and some of their forces.He said that the US learnt later on that OBL was not in that area but near the Pakistan Military Academy (PMA) in Abbottabad. &ldquo;I figured out later that I had probably flown right over his compound in a helicopter as I went to address the cadets at the military academy one time,&rdquo; he said, referring to the PMA. David Petraeus said he hopes Imran Khan will be able to deal with the challenges of his country, where the economy is &ldquo;very distorted&rdquo; and where the &ldquo;realities of the situation are really quite difficult.&rdquo;\n\t\t\t",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    }
]