[
    {
        "sr_no": 11,
        "newspaper": "kashmir Times",
        "headline": "Onus, now, on separatists: Rajnath",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92827",
        "brief": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.\r\nHis assertion came with a reminder that he had al...",
        "date": "7/21/2019 12:48:14 PM",
        "detailed_news": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.His assertion came with a reminder that he had already made exhaustive efforts to bring them to dialogue table as the Home Minister of the country, (in first tenure of Modi-government). Now it’s for them (separatists) to act to make things move - whatever way, he plainly told when queried about stand-off on the need of political initiative in Kashmir after effectively containing militancy in the Valley, as claimed by the government. The Defence Minister was speaking to media persons after inaugurating the 1000-meter long Ujh bridge along the International Border (IB) in Kathua district. “What stand-off..? There’s no stand-off. Jitni Pehl Iss Desh Key Griha-Mantri Ko Karni Chahiye Thi Utni Pehl To Maine Pehle Kardi… Ab Uskay Baad Woh Faisla Karengay Key Kya Karna Hai.. (The efforts and initiatives, expected from the Home Minister of this country, have already been exhausted by me in my tenure as the Union Home Minister… Now it is for them to take a call as what they want to do…),” he said.  Responding to another query related to “Operation All–Out” in the Valley to weed-out terrorism, Rajnath said that day was not far off to achieve that mark. “There are no two opinions about it that the Kashmir will get rid of terrorism very soon. Rest assured….it’s going to happen very soon. More so, I believe- as in case of any act of terror occurring anywhere in the world, the way the international community is rallying around on one platform, joining hands to take on this threat, it (terrorism) will be wiped out of - not only Kashmir, Jammu ...but the entire world,” he said.What was that challenge which was main obstacle in resolving Kashmir, in the Defence Minister’s opinion as he had earlier served as the Union Home Minister also? Faced with this query, Rajnath said, “There’s no need to analyse that challenge here. Whatever be the challenge, it will be tackled. We very well know all the reasons, we’ll sort them out and J&K will be rid of terrorism, for sure.”   In response to queries related to recurrent ceasefire violations by Pakistan on IB and LoC, even on the day of his visit to J&K today and the probability of another Kargil-like misadventure by the neighbouring nation (Pak), his terse reply was, “This message is for all the countrymen- Have faith in our country’s leadership - the Prime Minister Narendra Modi and the valiant jawans and officers of our armed forces. They will not let down your faith in them.”Earlier he said, “I’ve just returned from Kargil. Accompanied by the Army Chief General Bipin Rawat and Union Minister of State in PMO Dr Jitendra Singh, I saw those majestic peaks, which were freed from the clutches of Pakistan by our valiant soldiers by laying down their lives yet not before incurring a crushing defeat to the enemy and failing its evil designs. I’ve just witnessed the testimonies to their (gallant soldiers’) valour and heroic deeds which earned India a proud victory.”Rajnath stated that the Ujh bridge, which as per Director General-Border Road Organisation’s assertion, was the longest bridge constructed by the organization anywhere in the country, would ease problems of border residents related to connectivity. “In the form of bridge, the long pending demand of border residents has been realized. The strenuous efforts of Border Road Organisation (BRO) to complete this bridge in stipulated period despite lot of problems and hostile conditions are, undoubtedly, laudable,” the Defence Minister said."
    },
    {
        "sr_no": 16,
        "newspaper": "kashmir Times",
        "headline": "Army pays tribute to brave-heart",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92766",
        "brief": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. \r\nToday, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid hom...",
        "date": "7/19/2019 10:28:45 AM",
        "detailed_news": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. Today, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid homage to the martyr on behalf of a proud nation.Singh was 35 years old and had joined the Army in 2002. He belonged to Village Tibba of Dhuri Tehsil in Sangrur District of Punjab and is survived by wife, a son and a daughter."
    },
    {
        "sr_no": 19,
        "newspaper": "kashmir Times",
        "headline": "Village girl turned IAF fighter pilot inspiring J&K youngsters",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92763",
        "brief": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. \r\nIn a series of motivational lectures, Thakur told s...",
        "date": "7/19/2019 10:28:04 AM",
        "detailed_news": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. In a series of motivational lectures, Thakur told students on Thursday that the decision to come to Bhadarwah to take part in the \"Sangam Youth Festival\" organised by the army changed her life forever as she decided to join the armed forces. Hailing from Billan Bowlian in Udhampur district, Thakur joined the IAF as a fighter pilot this year, one of the first few women in the country to have done so. Her motivational lectures, organised by the Rashtriya Rifles unit based at Bhadarwah, are inspiring youngsters, especially girls, in the state to make a mark in life. “I decided that I had to go for it, whatever it took. I would want every young boy and girl wanting to become a fighter pilot to dream big,” Thakur told. In her message to the students of Kendriya Vidyalaya and PG College Bhadarwah, she said, “Your dreams may seem unconquerable at the moment. But you must chase those so hard that they become reality.” Stating that a \"combination of average qualities\" in her made her unique, Thakur said, “I climbed the ladder step by step, committing some mistakes as well, but kept going as I learned it the hard way. Instead of mourning over your failures and get into self pity, you should work harder to achieve your goals.” She said being an NCC cadet helped her keep her nerves in the most difficult situations. The lectures were followed by question-answer sessions with the students. Aarushi, a Class 12 science student of Kendriya Vidyalaya, said she always thought becoming a doctor was the only option for her but Thakur''s words changed that. “I already feel like flying as joining the army is my childhood dream. I will definitely strive harder to make my dream a reality,” she said. Komal Katal (27) of Garh Bhadarwah village said, “I always wanted to join the Army but in this part of the state, I never got an opportunity to try my luck. Although I could not appear in AFCAT (Air Force Common Admission Test) because of the age bar, after attending the lecture of Jubiksha, I will work harder and give it a try to join the Territorial Army.” Besides Thakur, Commanding Officer, 4 Rashtriya Rifles Colonel D D Pandey also shared his experiences with the students. “You should be passionate about your dreams and to reach your destination, you should not hesitate and think longer to take your first step. Just start your journey today and you will definitely reach your destination,” he said."
    },
    {
        "sr_no": 35,
        "newspaper": "Greater Times",
        "headline": "BSF commanders asked to spend 25 nights a month at posts along border",
        "link": "https://www.greaterkashmir.com/news/national-2/bsf-commanders-asked-to-spend-25-nights-a-month-at-posts-along-border/?utm_source=rss&utm_medium=rss&utm_campaign=bsf-commanders-asked-to-spend-25-nights-a-month-at-posts-along-border",
        "brief": "The BSF has directed its battalion commanders to spend at least 25 nights in a month at a forward post along the India-Pakistan International Border (IB) in Jammu as part of its renewed efforts to fortify the &#8216;anti-infiltration&#8217; grid in this region, official sources said Tuesday. The commandants and their second-in-command officers have been asked<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/national-2/bsf-commanders-asked-to-spend-25-nights-a-month-at-posts-along-border/\">Read More</a>",
        "date": "Tue, 23 Jul 2019 20:26:10 +0000",
        "detailed_news": ""
    },
    {
        "sr_no": 45,
        "newspaper": "Hindustan Times",
        "headline": "\nMurdered rifleman Aurangzeb’s brothers join army, vow to avenge his death\n",
        "link": "http://www.hindustantimes.com/india-news/murdered-rifleman-aurangzeb-s-brothers-join-army-vow-to-avenge-his-death/story-mN6UEKzcEcXGowb84m6EVI.html",
        "brief": "",
        "date": "Jul 23, 2019 14:53 IST",
        "detailed_news": [
            "Two brothers of an Indian Army soldier, who was abducted and killed by militants last year, have joined the armed forces to “serve the nation and avenge his death”.",
            "Mohammed Tariq, 23, and Mohammed Shabbir, 21, attended an enrolment parade of 100 new recruits in the Territorial Army in Rajouri on Monday, according to a defence spokesperson.",
            "“They were enrolled into a territorial battalion on Monday and now they will undergo training at Punjab Regimental Centre,” the spokesperson said.",
            "They posed with their parents Mohammed Hanif and Raaj Begum after donning the olive green. Hanif is also a former army man. ",
            "Aurangzeb was abducted in Pulwama and later killed by armed terrorists on June 14, 2018, when he was on his way back home in Poonch to celebrate Eid with his family. He was a rifleman in the army’s 44 Rashtriya Rifles. ",
            "“Our brother gave his life for the nation and we will also follow his footsteps. We will not step back when it comes to sacrificing our lives for the nation. We will make him proud and will make Punjab regiment proud by our duty,” said Tariq.",
            "Their father Hanif, a former Jammu and Kashmir Light Infantry soldier, said he may not live to see the “day but his two sons will take revenge of their brother Aurangzeb’s killing.”",
            "“Tariq and Shabbir also want to serve the nation and protect their fellow citizens. Yes, I have lost my son Aurangzeb and death lurks a soldier but then not many have the guts to sacrifice their life for the nation,” he said while speaking to HT over the phone.",
            "“Aurangzeb was trapped and then killed by the cowards. We still miss him,” Hanif said.",
            "Hanif joined the Bharatiya Janata Party (BJP) earlier this year in the presence of Prime Minister Narendra Modi at a public rally in Vijaypur area of Samba district.",
            "Also read | Militant involved in armyman’s murder among 4 killed in Valley",
            "\n\n"
        ]
    },
    {
        "sr_no": 72,
        "newspaper": "Tribune",
        "headline": "\nCOAS meets top US military commanders during Pentagon visit\n",
        "link": "https://tribune.com.pk/story/2020115/1-coas-meets-top-us-military-commanders-pentagon-visit/",
        "brief": "",
        "date": "July 24, 2019",
        "detailed_news": [
            "ISLAMABAD                      : Chief of the Army Staff General Qamar Javed Bajwa visited the Pentagon and met Chairman Joint Chief of Staff (CJCS) General Joseph F Dunford during the three-day visit by Pakistani leadership to the United States, said a statement issued by the Inter-Services Public Relations ISPR).",
            "The COAS also met with Acting Secretary of Defence Richard Spencer and the Chief of Staff of the US Army General Mark A Milley.",
            "General Milley is President Donald Trump’s pick to replace General Dunford as the US military chief.",
            "On the occasion, the army chief was presented a guard of honour with a 21 gun salute.",
            "During the high-level moot, the army chief and the acting defence secretary discussed the regional security situation including the Afghan end game.",
            "Both, the secretary and the CJCS, acknowledged Pakistan Army’s contributions in the war against terrorism.",
            "The huddle also elaborated on matters related to security and bilateral military cooperation.",
            "During the visit, General Bajwa visited Arlington National Cemetery to pay tribute to the national heroes of the US. The national anthem of both countries was played as a special ceremony was held at the cemetery.",
            "The army chief’s meetings hold greater significance in the backdrop of General Milley’s recent assertion that the US needs to maintain strong military ties with Islamabad due to the shared interests of the two countries.",
            "General Bajwa is visiting Washington DC alongside Prime Minister Imran Khan on his maiden visit to the US on the invitation of President Trump.",
            "The premier is accompanied by the Adviser to PM on Commerce Abdul Razzak Dawood and Special Assistant on Overseas Zulfi Bukhari. Foreign Minister Shah Mehmood Qureshi was already present in Washington as part of the entourage prior to the premier’s arrival on July 21.",
            " "
        ]
    },
    {
        "sr_no": 74,
        "newspaper": "Tribune",
        "headline": "\nPM Imran concludes US trip\n",
        "link": "https://tribune.com.pk/story/2020133/1-pm-imran-concludes-us-trip/",
        "brief": "",
        "date": "July 24, 2019",
        "detailed_news": [
            "Prime Minister Imran Khan concluded his three-day visit to Washington and departed for Pakistan.",
            "During his visit, the premier held talks with US President Donald Trump, interacted with Congressional leaders and addressed a think tank.",
            "The Afghan peace process remained at the top of the agenda during his meetings with members of the Trump administration.",
            "Imran has assured US that Pakistan will do everything within its power to facilitate the Afghan peace process.",
            "In a tweet, he said the world owes it to the long-suffering Afghan people to bring about peace after four decades of conflict.",
            "The premier thanked the US President Donald Trump for his warm and gracious hospitality and his understanding of Pakistan’s point of view.",
            "Imran appreciated the US President for taking out time to show Pakistani delegation the historic White House private quarters.",
            "The prime minister also spoke to Pakistani-Americans at Capital Arena that turned out to be one of the biggest ever gatherings addressed by a Pakistani leader.",
            "The premier was accompanied by Adviser to PM on Commerce, Abdul Razzak Dawood, Special Assistant on Overseas, Zulfi Bukhari, and Chief of the Army Staff, General Qamar Javed Bajwa, while Foreign Minister Shah Mehmood Qureshi."
        ]
    },
    {
        "sr_no": 80,
        "newspaper": "Tribune",
        "headline": "Imran Khan suffers from Nawaz phobia, says Shehbaz Sharif",
        "link": "https://tribune.com.pk/story/2019828/1-imran-khan-suffers-nawaz-phobia-says-shehbaz-sharif/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "LAHORE: Pakistan Muslim League-Nawaz (PML-N) President Shehbaz Sharif has taken a swipe at Prime Minister Imran Khan for making “petty and personal attacks” on incarcerated former premier Nawaz Sharif in his speeches in the United States.",
            "“Imran Khan suffers from Nawaz phobia. He does not have the capacity to think about issues beyond NS (Nawaz Sharif),” Shehbaz wrote on his official Twitter handle on Tuesday.",
            "While calling the prime minister “Niazi Sahib”, leader of the opposition in the National Assembly said: “Optics more than substance defined Niazi sahib’s’ tour to the US and his propensity for ‘U-turns’ was on full display in Washington.”",
            "Imran Khan suffers from Nawaz phobia. He does not have the capacity to think about issues beyond NS. Optics more than substance defined Niazi sahib's tour to the US. His propensity for 'U-turns' was on full display in Washington.",
            "— Shehbaz Sharif (@CMShehbaz) July 23, 2019",
            "In a separate statement issued on Tuesday, PML-N president said, “Imran wasted an important opportunity of sending a message of unity in his speeches in America. He should have talked about Pakistan and challenges that lie ahead but he chose to make petty and personal attacks on Nawaz.”",
            "He said Imran Niaz’s vision of bankruptcy was now clear. “His pettiness is clear from his statements that he wants to take away TV and air-conditioner from Nawaz.”",
            "He said Imran had proven he was the most unfit person to hold the Prime Minister Office.",
            "“Imran Niazi is focusing more on gimmicks like riding on buses and less on substantive issues that matter to the people of Pakistan. Imran Niazi has once again taken U-turns on his own statements,” said Shehbaz. “The PM talked about bringing Aafia Siddiqui home, but he did not want journalists to ask him questions.”",
            "He said Imran had not mentioned resolution of Kashmir issue on the basis of UN resolutions. “Has Imran changed Pakistan’s policy on Kashmir? In America Imran exposed his dictatorial thinking by saying media needs to be controlled. He is lying by saying the media is free under his government while the media is suffering from the worst kind of censorship,” he added.",
            "Shehbaz demanded of the PM to explain to the nation how he had offered to “do more” for America.",
            "“When Nawaz Sharif talked about better relations with India, Imran called him ‘Modi’s yaar’, but now he is following the vision of Nawaz,” he added.",
            "Nawaz’s vision was better relations with all neighbours. “Imran Niazi is now following Nawaz’s vision,” he added. “He has achieved nothing in his visit to America except proving he is unfit to be the prime minister of this country. He has proved he is a selected prime minister.”",
            "In separate statement, PML-N Information Secretary Marriyum Aurangzeb said, “The imposed dictatorial regime of the selected prime minister cannot succeed by denying freedom of expression and locking down the entire opposition and every voice of criticism.”",
            "Marriyum said if such tactics could guaranteed success of an imposed regime, dictatorships from 1958 till 2019 would have never ended. “If the country could have been run by choking freedom of the press and subjecting opposition to worst political victimisation, Musharraf would have been a lifetime ruler of Pakistan,” she added.",
            "The former information minister urged Imran not to malign the concept of a democratic republic through his fascist mindset.",
            "These tactics, she said, could not solve the crisis of survival faced by the people of Pakistan who were struggling to feed their families courtesy to the PTI’s economic policy disasters.",
            "“You cannot silence the misery of 220 million people living in Pakistan because of your failures even if you continue putting opponents behind bars and shutting down the media,” said Marriyum. “The nation is in a state of despair with soaring inflation, rising unemployment, crippling unfair taxes and lies of the selected prime minister and his army of rented spokespersons.”"
        ]
    }
]