[
    {
        "sr_no": 4,
        "newspaper": "kashmir Times",
        "headline": "Army jawan killed as Pak targets Indian posts, villages in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93161",
        "brief": "SUNDERBANI, Jul 30: An army jawan was killed as Pakistani troops violated the ceasefire for the third consecutive day and resorted to firing and shelling along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Tuesday.\r\n“The Pakistan army resorted t...",
        "date": "7/31/2019 11:08:18 PM",
        "detailed_news": "SUNDERBANI, Jul 30: An army jawan was killed as Pakistani troops violated the ceasefire for the third consecutive day and resorted to firing and shelling along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Tuesday.“The Pakistan army resorted to unprovoked ceasefire violation along the LoC in Sunderbani sector of Rajouri district today,” PRO Defence Lt Col Devender Anand said.He said the Indian army responded strongly and effectively. “Heavy damage to Pakistan army posts and casualties to Pakistani soldiers were inflicted by our troops. However in the exchange of fire, Naik Krishan Lal (34) was martyred,” Lt Col Anand said.LT Col Anand described Lal as a “brave, highly motivated and sincere” soldier. “The nation will always remain indebted to him for his supreme sacrifice and devotion to duty. Naik Krishan Lal hailed from Akhnoor 's Gagriyal village. He is survived by his wife Shashi Devi,” he said.This is the third such violation in as many days. On Monday, Pakistani troops had resorted to unprovoked firing and shelling along the LoC in Mankote and Shahpur sectors of Poonch district.A 10-day-old baby was killed and two persons injured in heavy shelling by Pakistan along the LoC in Shahpur sector of Poonch district on Sunday.In the meanwhile, army sources said that two Pakistani soldiers were gunned down in retaliatory action by the Indian army when the neighbouring country violated ceasefire in Tangdhar-Keran sector. However two civilians were injured in Jabdi, Tangdhar in cross LoC firing."
    },
    {
        "sr_no": 7,
        "newspaper": "kashmir Times",
        "headline": "Pak shells villages, border posts in Poonch on 2nd day",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93118",
        "brief": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.\r\nIndian side also r...",
        "date": "7/30/2019 3:53:20 PM",
        "detailed_news": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.Indian side also retaliated in equal measure. Two sides traded heavy fire till late afternoon.In the meanwhile, around 15-day infant, who had sustained critical splinter injuries in his abdomen along with his mother and another civilian in Pak shelling in Shahpur sector Sunday evening, succumbed to his injuries in Poonch District Hospital this morning. This afternoon, Deputy Commissioner Rahul Yadav also presented cash relief to persons injured in recent cross border firing.Army sources said, “Pakistani army violated ceasefire in Shahpur sector of Poonch this afternoon. Indian army retaliated with equal calibre and exchange of fire continued till 3.50 PM.”PRO Defence Devender Anand said, “At about 1245 hours, Pakistan initiated unprovoked ceasefire violation starting with firing of small arms followed by shelling with mortars along LoC in Shahpur sector (J&K). Indian army retaliated befittingly.”The army spokesperson said information on casualties on the Pakistani side in the retaliatory action was not immediately available.In the meanwhile, around 15-day old infant, who had sustained critical abdominal splinter injuries during heavy shelling by Pakistani troops along the Line of Control (LoC) in Shahpur sector of Poonch district Sunday evening, died at Poonch District hospital on Monday, a police official said.The infant, his mother Fatima Jan (35) and another civilian Mohammad Arif (40) were injured when mortar shells fired by Pakistan hit their village in Shahpur sector late Sunday evening. They were rushed to district hospital Poonch, where the minor succumbed to injuries this morning, he added.He said Jan and Arif were referred to the Government Medical College Hospital, Jammu, for specialised treatment where their condition was stated to be stable. The baby, however, was kept under observation in Poonch district hospital, where he breathed his last.Later this afternoon, Deputy Commissioner Rahul Yadav  presented cash relief to persons injured in recent cross border firing. He met the injured undergoing treatment at the District Hospital and inquired about their condition directed the doctors to provide them best possible treatment. The Deputy Commissioner provided a relief assistance of Rs 10,000 each to the injured out of Red Cross fund.Mortars and small arms were used from across the border to target forward posts and villages in Shahpur, Sawjian and Mendhar sectors between 5 PM and 10 PM on Sunday. Several houses were also damaged in the firing, the official said.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was injured in another incident of cross-border firing by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 9,
        "newspaper": "kashmir Times",
        "headline": "Pak shells Poonch villages, border posts",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93100",
        "brief": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district...",
        "date": "7/29/2019 11:05:01 PM",
        "detailed_news": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district on Sunday eveningPolice said that the Pakistan army resorted to heavy shelling targetting Indian forward posts and civilian areas at Shahpur, Mankote and Sawjian thus leading to heavy exchange of fire from both sides in these sectors.“In Pak shelling, three civilian namely Fatima Jan, 35, wife of Mohammed Qasim resident of Shahpur, her around 15-day old child and Mohammed Arif,33, son of Mohammed Sayeed, also resident of Shahpur were injured. All three injured were rushed to District Hospital Poonch from where Fatima Jan and Mohammed Sayeed were referred to Government Medical College hospital, Jammu. However, the infant, who too had sustained critical injuries in his abdomen, was being treated in Poonch hospital,” Medical Superintendent District Hospital Poonch Shamim-Ul-Nisa told KTNS.   Meanwhile Sarpanch Najab Din said that some shells landed into residential areas at Shahpur . In the incident, two residential houses got damaged and three civilians including mother-child duo sustained injuries. Sarpanch added, “As the heavy shelling continued in the area, it's not possible to assess the exact loss of life and property.”Earlier SSP Poonch Ramesh Kumar Angral, while confirming heavy shelling in border areas of Shahpur, Mankote, Sawjian, said, “ Pakistan army targetted not only army posts on the Line of Control but also civilian population. Some shells landed into residential areas as well. As a result, three civilians were injured. All three injured were immediately shifted to District Hospital Poonch for treatment. Indian army was also responding to the shelling effectively.”DC Poonch Rahul Yadav, who himself was camping at District Hospital Poonch, told reporters that the condition of infant was critical as he too had sustained splinter injury in his abdomen. “He was not referred to GMC, Jammu given his condition. The doctors here are trying to stabilise his condition. That’s the priority. The administration is providing all required assistance to the victims.”  Defence PRO Devender Anand said, “Today at about 1700 hours Pak initiated unprovoked ceasefire violation by firing  of small arms and intense shelling with mortars along LoC in Shahpur and Sawjian sectors in district Poonch. Indian army is retaliating befittingly.”Besides Shahpur, Sawjian, Mankote, the two sides also traded fire along the LoC in Mendhar and Krishna Ghati sectors. Few houses in these areas also got damaged during shelling, reports said.In Sawjian sector, the house of Amna Bi, widow of Said Mohammed Khan, resident of Sawjian was also damaged partially. Heavy shelling continued till the last reports poured in. The cross-border firing by Pakistan has ended a five-day lull in the border skirmishes between India and Pakistan armies.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was also injured in another incident of ceasefire violation by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 20,
        "newspaper": "Greater Times",
        "headline": "Security forces launch search operation in Rajouri",
        "link": "https://www.greaterkashmir.com/news/pir-panjal/security-forces-launch-search-operation-in-rajouri/?utm_source=rss&utm_medium=rss&utm_campaign=security-forces-launch-search-operation-in-rajouri",
        "brief": "",
        "date": "Wed, 31 Jul 2019 19:58:12 +0000",
        "detailed_news": "Security forces on Wednesday launched a search operation in Kalsian area of Nowshera in Rajouri district of Jammu and Kashmir. A police official said that two suspects were seen moving in the area located close to Line of Control following which joint teams of army and police rushed to the spot. SDPO Nowshera, Brijesh Sharma<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/pir-panjal/security-forces-launch-search-operation-in-rajouri/\">Read More</a>"
    },
    {
        "sr_no": 23,
        "newspaper": "Greater Times",
        "headline": "2 students rescued from flash flood in Mendhar",
        "link": "https://www.greaterkashmir.com/news/chenab-valley/2-students-rescued-from-flash-flood-in-mendhar/?utm_source=rss&utm_medium=rss&utm_campaign=2-students-rescued-from-flash-flood-in-mendhar",
        "brief": "",
        "date": "Wed, 31 Jul 2019 19:53:21 +0000",
        "detailed_news": "Army and locals rescued two students who got trapped in flash flood in Chatral river of Mendhar town on Wednesday. As per eyewitnesses, some students were crossing Chatral River near Government Higher Secondary School when two of them got trapped in the swollen river water. “Some army personnel and locals, who spotted the students trapped<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/chenab-valley/2-students-rescued-from-flash-flood-in-mendhar/\">Read More</a>"
    },
    {
        "sr_no": 24,
        "newspaper": "Greater Times",
        "headline": "Dhoni joins Army in south Kashmir on 2-week stint",
        "link": "https://www.greaterkashmir.com/news/kashmir/dhoni-joins-army-in-south-kashmir-on-2-week-stint/?utm_source=rss&utm_medium=rss&utm_campaign=dhoni-joins-army-in-south-kashmir-on-2-week-stint",
        "brief": "",
        "date": "Wed, 31 Jul 2019 19:46:33 +0000",
        "detailed_news": "Mahendra Singh Dhoni, an honorary lieutenant colonel in the Territorial Army, joined Army troops in south Kashmir region on Wednesday to carry out patrolling, guard duties and similar responsibilities just like other soldiers. The former Indian cricket team captain will be staying with his 106 TA Battalion (Para) till August 15 and under take duties<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/kashmir/dhoni-joins-army-in-south-kashmir-on-2-week-stint/\">Read More</a>"
    },
    {
        "sr_no": 38,
        "newspaper": "Greater Times",
        "headline": "Six dead as heavy rain batters Vadodara; airport shut, army on standby",
        "link": "https://www.hindustantimes.com/india-news/six-dead-as-heavy-rain-batters-vadodara-airport-shut-army-on-standby/story-0x0Kj7Qdn351QTFFuVpKJP.html",
        "brief": "",
        "date": "Thu, 01 Aug 2019 06:38:27 GMT ",
        "detailed_news": "The city received 442mm of rain in just 12 hours between 8am and 8pm on Wednesday, the highest in Gujarat in the period, said a release by the state government. "
    },
    {
        "sr_no": 60,
        "newspaper": "Dawn",
        "headline": "US sanctions Iran's foreign minister",
        "link": "https://www.dawn.com/news/1497463/us-sanctions-irans-foreign-minister",
        "brief": "",
        "date": "Updated August 01, 2019",
        "detailed_news": [
            "The United States on Wednesday imposed sanctions against Iran's foreign minister, Mohammad Javad Zarif, effectively slamming the door on the country's top diplomat. ",
            "The sanctions freeze any of Zarif's assets in the United States or that are controlled by US entities, the government announced, saying it also will curtail his international travel. ",
            "\"Zarif implements the reckless agenda of Iran's Supreme Leader, and is the regime's primary spokesperson around the world. The United States is sending a clear message to the Iranian regime that its recent behavior is completely unacceptable,\" Treasury Secretary Steven Mnuchin said in a statement.",
            "The designation of Zarif under the same sanctions earlier applied to Iran's supreme leader Ayatollah Ali Khamenei is the latest blow by President Donald Trump to the Obama administration's attempt to end nuclear tensions through negotiations. ",
            "But in a mixed message to Tehran, Washington on Wednesday extended waivers for three Iranian civil nuclear projects, to avoid upsetting the other signatories to the 2015 Iran nuclear agreement — China, Russia, Germany, France and Britain. ",
            "\"This is a short 90 day extension,\" said White House National Security Advisor John Bolton, a champion of the hawkish policy towards Tehran. ",
            "\"We are watching those nuclear activities very, very closely, they remain under daily scrutiny,\" he told Fox Business. ",
            "Zarif has been at the heart of complex talks with foreign capitals over Iran's nuclear power industry, which Tehran says is peaceful, but Washington and regional allies including Israel insist is cover for a secret weapons programme.",
            "But a senior Trump administration official said that Zarif's diplomatic image — bolstered by his fluent English, self-effacing humour and background as a US-educated academic — was false. ",
            "\"The key issue is that he has had this veneer [...] of being the sincere and reasonable interlocutor for the regime. Our point today is that he is no such thing,\" the official said on condition of anonymity. ",
            "\"Today President Trump decided enough was enough,\" the official said, accusing Zarif of functioning as \"propaganda minister, not foreign minister\". ",
            "Zarif shot back, tweeting that Washington is trying to silence Iran on the international stage. ",
            " ",
            "\"The US' reason for designating me is that I am Iran's 'primary spokesperson around the world' Is the truth really that painful?\" he tweeted. ",
            "Iranian President Hassan Rouhani said the sanctions on Zarif showed that the US was 'afraid' of the top diplomat.",
            "In addition to attempting to freeze assets, Washington will also squeeze Zarif's ability to function as a globe-trotting diplomat. He is expected to be able to continue to visit the United Nations in New York, albeit under tight restrictions. ",
            "\"The United States will continue to uphold our obligations,\" the administration official said. ",
            "In mid-July, Secretary of State Mike Pompeo said that Zarif would be issued a visa but would be limited to the area reaching six blocks around the UN headquarters. ",
            "Trump last year left the 2015 denuclearisation accord negotiated by Zarif with six nations including the United States under former president Barack Obama and imposed crippling sanctions on Tehran's economy, also vowing to curb Tehran's regional influence. ",
            "With tensions escalating in June, Trump says he issued a last-minute cancellation of military strikes on Iran after it shot down a US drone. ",
            "Critics question the legal or diplomatic rationale for targeting Zarif, however, saying that sanctions will all but end the possibility of dialogue. ",
            " ",
            "\"If you sanction diplomats you'll have less diplomacy,\" Republican Senator Rand Paul tweeted. ",
            "The senior administration official insisted that Washington still wants talks — only not with Zarif. ",
            "US diplomats \"do not consider him to be our primary point of contact,\" the official said.",
            "\"If we do have an official contact with the Iranians, we want someone who is a significant decision maker.\"",
            "\"The United States continues to seek a diplomatic solution that addresses the Iranian regime's destructive behaviour. The only path forward is a comprehensive deal that addresses the full range of its threats,\" Pompeo said in a statement. ",
            "\"Until then, our campaign of diplomatic isolation and maximum economic pressure will continue,\" he said. ",
            "Zarif, meanwhile, sought to minimise the sanctions' impact on him, tweeting that they have \"no effect on me or my family, as I have no property or interests outside of Iran. Thank you for considering me such a huge threat to your agenda.\""
        ]
    },
    {
        "sr_no": 68,
        "newspaper": "Dawn",
        "headline": "News TV blackouts in Pakistan draw fresh accusations of censorship",
        "link": "https://www.dawn.com/news/1497456/news-tv-blackouts-in-pakistan-draw-fresh-accusations-of-censorship",
        "brief": "",
        "date": "Updated Aug 01, 2019 11:29am",
        "detailed_news": [
            "Opposition parties have accused Prime Minister Imran Khan of intimidating broadcasters into a blackout on television coverage of his critics, after several TV channels were briefly taken off-air and opposition protests and news conferences passed unreported.",
            "The prime minister denies censoring the media and described such accusations as “a joke” during a visit to Washington in July, but relations with the press and broadcasters have become increasingly strained since he took office nearly a year ago.",
            "Fuelling the criticism, as Prime Minister Imran headed back from the United States last Wednesday a news conference by opposition leader Maryam Nawaz, which would normally be carried live on TV news stations, went unseen as broadcasters held back from coverage.",
            "“Pakistan’s media is facing the worst censorship,” Maryam told the news conference, which was broadcast on YouTube. “If any news channel tries to air our presser or rallies, it is threatened to go off air.”",
            "Media managers were reluctant to comment publicly when contacted by Reuters, but statements from industry bodies have complained about pressure on journalists and their employers.",
            "News groups have also been alarmed by proposals to establish special courts to hear cases relating to the media.",
            "The All Pakistan Newspapers Society (APNS) described the proposal as institutionalised “arm-twisting”.",
            "“The media is already braving strong pressures in the form of press advice and measures of intimidation from ruling quarters which are tantamount to undeclared censorship,” it said.",
            "Prime Minister Imran's government dismisses the criticism and says it is dealing with the consequences of abuses by past administrations, who it says used lucrative government advertising business to buy favourable coverage.",
            "His Pakistan Tehreek-i-Insaf (PTI) party earlier this month posted a series of tweets warning media houses and journalists that they should not “end up propagating (the) enemy’s stance” in criticising the government.",
            "Pakistan’s press has had a turbulent relationship with successive governments and the powerful military over many years. Some in the media complained of a severe crackdown in the run up to the 2018 general election that saw PTI sweep to power.",
            "Writers and bloggers say several cases of reporters being abducted and beaten, critical columnists being denied space, advertising business cut to media houses and sackings of unfavourable TV commentators have created a climate of fear and self-censorship.",
            "The military and government have denied state agencies have been involved in any of those incidents. They also reject opposition accusations that the army colluded in bringing the PTI to power.",
            "PML-N says it is the main target of a renewed crackdown, which comes after it aired a video apparently showing one of the judges who convicted party founder and former prime minister Nawaz Sharif last year on corruption charges saying he had been blackmailed to deliver a guilty verdict. The judge, who later denied the allegations, has since been sacked.",
            "In recent weeks planned interviews with party leader Maryam have been pulled without explanation at the last minute, while her voice has been repeatedly muted mysteriously during interviews.",
            "Geo News TV has suffered a series of problems since late July.",
            "Coverage was abruptly suspended and its position on cable dials dropped from a favourable place at the top of the list to a slot near the bottom.",
            "Geo TV’s Managing Director Azhar Abbas said the broadcaster had received no warning or explanation and had not been notified of who had ordered the changes.",
            "“The closure is without any prior notice to the organisation by the regulatory authority or the government,” he told Reuters. “We have made fervent attempts to reach out to ... the military media wing, but officials there also deny any involvement.”",
            "Three other TV channels, 24 News, AbbTakk News and Capital TV, were shut down for one day after they gave Maryam Nawaz live coverage earlier this month.",
            "“I was informed by management that they received instructions this couldn’t be carried,” said Najam Sethi, a 24 News anchor, who had scheduled an interview with Maryam.",
            "“We, media owners and journalists alike, are in a state of siege. Pressure to control, manipulate, plant, tilt, block and propagate the news and analysis cycle comes from overt and covert civil-military platforms. Big brother isn’t just watching anymore. He is cracking the whip and it’s painful.”",
            "Ansar Naqvi, the station’s director programming and current affairs, said Sethi was asked not to conduct the interview in line with a request from the country’s broadcasting regulator.",
            "“We have verbal instructions from the regulator to ban Maryam’s coverage completely,” he told Reuters, adding that there was no written directive.",
            "Mohammad Tahir, spokesman for the state-run regulator Pakistan Electronic Media Authority (Pemra), denied that it had issued instructions to broadcasters not to run interviews. Asked who pulled the interviews, he told Reuters: “We didn’t.”",
            "The government’s main spokesperson, Firdous Aashiq Awan, told a meeting of Pakistani newspaper editors in Karachi last week that the Pemra was an independent body just doing its job. She did not comment on who was behind the blackouts.",
            "The Pakistan Broadcast Association (PBA) has condemned the shutdowns, while the US-based Committee to Protect Journalists (CPJ) said the blockage of Geo TV was “an unfortunate illustration of how widespread censorship has become in Pakistan”.",
            "Journalists’ bodies in Pakistan have held demonstrations nationwide.",
            "Reporters without Borders said in a statement last week that Pemra, “takes its lead from the military establishment”.",
            "The military, which denies accusations of interfering in civilian matters, said it would not respond to unspecified accusations.",
            "In Washington, Prime Minister Imran dismissed concerns about media freedom, saying it was freer than the media in Britain.",
            "“The criticism I have received from my own press, unprecedented,” he said. “So, to say that there are curbs on Pakistan press is a joke.”"
        ]
    },
    {
        "sr_no": 71,
        "newspaper": "Dawn",
        "headline": "Trump’s smile",
        "link": "https://www.dawn.com/news/1497433/trumps-smile",
        "brief": "",
        "date": "Updated August 01, 2019",
        "detailed_news": [
            "HERE’S a decent rule of thumb when dealing with the Americans: the sweeter their words, the steeper their ask. All relations between nation states are transactional; the only thing to wonder is what exactly is being transacted between them.",
            "Since Imran Khan’s recent visit to Washington, D.C. saw warm and pleasant vibes, it is worthwhile to ask about the substance of what was discussed during the visit. The first and foremost thing on the mind of the Trump administration is the desire to see a withdrawal of American troops from Afghanistan. Secretary of State Mike Pompeo said, weeks before the visit, that they want to see an agreement with the Afghan Taliban that would enable such a withdrawal by September of this year.",
            "The agreement that the Trump administration seeks is a ceasefire, followed by some sort of power-sharing arrangement between the Taliban and the Afghan government. This is important to achieve in the immediate term, before the end of the year 2019, since Donald Trump wants to campaign on having delivered on this pledge to effect a withdrawal of US forces from Afghanistan. Campaign season begins in earnest in February of 2020 when the caucuses get under way, and builds up till July of that year when the Democratic party convention takes place and the party announces its candidate.",
            "Trump will want to show a tangible and visible withdrawal of US forces from Afghanistan through these months, perhaps even heaping some ceremony onto the process, and claim success in the 18-year-old war as his signature accomplishment. Pakistan holds the key to whether or not he will be able to do this. Hence his sweet words during the visit.",
            "For Pakistan, the biggest fear is that there might be a repeat of 1990 all over again.",
            "The power-sharing arrangement will be a little trickier to manage, especially since powerful parties in Afghanistan, most notably India, would like to see such a deal scuttled. At the moment the Taliban have rejected any idea of including representatives from the government in Kabul into the peace talks. But an intra-Afghan dialogue has been kick-started, and one of the big asks that the Trump administration placed on the Pakistani delegation in D.C. was to play a more vigorous role in helping both sides in that dialogue to make progress in arriving at some sort of understanding among themselves.",
            "This is why we saw a flurry of headlines about an ‘intra-Afghan dialogue’ coming out in the Pakistani press in the run-up to the visit. “Islamabad hopeful Taliban will agree to intra-Afghan dialogue” ran a headline in this paper, for example. “The Afghan peace process has reached a promising but delicate stage. Pakistan will continue to play a role in helping the peace efforts with the expectation that this can soon transition to the next critical stage: an intra-Afghan dialogue. The international consensus is firmly in favour of this”, the story quoted Pakistan’s permanent representative to the United Nations, Dr Maleeha Lodhi.",
            "The dialogue did take place, supported by track two efforts. In mid-July, days before the D.C. visit, representatives of the Taliban and the Afghan government sat down with each other in Doha and agreed to reduce violence and to refrain from attacks on and around certain targets such as schools and hospitals, bazaars and places of worship, among others. The idea is now to build on this understanding, and pave the way towards a ceasefire followed by an agreement on power sharing.",
            "This is a steep ask for Pakistan to entertain, especially given the timelines. What makes the job trickier still is the role of the ‘spoilers’, but more than that, to ensure that the post withdrawal order is built to last. Moeed Yusuf of the United States Institute for Peace has had a chance to observe the entire process from a very close vantage point. He has written in this paper that Trump’s ambition is not shared by the bureaucracy of the US federal government, particularly the diplomatic corps and the military, where suspicion of Pakistan runs deep. “The view within the system remains that Pakistan needs to be pressured to force greater cooperation on Afghanistan” he wrote in these pages a few days ago.",
            "Some might argue that it is precisely such pressure that has persuaded Pakistan to do its part to help bring the Afghan Taliban to the negotiating table in the first place. They might remind us of Trump’s new year tweet, of the South Asia policy of August 2017 (that announcement was what set the ball rolling down the current path in the first place), as well as pressure mounted through international bodies like the Financial Action Task Force and the International Monetary Fund. If progress along the timeline laid down by the Trump administration continues apace, it is possible that pressure through both these bodies could fizzle out.",
            "The biggest challenge for the United States — whether the administration or the wider system driving the process — is to prevent Afghanistan from becoming a haven for terrorist groups all over again following the withdrawal. For this reason, there is talk of a continuing counterterrorism presence after combat troops are withdrawn. Pakistan has already given its nod to such a continuing presence, and even hinted its willingness to host certain elements of such a force.",
            "For Pakistan, the biggest fear is that there might be a repeat of 1990 all over again. The fear is that once they are gone, the Americans will forget all about this region (their foreign policy already lays limited stakes in South Asia beyond Afghanistan), and Pakistan will once again be left to face the consequences all on its own. The other side of this fear is what happens if the Americans are not able to get all that they want out of the process currently under way. Trump’s smile has saddled Pakistan with a steep ask, and nobody here wants to know what his frown might look like if things don’t work out as expected.",
            "The writer is a member of staff.",
            "khurram.husain@gmail.com",
            "Twitter: @khurramhusain",
            "Published in Dawn, August 1st, 2019"
        ]
    },
    {
        "sr_no": 77,
        "newspaper": "Tribune",
        "headline": "Talks with US on Afghan endgame today",
        "link": "https://tribune.com.pk/story/2025499/1-talks-us-afghan-endgame-today/",
        "brief": "",
        "date": "August 1, 2019",
        "detailed_news": [
            "ISLAMABAD: Pakistan and the US is going to hold a crucial round of talks in the federal capital today (Thursday) to discuss the ongoing Afghan peace process which, officials believe, entered a decisive phase.",
            "US special representative for peace in Afghanistan, Zalmay Khalilzad, along with senior officials are scheduled to meet Pakistani civil and military authorities to review the progress in the Afghan peace talks, officials told The Express Tribune on Wednesday.",
            "Khalilzad is traveling to Islamabad as a follow-up of the recent visit by Prime Minister Imran Khan to Washington where he had assured President Donald Trump that Pakistan would do ‘whatever in its power’ to facilitate the Afghan peace process.",
            "The US, it is said, has requested Pakistan to persuade the Afghan Taliban to declare a permanent ceasefire and hold intra-Afghan dialogue.",
            "Talks between Pakistan and the US are taking place amid reports that the Trump administration is close to signing an MoU with the Taliban during the upcoming talks in Doha.",
            "The MoU is reportedly about the timeframe for the US troop withdrawal from Afghanistan and the Taliban guarantees of not allowing the Afghan soil to be ever used again by terrorist groups such as Al Qaeda.",
            "Khalilzad, who so far held eight rounds of talks with the Taliban in Doha, was in Kabul this week to take the Afghan government on board about the possible MoU the US is planning to sign with the Taliban.",
            "Khalilzad is due to travel to Doha soon to hold another round of negotiations with the Taliban. But before that he has decided to make a stopover in Islamabad on his way to Doha.",
            "“I’m off to Doha, with a stop in Islamabad. In Doha, if the Taliban do their part, we will do ours, and conclude the agreement we have been working on,” Khalilzad tweeted.",
            "“Wrapping up my most productive visit to #Afghanistan since I took this job as Special Rep. The US and Afghanistan have agreed on next steps. And a negotiating team and technical support group are being finalized,” he added.",
            "Reports suggest that once the US and the Taliban agreed on a framework for the troop withdrawal, the next phase would focus on the intra-Afghan dialogue and seeking a permanent ceasefire in Afghanistan.",
            "Last week, an Afghan minister announced that a 15-member government delegation would be soon meeting the Taliban in some European country in first direct talks with the insurgents.",
            "The Taliban; however, were quick to reject the claims, insisting that they would only enter into talks with other Afghan rival groups — including the Ghani administration — once the deal with the US was struck.",
            "Given that now the Taliban and the US are close to signing a deal, it is likely that the insurgent groups will go ahead meeting the Afghan government’s delegation in Oslo next week.",
            "The official sources said Pakistan as a responsible country was playing a constructive role in facilitating the peace process.",
            "But Pakistan is also treading a careful path as Foreign Minister Shah Mehmood Qureshi clarified the other day that Islamabad would only facilitate but not become a guarantor in the Afghan peace deal."
        ]
    },
    {
        "sr_no": 83,
        "newspaper": "Tribune",
        "headline": "PM Imran's 'official working visit' to US costs only Rs11m to exchequer",
        "link": "https://tribune.com.pk/story/2025326/1-pm-imrans-official-working-visit-us-costs-rs11m-exchequer/",
        "brief": "",
        "date": "August 1, 2019",
        "detailed_news": [
            "KARACHI: With the nation taking keen interest into the official expenses of Prime Minister Imran Khan, the federal government released the costs of his recent three-day trip to the United States on Thursday.",
            "The premier’s maiden visit to Washington was followed by immense fanfare with the government vowing not to follow in the footsteps of former PPP and PML-N regimes when it came to travel and living costs.",
            "PM Imran’s visit cost almost Rs11 million to the national exchequer, which comes down to $67,180, according to the details released by the government.",
            "He took a 27-member delegation on his maiden trip, and flew on a commercial Qatar Airways flight with a stopover in Doha, instead of opting to charter an entire plane.",
            "Rs1.35 million were spent on the hotel expenses for the PM’s delegation with Rs6 million ditched out on their travelling expenses.",
            "Meanwhile, the prime minister gave gifts of Rs142,000 and spent Rs700,000 on tips.",
            "Rs1.3 million were spent on food and refreshments.",
            "He stayed at the Pakistani ambassador’s official residence, and not an expensive hotel during the official visit.",
            "In comparison, according to the government’s claim, former premier Nawaz Sharif had doled out $549,854 during his 2015 trip to the US whereas PPP Supremo Asif Ali Zardari spent $752,682.",
            "Facts speak for themselves! And it does not take spending huge amounts of public money to achieve tangible results for the country as PM IK's successful USA visit demonstrated! pic.twitter.com/dCjzIVE2pa",
            "— Shireen Mazari (@ShireenMazari1) July 31, 2019",
            "The trip was mostly hailed as a major diplomatic win for Islamabad with Trump even offering to mediate the Kashmir dispute between Pakistan and India.",
            "This caught New Delhi off-guard and was unexpected by the media and analysts.",
            "President Trump also reached out to premier Imran for his government to help negotiate a deal with the Taliban to end the longstanding conflict in Afghanistan."
        ]
    },
    {
        "sr_no": 104,
        "newspaper": "State Times",
        "headline": "Dhoni joins Army troops in terrorism-infested south Kashmir",
        "link": "http://news.statetimes.in/dhoni-joins-army-troops-in-terrorism-infested-south-kashmir/",
        "brief": "",
        "date": "Thu, 01 Aug 2019 05:18:56 +0000",
        "detailed_news": "STATE TIMES NEWS Srinagar: Mahendra Singh Dhoni, an honorary lieutenant colonel in the Territorial Army, joined Army troops in the terrorism-infested south Kashmir region on Wednesday to carry out patrolling, guard duties and similar responsibilities just like other soldiers. The former Indian cricket team captain will be staying with his 106 TA Battalion (Para) till [&#8230;]"
    }
]