[
    {
        "sr_no": 6,
        "newspaper": "kashmir Times",
        "headline": "Army jawan killed as Pak targets Indian posts, villages in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93161",
        "brief": "SUNDERBANI, Jul 30: An army jawan was killed as Pakistani troops violated the ceasefire for the third consecutive day and resorted to firing and shelling along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Tuesday.\r\n“The Pakistan army resorted t...",
        "date": "7/31/2019 11:08:18 PM",
        "detailed_news": "SUNDERBANI, Jul 30: An army jawan was killed as Pakistani troops violated the ceasefire for the third consecutive day and resorted to firing and shelling along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Tuesday.“The Pakistan army resorted to unprovoked ceasefire violation along the LoC in Sunderbani sector of Rajouri district today,” PRO Defence Lt Col Devender Anand said.He said the Indian army responded strongly and effectively. “Heavy damage to Pakistan army posts and casualties to Pakistani soldiers were inflicted by our troops. However in the exchange of fire, Naik Krishan Lal (34) was martyred,” Lt Col Anand said.LT Col Anand described Lal as a “brave, highly motivated and sincere” soldier. “The nation will always remain indebted to him for his supreme sacrifice and devotion to duty. Naik Krishan Lal hailed from Akhnoor 's Gagriyal village. He is survived by his wife Shashi Devi,” he said.This is the third such violation in as many days. On Monday, Pakistani troops had resorted to unprovoked firing and shelling along the LoC in Mankote and Shahpur sectors of Poonch district.A 10-day-old baby was killed and two persons injured in heavy shelling by Pakistan along the LoC in Shahpur sector of Poonch district on Sunday.In the meanwhile, army sources said that two Pakistani soldiers were gunned down in retaliatory action by the Indian army when the neighbouring country violated ceasefire in Tangdhar-Keran sector. However two civilians were injured in Jabdi, Tangdhar in cross LoC firing."
    },
    {
        "sr_no": 9,
        "newspaper": "kashmir Times",
        "headline": "Pak shells villages, border posts in Poonch on 2nd day",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93118",
        "brief": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.\r\nIndian side also r...",
        "date": "7/30/2019 3:53:20 PM",
        "detailed_news": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.Indian side also retaliated in equal measure. Two sides traded heavy fire till late afternoon.In the meanwhile, around 15-day infant, who had sustained critical splinter injuries in his abdomen along with his mother and another civilian in Pak shelling in Shahpur sector Sunday evening, succumbed to his injuries in Poonch District Hospital this morning. This afternoon, Deputy Commissioner Rahul Yadav also presented cash relief to persons injured in recent cross border firing.Army sources said, “Pakistani army violated ceasefire in Shahpur sector of Poonch this afternoon. Indian army retaliated with equal calibre and exchange of fire continued till 3.50 PM.”PRO Defence Devender Anand said, “At about 1245 hours, Pakistan initiated unprovoked ceasefire violation starting with firing of small arms followed by shelling with mortars along LoC in Shahpur sector (J&K). Indian army retaliated befittingly.”The army spokesperson said information on casualties on the Pakistani side in the retaliatory action was not immediately available.In the meanwhile, around 15-day old infant, who had sustained critical abdominal splinter injuries during heavy shelling by Pakistani troops along the Line of Control (LoC) in Shahpur sector of Poonch district Sunday evening, died at Poonch District hospital on Monday, a police official said.The infant, his mother Fatima Jan (35) and another civilian Mohammad Arif (40) were injured when mortar shells fired by Pakistan hit their village in Shahpur sector late Sunday evening. They were rushed to district hospital Poonch, where the minor succumbed to injuries this morning, he added.He said Jan and Arif were referred to the Government Medical College Hospital, Jammu, for specialised treatment where their condition was stated to be stable. The baby, however, was kept under observation in Poonch district hospital, where he breathed his last.Later this afternoon, Deputy Commissioner Rahul Yadav  presented cash relief to persons injured in recent cross border firing. He met the injured undergoing treatment at the District Hospital and inquired about their condition directed the doctors to provide them best possible treatment. The Deputy Commissioner provided a relief assistance of Rs 10,000 each to the injured out of Red Cross fund.Mortars and small arms were used from across the border to target forward posts and villages in Shahpur, Sawjian and Mendhar sectors between 5 PM and 10 PM on Sunday. Several houses were also damaged in the firing, the official said.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was injured in another incident of cross-border firing by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 11,
        "newspaper": "kashmir Times",
        "headline": "Pak shells Poonch villages, border posts",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93100",
        "brief": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district...",
        "date": "7/29/2019 11:05:01 PM",
        "detailed_news": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district on Sunday eveningPolice said that the Pakistan army resorted to heavy shelling targetting Indian forward posts and civilian areas at Shahpur, Mankote and Sawjian thus leading to heavy exchange of fire from both sides in these sectors.“In Pak shelling, three civilian namely Fatima Jan, 35, wife of Mohammed Qasim resident of Shahpur, her around 15-day old child and Mohammed Arif,33, son of Mohammed Sayeed, also resident of Shahpur were injured. All three injured were rushed to District Hospital Poonch from where Fatima Jan and Mohammed Sayeed were referred to Government Medical College hospital, Jammu. However, the infant, who too had sustained critical injuries in his abdomen, was being treated in Poonch hospital,” Medical Superintendent District Hospital Poonch Shamim-Ul-Nisa told KTNS.   Meanwhile Sarpanch Najab Din said that some shells landed into residential areas at Shahpur . In the incident, two residential houses got damaged and three civilians including mother-child duo sustained injuries. Sarpanch added, “As the heavy shelling continued in the area, it's not possible to assess the exact loss of life and property.”Earlier SSP Poonch Ramesh Kumar Angral, while confirming heavy shelling in border areas of Shahpur, Mankote, Sawjian, said, “ Pakistan army targetted not only army posts on the Line of Control but also civilian population. Some shells landed into residential areas as well. As a result, three civilians were injured. All three injured were immediately shifted to District Hospital Poonch for treatment. Indian army was also responding to the shelling effectively.”DC Poonch Rahul Yadav, who himself was camping at District Hospital Poonch, told reporters that the condition of infant was critical as he too had sustained splinter injury in his abdomen. “He was not referred to GMC, Jammu given his condition. The doctors here are trying to stabilise his condition. That’s the priority. The administration is providing all required assistance to the victims.”  Defence PRO Devender Anand said, “Today at about 1700 hours Pak initiated unprovoked ceasefire violation by firing  of small arms and intense shelling with mortars along LoC in Shahpur and Sawjian sectors in district Poonch. Indian army is retaliating befittingly.”Besides Shahpur, Sawjian, Mankote, the two sides also traded fire along the LoC in Mendhar and Krishna Ghati sectors. Few houses in these areas also got damaged during shelling, reports said.In Sawjian sector, the house of Amna Bi, widow of Said Mohammed Khan, resident of Sawjian was also damaged partially. Heavy shelling continued till the last reports poured in. The cross-border firing by Pakistan has ended a five-day lull in the border skirmishes between India and Pakistan armies.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was also injured in another incident of ceasefire violation by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 18,
        "newspaper": "Greater Times",
        "headline": "Militants planning to target Amarnath Yatra: Army",
        "link": "https://www.greaterkashmir.com/news/kashmir/militants-planning-to-target-amarnath-yatra-army/?utm_source=rss&utm_medium=rss&utm_campaign=militants-planning-to-target-amarnath-yatra-army",
        "brief": "",
        "date": "Fri, 02 Aug 2019 12:38:04 +0000",
        "detailed_news": "Pakistan-based militants are planning to target the Amarnath Yatra in the Kashmir Valley but security forces are up to the task to foil any such design, the army said on Friday. General Officer Commanding of Army&#8217;s 15 Corps Lt General KJS Dhillon&#8217;s statement came after searches in the past few days by security forces led<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/kashmir/militants-planning-to-target-amarnath-yatra-army/\">Read More</a>"
    },
    {
        "sr_no": 23,
        "newspaper": "Greater Times",
        "headline": "Situation at LoC under control, largely peaceful: Army",
        "link": "https://www.greaterkashmir.com/news/kashmir/situation-at-loc-under-control-largely-peaceful-army/?utm_source=rss&utm_medium=rss&utm_campaign=situation-at-loc-under-control-largely-peaceful-army",
        "brief": "",
        "date": "Fri, 02 Aug 2019 09:49:18 +0000",
        "detailed_news": "The situation along the LoC is under control and largely peaceful, the Army said on Friday, asserting that it will not allow Pakistan to disturb peace in Kashmir. In a joint briefing of security forces in Srinagar, Lt Gen Sarabjit Singh Dhillon, Commander of the 15 Corps, said the threat of improvised explosive devices in<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/kashmir/situation-at-loc-under-control-largely-peaceful-army/\">Read More</a>"
    },
    {
        "sr_no": 27,
        "newspaper": "Greater Times",
        "headline": "Guterres warns of world fracturing into 2 competing systems",
        "link": "https://www.greaterkashmir.com/news/world/guterres-warns-of-world-fracturing-into-2-competing-systems/?utm_source=rss&utm_medium=rss&utm_campaign=guterres-warns-of-world-fracturing-into-2-competing-systems",
        "brief": "",
        "date": "Fri, 02 Aug 2019 07:55:47 +0000",
        "detailed_news": "With trade and geopolitical tensions heating up, UN Secretary-General Antonio Guterres has warned that the world could fracture into two competing blocs &#8211; led by the US and China &#8211; with their own Internet, currency, trade system and military strategy. &#8220;I am troubled by the growing friction among the two largest global economies,&#8221; he told<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/world/guterres-warns-of-world-fracturing-into-2-competing-systems/\">Read More</a>"
    },
    {
        "sr_no": 48,
        "newspaper": "Greater Times",
        "headline": "'Foiled Pak Army's bid to attack Amarnath Yatra,' Army says with proof",
        "link": "https://www.hindustantimes.com/india-news/pak-army-ordance-factory-s-mark-on-j-k-mine-dangled-as-proof/story-sRt7uSuiO5qzNrncnBoeGO.html",
        "brief": "",
        "date": "Fri, 02 Aug 2019 02:09:54 GMT ",
        "detailed_news": "Security forces operating in Jammu and Kashmir released pictures of a mine bearing mark of a Pakistan ordnance factory recovered from one of the two Amarnath Yatra routes."
    },
    {
        "sr_no": 60,
        "newspaper": "Dawn",
        "headline": "US, Russia rip up Cold War-era INF missile treaty",
        "link": "https://www.dawn.com/news/1497685/us-russia-rip-up-cold-war-era-inf-missile-treaty",
        "brief": "",
        "date": "August 02, 2019",
        "detailed_news": [
            "The United States and Russia ripped up a Cold War-era missile pact on Friday in a move that raised the spectre of an arms race between the global powers.",
            "The 1987 Intermediate-Range Nuclear Forces (INF) treaty limited the use of medium-range missiles, both conventional and nuclear.",
            "US Secretary of State Mike Pompeo announced Washington's formal withdrawal in a prepared statement at a regional forum in Bangkok, minutes after Russia pronounced the treaty void.",
            "Both sides had signalled their intention to pull out of the treaty for months, trading accusations of breaking the terms of the deal.",
            "“Russia is solely responsible for the treaty's demise,” Pompeo said in a statement issued at an Association of Southeast Asian Nations (ASEAN) foreign ministers' meeting.",
            "Shortly before Pompeo's announcement, Russia's foreign ministry in Moscow said the deal had been terminated “at the initiative of the US”.",
            "Later, the Russian foreign ministry said that Washington had made a “serious mistake” in ditching the treaty, insisting that the US had abandoned the agreement for its own gain rather than because of alleged Russian violations.",
            "Deputy Foreign Minister Sergei Ryabkov also urged the US to implement a moratorium on deploying intermediate-range nuclear missiles after leaving the INF.",
            "Washington has for years accused Russia of developing a new type of missile, the 9M729, which it says violates the treaty — claims that NATO has backed up.",
            "The missile has a range of about 1,500 kilometres (900 miles) according to NATO, though Moscow says it can only travel 480 kilometres.",
            "The INF treaty limits the use of missiles with ranges of 500 to 5,500 kilometres. “Russia failed to return to full and verified compliance through the destruction of its noncompliant missile system,” Pompeo said, referring to the 9M729 ground-launched cruise missile.",
            "The 29-country NATO transatlantic alliance rallied behind Washington on Friday, blaming Russia for the treaty's demise and vowing to respond.",
            "“We regret that Russia has shown no willingness and taken no demonstrable steps to return to compliance with its international obligations,” NATO said in a statement.",
            "“NATO will respond in a measured and responsible way to the significant risks posed by the Russian 9M729 missile to Allied security.” ",
            "The White House launched a six-month withdrawal procedure for leaving the treaty in February.\nSoon after Moscow began its move to pull out, and last month Russian President Vladimir Putin formally suspended its participation.",
            "Signed in 1987 by then US president Ronald Reagan and Soviet leader Mikhail Gorbachev, the INF treaty was considered a cornerstone of the global arms control architecture.",
            "But the US said the pact had given other countries — namely China — free rein to develop their own long-range missiles and has accused Russia of repeated violations.",
            "US-China tensions — mainly over trade and maritime disputes — have been centre stage at the ASEAN meeting in Bangkok this week, where Pompeo has pedalled Washington's “Indo-Pacific” strategy to counter Beijing's economic and military might in Asia.",
            "Pompeo said on Friday the US was “seeking a new era of arms control that moves beyond the bilateral treaties of the past”, calling on Beijing to join discussions.",
            "“The US calls upon Russia and China to join us in this opportunity to deliver real security results to our nations and the entire world.” ",
            "The INF deal was seen as one of two key arms deals between Russia and the US — the other being the New START treaty, which keeps the nuclear arsenals of both countries well below their Cold War peak.",
            "That deal expires in 2021 and there appears to be little political will from Moscow or Washington to renew it, experts say.",
            "China has already rebuffed calls from the US to join the New START treaty in the future.\nThe demise of the INF has sparked fears of a new era of weapons development between the heavyweights.",
            "Putin last year announced plans to develop new weapons, including a medium-range land-based missile and a land-based version of the Kalibr missiles that have already successfully been used by the navy and tested in Syria.",
            "The US and Russia own more than 90 per cent of global nuclear stockpiles, according to the Council on Foreign Relations.",
            "“The end of the treaty could spark a new nuclear arms race,” it said."
        ]
    },
    {
        "sr_no": 67,
        "newspaper": "Dawn",
        "headline": "Should Pakistan allow dual citizens to contest elections? Yes",
        "link": "https://www.dawn.com/news/1497675/should-pakistan-allow-dual-citizens-to-contest-elections-yes",
        "brief": "",
        "date": "Published Aug 02, 2019 03:58pm",
        "detailed_news": [
            "Pakistan currently bars dual citizens from running for parliament. Article 63-1(c) of the Constitution says that \"A person shall be disqualified from being elected or chosen as, or being a member of the Majlis-i-Shoora (parliament) if he ceases to be a citizen of Pakistan, or acquires the citizenship of a foreign state.\" ",
            "The Pakistan Tehreek-i-Insaf (PTI) is now proposing an amendment to this clause. Many are accusing the PTI of taking another u-turn as Prime Minister Imran Khan has vehemently opposed such a move on many occasions in the past. While the charge carries weight, the more important issue is whether the move itself makes sense on rational grounds.",
            "This debate must be viewed from a human rights perspective which argues that the basic rights enjoyed by people by virtue of their citizenship must only be curtailed based on strong public security reasons. ",
            "Editorial: Lawmakers’ nationality",
            "Democracies generally give priority to citizen rights over security concerns unless such concerns are serious and demonstrable. However, they avoid preemptively abrogating the basic rights of whole groups of citizens based on weak suspicions of possible future wrongdoings by them. Contesting elections is one such basic citizenship right.",
            "Pakistan allows dual citizenship, but it stripped dual citizens off the right to contest elections — something that's available to all other law-abiding adult citizens — in the 1973 Constitution. ",
            "Thus, there is a very large qualitative difference between the two categories of persons barred from contesting elections — from specific individuals who have already committed a crime (Pakistan bans citizens from running for office if they are \"found guilty of a corrupt or illegal practice under any law,\" among other things) to a whole group of persons who have not yet committed any crime. So, this is a preemptive ban.",
            "In some cases, states do preemptively curtail some rights, but usually for brief periods, if the risk is high. So how high is the risk that dual citizens will actually harm Pakistan’s interests if they are allowed to become legislators? ",
            "Related: Class, race and romance in the Pakistani diaspora ",
            "To answer this question, one must look at evidence from countries which have been allowing dual citizens to contest elections for decades, including most of the 19 countries with which Pakistan allows dual citizenship. ",
            "In doing so, one finds no evidence that legislators with dual citizenship are usually or even often treasonous. In fact, dual citizens served even in Pakistani legislatures for several decades before the ban started being applied in earnest after 2008. But even from Pakistan, there is no evidence that any dual-citizen legislator played a treasonous role. ",
            "People give the examples of Shaukat Aziz and Moeen Qureshi as dual-citizen politicians who harmed Pakistan’s interests and fled abroad. However, it is not established as fact that they held second passports. ",
            "Furthermore, while one can criticise some of their specific policies, it is hard to argue that their policies were more harmful than those of our other civilian and military rulers, some of whom also fled abroad despite not holding dual citizenship.",
            "Read next: Not every diaspora Pakistani can donate $1,000. But even if Diamer-Bhasha reaches its funding goal, then what?",
            "Dual citizenship can potentially create multiple loyalties. However, when someone has to make a choice, he/she can also prioritise one’s country of birth, present residence and high-level political involvement over the country where one is merely a naturalised, non-resident or ordinary citizen. ",
            "People argue that the American oath requires renouncing previous loyalties and bearing arms. Adapted from 16th century British oaths, it has become antiquated and unenforceable. The United States started allowing dual citizenship in 1967 (for Pakistanis, a formal treaty in this regard was signed between Washington and Islamabad in 2002) which means that immigrants can retain previous allegiances and run for public offices. The country also abolished its conscription laws in 1973.",
            "The potential minor risks associated with dual citizens do not justify preemptive, lifetime and group-wide bans. At most, some precautionary measures would suffice. ",
            "The concern is that people who have no ties or investment in Pakistan may become legislators. To address it, the parliament could mandate residency and tax filing requirements of two or three years before one could become a legislator or cabinet member. ",
            "These requirements would apply not only to dual citizens but to all Pakistanis, including those who may be living abroad on long-term work or residency visas. Even otherwise, it is unlikely that anyone could win an election in Pakistan without fulfilling such residency requirements and developing roots in a particular constituency. ",
            "This would make it impossible for persons without any stakes or residency in Pakistan to be appointed to reserved assembly and senate seats or as governors, cabinet advisers or special assistants. ",
            "Dual citizens could also be barred from certain sensitive elected and non-elected executive positions, such as prime and foreign ministers, rather than ordinary parliament seats which individually have limited authority.  ",
            "View from the diaspora: At Imran's US jalsa, only the containers were missing ",
            "One finds no rational reason or evidence for depriving dual citizens of their basic right to contest elections. In fact, the arguments in favour are part of the xenophobia that swept Pakistan once ties with Western countries deteriorated after 2008. This is borne by the fact that there was little effort to apply the bar on dual citizens before that year. ",
            "Now, as ties start to mend after Imran Khan's visit to the US, it is hoped that this xenophobia will start to recede. Not only should Pakistan permit dual citizens to contest elections, it should also increase the number of countries with which dual citizenship is allowed.",
            "With globalisation, dual citizenship is becoming more common and beneficial for not only the individuals but also the countries involved. Pakistan should join the trend more prominently. ",
            "Header illustration by Leea Contractor ",
            "Are you living in the Pakistani diaspora? Share your experiences with us at prism@dawn.com"
        ]
    },
    {
        "sr_no": 76,
        "newspaper": "Tribune",
        "headline": "Bizenjo’s remarks about ISI chief unfounded: ISPR DG",
        "link": "https://tribune.com.pk/story/2026312/1-bizenjos-remarks-isi-chief-unfounded-ispr-dg/",
        "brief": "",
        "date": "August 2, 2019",
        "detailed_news": [
            "Inter-Services Public Relations (ISPR) Director General Major General Asif Ghafoor on Thursday refuted Senator Mir Hasil Bizenjo’s remarks that hinted at the Inter-Services Intelligence (ISI) chief’s involvement in manipulating the results of the no-confidence motion against the Senate chairman.",
            "“Remarks by Senator Mir Hasil Bizenjo implicating head of national premier institution are unfounded,” the military spokesperson tweeted.",
            "Remarks by Senator Mir Hasil Bizenjo implicating head of national premier institution are unfounded. The tendency to bring entire democratic process into disrepute for petty political gains doesn’t serve democracy.",
            "— DG ISPR (@OfficialDGISPR) August 1, 2019",
            "“The tendency to bring entire democratic process into disrepute for petty political gains doesn’t serve democracy,” he added.",
            "Minister for Water Resources Faisal Vawda also tweeted.",
            "پہلے میمو گیٹ میں حسین حقانی جیسے غدار، پھر ڈان لیکس کے ذریعے غداری اور اب چوری بچانے اور آج بری طرح ہارنے کے بعد فوج کےخلاف ہرزہ سرائی کرنے لگے۔جہاں فوج کے جوان اپنی جانیں قربان کر رہے ہیں وہاں یہ بے شرم اسی فوج کو بدنام کرتے ہیں۔ اب صرف افسوس نہیں، ایکشن کا وقت ہے۔ https://t.co/UyX6HLlIDn",
            "— Faisal Vawda (@FaisalVawdaPTI) August 1, 2019",
            "Meanwhile, news anchor Moeed Pirzada also criticised Bizenjo.",
            "“Hasil Bizenjo’s comments understandably reflect his frustration & defeat! Senator forgot that he himself represented a move, an evil design, and PTI govt had every right of defeating a political move through politics of it’s own. Why not identify those who didn’t support?” he tweeted.",
            "Hasil Bizenjo's comments understandably reflect his frustration & defeat! Senator forgot that he himself represented a move, an evil design, and PTI govt had every right of defeating a political move through politics of it's own. Why not identify those who didn't support?",
            "— Moeed Pirzada (@MoeedNj) August 1, 2019",
            "Earlier after the results of the secret ballot in the Senate were announced, Senator Bizenjo while responding to a reporter’s query said the 14 opposition senators who voted against the joint opposition’s no-trust motion were “ISI DG Lt Gen Faiz Hameed’s men”."
        ]
    },
    {
        "sr_no": 78,
        "newspaper": "Tribune",
        "headline": "Pakistan pushes Taliban for 'permanent ceasefire, intra-Afghan dialogue'",
        "link": "https://tribune.com.pk/story/2026111/1-qureshi-says-pakistan-will-continue-play-supportive-role-afghan-peace-process/",
        "brief": "",
        "date": "August 1, 2019",
        "detailed_news": [
            "ISLAMABAD: Pakistan on Thursday briefed the US President’s point person for Afghanistan about the steps taken by Islamabad, following the Prime Minister’s visit to Washington, to persuade the Afghan Taliban for permanent ceasefire and intra-Afghan dialogue.",
            "Details were not immediately available as to what specific steps Pakistan had taken to facilitate the peace process but officials familiar with the development told The Express Tribune that Islamabad had started executing the measures agreed between Prime Minister Imran Khan and President Donald Trump recently at a summit meeting in Washington.",
            "Zalmay Khalilzad, the US special representative for Afghan reconciliation, made a stopover in Islamabad where he was briefed about Pakistan’s recent measures.",
            "Khalilzad, who is soon to resume talks with the Taliban in Doha, held talks with Foreign Minister Shah Mehmood Qureshi and separately met the premier.",
            "The PM, before meeting Khalilzad, also chaired a high-powered huddle attended by army chief General Qamar Javed Bajwa, Inter-Services Intelligence (ISI) Director General Lt General Faiz Hamid and other senior officials. The meeting reviewed the outcome of the Trump-Imran summit and implementation of the decisions taken during the visit.",
            "Trump had invited Imran to the White House as a token of recognition of Pakistan’s positive role in facilitating the Afghan peace process as Islamabad’s effort had helped the US and Taliban to come close to a deal.",
            "It is believed that the upcoming round in Doha will culminate into the signing of an MoU between the US and Taliban on the timeframe for troops withdrawal from Afghanistan, and Taliban guarantees of not allowing Afghan soil to be used by terrorist groups such as al-Qaeda.",
            "Officials here said Khalilzad apprised the Pakistani authorities about the likely deal with the Taliban and the future course of action. Once the broader deal is struck, the next phase of talks would be on bringing all Afghan groups on one platform.",
            "Taliban have so far rejected repeated calls for holding direct talks with the Ghani administration, although they met other rival groups and even government figures but in their individual capacities.",
            "But with the deal all set to be signed, it is likely that the Taliban, through the help of Pakistan, would now agree to meet the Ghani administration. The meeting is expected to take place sometime next week in Oslo, according to reports.",
            "Foreign Minister Qureshi welcomed the progress achieved in the talks and the Intra-Afghan Peace Conference in Doha, in which all participants agreed upon a basic road map.",
            "It was noted that ultimately the intra-Afghan dialogue would be vital to reach an agreement where Afghanistan becomes a stable, peaceful and prosperous country. It was also stressed that taking the Afghan peace process forward remained a shared responsibility, according the foreign office.",
            "An official handout said that during the meeting with Khalilzad, PM Imran reiterated Pakistan’s commitment to remain engaged with the US and other stakeholders in facilitating the peace and reconciliation process in Afghanistan.",
            "Recalling his recent interaction with President Donald Trump in Washington, the Prime Minister emphasized that a peaceful and stable Afghanistan was in the interest of Pakistan as well as of the broader region.",
            "He also expressed satisfaction at the evolving international consensus and interest in fully supporting efforts to achieve long term peace and stability in Afghanistan.",
            "In the context of his recent visit to the United States, the PM underlined the importance that Pakistan attaches to a broad-based and enduring relationship between the two countries.",
            "Earlier, a high-level meeting was held at the Prime Minister’s Office to review the outcome of the PM’s visit to the US and summit meet.",
            "The meeting was attended by Foreign Minister Shah Mehmood Qureshi, Minister for Maritime Affairs Syed Ali Zaidi, Chief of Army Staff General Qamar Javed Bajwa, SAPM on Oveseas Pakistanis Syed Zulfiqar Abbas Bukhari, Director General ISI Lt. Gen. Faiz Hamid, Ambassador – at- Large Mr. Ali Jehangir Siddiqui and senior officials.",
            "The premier expressed his satisfaction on the successful visit and acknowledged the vision of President Trump regarding peace in the region and Pak-US bilateral relations.",
            "The forum also discussed measures to carry forward the decisions of the visit to execution phase staying in close coordination with US authorities including President Trump’s visit to Pakistan."
        ]
    },
    {
        "sr_no": 81,
        "newspaper": "Tribune",
        "headline": "The road ahead",
        "link": "https://tribune.com.pk/story/2026129/6-the-road-ahead/",
        "brief": "",
        "date": "August 2, 2019",
        "detailed_news": [
            "While there are differing views about the PM’s recent US visit, any realistic assessment must recognise two undeniable positive outcomes: one, that instead of the usual American mantra to “do more” against the Taliban, Pakistan is being asked to facilitate an Afghan peace settlement through dialogue which is consistent with Pakistan’s own policy; and, two, Trump’s previous South Asia strategy of relying on India to secure Afghanistan has been replaced by recognition of Pakistan’s central role in this process. Therefore, the dynamics of the Pakistan-US relations have changed from confrontation to cooperation. The key to developing a sustainable partnership will, however, depend upon the ability of both sides to resolve the Afghan conflict. This is by no means certain, as the road ahead has several obstacles to be overcome.",
            "The most serious challenge will be to reach and implement a sustainable Afghan peace settlement. With Pakistan’s crucial assistance, the US-Taliban talks have made significant progress, involving timeframe for US troop withdrawal and Taliban commitment to eliminate terrorism from the Afghan soil. But the Americans also want the Taliban to engage in direct talks with the Afghan government and accept a ceasefire, for which they seek Pakistan’s help to persuade the Taliban. It remains to be seen whether Pakistan can do so in the forthcoming talks with the Taliban leadership. So far, the Taliban have only agreed to an intra-Afghan dialogue and not just with the Afghan government, after the US withdrawal agreement has been announced. None of the sides have agreed to a ceasefire either. Meanwhile, an “unofficial” intra-Afghan dialogue in July reached agreement on a “roadmap” for peace in Afghanistan. This meeting was the continuation of efforts by Pakistan, the US, Russia and China. But the details of the roadmap still need to be worked out and implemented. Given the continuing differences among the Afghans on issues such as power sharing and the mechanism for the transition to a broad-based government as well as the baggage of the past ethnic and sectarian rivalries, implementation of the road-map will face serious difficulties.",
            "There could also be the negative role of spoilers like India and perhaps, Iran. While the latter could be brought on board on the grounds that they want to ensure the US forces exit from their neighbourhood, the former has a vested interest in preventing any role for the Taliban in a future Afghan government since they view the Taliban as Pakistan’s allies. Moreover, having been effectively dealt out of an Afghan agreement, India does not want an Afghan settlement that would help improve the Pakistan-US relations. For these reasons, India could use its Afghan allies to scuttle an agreement.",
            "Another challenge confronting Pakistan is the negative role of the American establishment which has used Pakistan as a scapegoat for its failure in Afghanistan. Its negative narrative continues to allege that Pakistan has “deceived” the US and wants to use the Taliban to “control” Afghanistan. Due to this hostility, no joint statement could be agreed upon during the PM’s visit. Allied to the establishment is the Indo-American lobby in the US Congress, media and think-tanks.",
            "There is also the danger that a rogue terrorist attack on US troops in Afghanistan, or a false-flag Indian operation within India or occupied Kashmir could be blamed on Pakistan and may derail Pakistan’s improving relations with the US. The Indians are quite capable of using their terrorist proxies like the TTP and the BLA to carry out such subversion. The “terrorism” issue which was noticeably on the back burner during the PM’s meeting with Trump could resurface and deviate from the real focus on an Afghan settlement.",
            "From a broader perspective, both countries would face the challenge of reconciling their respective approaches to each other. While Pakistan continues to seek a long-term strategic partnership with the US, the Americans are pursuing the short-term tactical goal of an Afghan settlement with Pakistan’s help. Moreover, in the growing rivalry between the US and China, Washington has engaged in a strategic partnership with New Delhi to contain China, whereas Islamabad maintains a strategic relationship with Beijing.",
            "To overcome these diverse challenges, Pakistan must, first of all, use every available leverage with the Afghans, including the Taliban, to conclude and implement a sustainable peace agreement in that country. At the same time, we need to be clear that we can only persuade but cannot compel the Afghans to resolve their differences. To strengthen our efforts, we must also involve like-minded countries, especially China and Russia, to achieve an Afghan accord. Such a concerted effort would also be useful to defeat Indian machinations to derail the process.",
            "Firm control would be needed against rogue elements within the country to overcome the charge of terrorism and prevent the realignment with the US from being derailed. This would also help Pakistan get off the FATF grey list and the UN’s terrorism listing. To demonstrate its cooperation, the US has also acted against the BLA which is a positive development. Concurrently, Pakistan needs to highlight the Indian and Afghan role in supporting terrorism through the TTP and the BLA, especially in view of the recent attacks on our troops.",
            "The PM’s personal rapport with Trump together with direct lines of communication with the White House would help neutralise the hostile American administration and anti-Pakistan lobbies. Success on the Afghan issue will further neutralise these critics.",
            "With regard to the global strategic context, Pakistan ought to position itself to benefit from the dynamics of superpower confrontation. Pakistan’s geopolitical location and possession of nuclear weapons are attributes that the US cannot ignore. Similarly, our strategic partnership with China, especially the implementation of CPEC, is a major factor for Pakistan’s security and stability. Moreover, beyond the Afghan issue, the US would still need Pakistan’s cooperation for counterterrorism and the larger interest of regional peace and security.",
            "A good beginning has been made by the PM’s visit to reset relations with the US. Now we need to move forward on the road ahead.",
            "Published in The Express Tribune, August 2nd, 2019.",
            "Like Opinion & Editorial on Facebook, follow @ETOpEd on Twitter to receive all updates on all our daily pieces."
        ]
    },
    {
        "sr_no": 83,
        "newspaper": "Tribune",
        "headline": "PM Imran's 'official working visit' to US costs only Rs11m to exchequer",
        "link": "https://tribune.com.pk/story/2025326/1-pm-imrans-official-working-visit-us-costs-rs11m-exchequer/",
        "brief": "",
        "date": "August 1, 2019",
        "detailed_news": [
            "KARACHI: With the nation taking keen interest into the official expenses of Prime Minister Imran Khan, the federal government released the costs of his recent three-day trip to the United States on Thursday.",
            "The premier’s maiden visit to Washington was followed by immense fanfare with the government vowing not to follow in the footsteps of former PPP and PML-N regimes when it came to travel and living costs.",
            "PM Imran’s visit cost almost Rs11 million to the national exchequer, which comes down to $67,180, according to the details released by the government.",
            "He took a 27-member delegation on his maiden trip, and flew on a commercial Qatar Airways flight with a stopover in Doha, instead of opting to charter an entire plane.",
            "Rs1.35 million were spent on the hotel expenses for the PM’s delegation with Rs6 million ditched out on their travelling expenses.",
            "Meanwhile, the prime minister gave gifts of Rs142,000 and spent Rs700,000 on tips.",
            "Rs1.3 million were spent on food and refreshments.",
            "He stayed at the Pakistani ambassador’s official residence, and not an expensive hotel during the official visit.",
            "In comparison, according to the government’s claim, former premier Nawaz Sharif had doled out $549,854 during his 2015 trip to the US whereas PPP Supremo Asif Ali Zardari spent $752,682.",
            "Facts speak for themselves! And it does not take spending huge amounts of public money to achieve tangible results for the country as PM IK's successful USA visit demonstrated! pic.twitter.com/dCjzIVE2pa",
            "— Shireen Mazari (@ShireenMazari1) July 31, 2019",
            "The trip was mostly hailed as a major diplomatic win for Islamabad with Trump even offering to mediate the Kashmir dispute between Pakistan and India.",
            "This caught New Delhi off-guard and was unexpected by the media and analysts.",
            "President Trump also reached out to premier Imran for his government to help negotiate a deal with the Taliban to end the longstanding conflict in Afghanistan."
        ]
    },
    {
        "sr_no": 95,
        "newspaper": "Daily Excelsior",
        "headline": "83 pc of youth who become militants are involved in stone pelting: Army",
        "link": "https://www.dailyexcelsior.com/83-pc-of-youth-who-become-militants-are-involved-in-stone-pelting-army/",
        "brief": "",
        "date": "Fri, 02 Aug 2019 11:27:59 +0000",
        "detailed_news": "<p>SRINAGAR: Urging parents, particularly mothers, to discourage their children from pelting stone on security forces, a top Army commander on Friday said that 83 per cent of the youth who become militants are involved in stone pelting. Lieutenant General KJS Dhillon, General Officer Commanding (GOC) of Army&#8217;s 15 Corps also reiterated his appeal asking local [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com/83-pc-of-youth-who-become-militants-are-involved-in-stone-pelting-army/\">83 pc of youth who become militants are involved in stone pelting: Army</a> appeared first on <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com\">Jammu Kashmir Latest News | Tourism | Breaking News J&amp;K</a>.</p>\n"
    },
    {
        "sr_no": 99,
        "newspaper": "State Times",
        "headline": "Pak-based terrorists planning to target Amarnath Yatra: Army",
        "link": "http://news.statetimes.in/pak-based-terrorists-planning-to-target-amarnath-yatra-army/",
        "brief": "",
        "date": "Fri, 02 Aug 2019 12:03:42 +0000",
        "detailed_news": "Srinagar: Pakistan-based terrorists are planning to target the Amarnath Yatra in the Kashmir Valley but security forces are up to the task to foil any such design, the army said on Friday. General Officer Commanding of Army&#8217;s 15 Corps Lt General KJS Dhillon&#8217;s statement came after searches in the past few days by security forces [&#8230;]"
    }
]