[
    {
        "sr_no": 9,
        "newspaper": "kashmir Times",
        "headline": "Civilian injured in Pak shelling in Poonch",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92933",
        "brief": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the se...",
        "date": "7/24/2019 3:07:43 PM",
        "detailed_news": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the second consecutive day on Tuesday.One civilian sustained minor injuries during ceasefire at 20.00 hours. The injured has been identified as Sher Mohd, 45, son of Mohammed Muneer resident of Mohalla  Bahchari Baloni.Defense PRO Lt Col Devender Anand, while confirming ceasefire violation by Pakistan, said, “This afternoon Pakistani army violated ceasefire in Dalhan sector of Poonch district. Indian army retaliated with equal caliber.”“Later Pakistan violated the ceasefire in Krishna Ghati, Mankote & Mendhar sectors of Poonch district. Pak initiated unprovoked ceasefire violation at around 1220 hours along LoC with firing of small arms in Poonch sector. Indian army befittingly retaliated the cross-border firing by the Pakistani army,’ he added.Local army sources said this afternoon at about 12.20 PM, Pakistani army opened indiscriminate fire towards Indian forward posts and civilian areas in Dalhan sector in Haveli. “Heavy mortar shelling was witnessed during ceasefire violation which was retaliated by India in equal measure. Both sides exchanged heavy gun fire and mortar shelling in the area,” Mohammed Sadiq, a local said. “In Pak shelling, two houses in our village were partially damaged. A number of forward LoC locations remained affected due to shelling and civilians were forced to remain inside their houses. The exchange of fire stopped at around 2.55 PM,” he added.Later this afternoon at around 3.25 PM, Pakistani army initiated unprovoked firing and shelling along the LoC in Krishna Ghati, Mankote sectors of Mendhar tehsil of Poonch district. Indian side too retaliated effectively and strongly.This was the third such violation in the past four days which left an army jawan dead and a civilian injured, the officials said. On Monday, Rifleman Mohammad Arif Shafi Alam Khan Pathan was killed in unprovoked firing by Pakistani troops in Sunderbani sector of Rajouri district.A civilian was injured in Pakistani firing in Balnoi village along the LoC in Mendhar sector of Poonch district on Saturday."
    },
    {
        "sr_no": 10,
        "newspaper": "kashmir Times",
        "headline": "Teenager shoots herself to death in Reasi",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92912",
        "brief": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. \r\nPolice stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at p...",
        "date": "7/24/2019 1:04:04 PM",
        "detailed_news": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. Police stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at present staying at Mamankote in the house of her maternal uncle Chamail Singh, son of Punjab Singh, who is serving in Indian army and presently posted in Haryana. “This evening she shot herself with her maternal uncle’s 12 bore rifle and died on spot. A case in this regard registered at Police Station Chassana and police started investigation to find the cause behind this extreme step,” police added."
    },
    {
        "sr_no": 12,
        "newspaper": "kashmir Times",
        "headline": "Rifleman killed in Pak firing in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92909",
        "brief": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.\r\nPRO Defence Lt Col Devender Anand, while confir...",
        "date": "7/24/2019 1:02:45 PM",
        "detailed_news": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.PRO Defence Lt Col Devender Anand, while confirming the ceasefire violation by neighbouring nation and death of a soldier, said, “Pakistan resorted to unprovoked ceasefire violation on the Line of Control (LoC). It resorted to mortar shelling and firing of small arms in the Sunderbani sector in the early hours. In the incident, Rifleman Mohammed Atif Shafi Alam Khan Pathan was critically injured. Rifleman was air evacuated to army hospital, where he succumbed to the injuries.”  “Indian troops responded strongly and inflicted heavy damage to Pakistan army posts and casualties to Pakistan soldiers in retaliation. However, the details of the damage on the Pakistan side are yet to be ascertained,” he added.“Rifleman Pathan, a young soldier, belonged to village Nawayard, tehsil Fatehganj district Vadodara, Gujarat and is survived by his parents, father Shafi Alam Khan Pathan and mother Habiban Banu. Rifleman Mohammed Atif Shafi Alam Khan Pathan was a brave, highly motivated and sincere soldier. The nation will always remain indebted to him for the supreme sacrifice and devotion to duty,” Defence spokesperson Lt Col Anand said.A police official said the cross-border firing started around 6.30 AM and continued intermittently for several hours, causing panic among the border residents who were advised to take necessary precautionary measures for their safety. This was the second ceasefire violation by Pakistan along the LoC in Jammu region in last three days.On Saturday, during the visit of Defence Minister Rajnath Singh to different parts of the state, Pakistani troops targeted Mendhar sector of Poonch district causing bullet injuries to a civilian in Balnoi village."
    },
    {
        "sr_no": 15,
        "newspaper": "Greater Times",
        "headline": "RAW officer Johri appointed as new BSF DG",
        "link": "https://www.greaterkashmir.com/news/national-2/raw-officer-johri-appointed-as-new-bsf-dg/?utm_source=rss&utm_medium=rss&utm_campaign=raw-officer-johri-appointed-as-new-bsf-dg",
        "brief": "",
        "date": "Sun, 28 Jul 2019 20:05:38 +0000",
        "detailed_news": "IPS officer V K Johri has been appointed as the next Director General (DG) of country&#8217;s largest border guarding force, BSF, an official order said Sunday. The order has been issued by the Appointments Committee of the Cabinet (ACC) that is headed by Prime Minister NarendraModi and has Home Minister Amit Shah as its member.<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/national-2/raw-officer-johri-appointed-as-new-bsf-dg/\">Read More</a>"
    },
    {
        "sr_no": 36,
        "newspaper": "Hindustan Times",
        "headline": "2 dead as terrorists storm office of Afghan president's running mate",
        "link": "https://www.hindustantimes.com/india-news/2-dead-as-gunmen-storm-office-of-afghan-president-s-running-mate/story-nHj6gqFBV5zxUfuIAtRvCI.html",
        "brief": "",
        "date": "Sun, 28 Jul 2019 03:53:37 GMT ",
        "detailed_news": "Amrullah Saleh, a vocal critic of the Taliban and Pakistan’s security establishment that backs the militant group, was in the office of his Green Trend party when it was targeted by at least four suicide attackers."
    },
    {
        "sr_no": 45,
        "newspaper": "Hindustan Times",
        "headline": "Pak Army spokesperson tweets doctored video of Indian war hero",
        "link": "https://www.hindustantimes.com/india-news/pak-army-spokesperson-tweets-doctored-video-of-indian-war-hero/story-dUg8s873sjFbNGQDJQYc7M.html",
        "brief": "",
        "date": "Sun, 28 Jul 2019 05:48:51 GMT ",
        "detailed_news": "Netizens were quick to point out that the video was recorded in 2015, approximately four years before the Balakot and its ensuing incidents occurred in 2019."
    },
    {
        "sr_no": 53,
        "newspaper": "Hindustan Times",
        "headline": "Islamabad must walk the talk on terrorism",
        "link": "https://www.hindustantimes.com/editorials/islamabad-must-walk-the-talk-on-terrorism/story-NkUGvmos7GWjGkNyXm9HSK.html",
        "brief": "",
        "date": "Thu, 25 Jul 2019 02:42:33 GMT ",
        "detailed_news": "Imran Khan must root out the terror infrastructure and prosecute the culprits"
    },
    {
        "sr_no": 56,
        "newspaper": "Dawn",
        "headline": "‘Managing’ the internet",
        "link": "https://www.dawn.com/news/1496835/managing-the-internet",
        "brief": "",
        "date": "Updated July 29, 2019",
        "detailed_news": [
            "LAST week, several news outlets reported comments made by the chairperson of Pakistan Telecommunication Authority on the organisation’s troubles in ‘managing’ content over the internet. The initial story that came out suggested that the PTA chief, a retired major general, had suggested exploring options utilised by countries like the UAE and China, where major social media platforms are either banned or heavily regulated. Later on, a flurry of inchoate clarifications issued by the organisation stressed that these were used as examples and that the PTA has no intention of banning internet platforms in Pakistan.",
            "The entire exchange, which happened in front of a Senate special committee, makes several references to blasphemous content hosted outside of Pakistan as the main source of frustration for the telecom regulator. While considered a serious matter, it is worth remembering that a similar debate led to a multi-year ban on YouTube under the PPP government, placing a significant freeze on content production and creation in Pakistan.",
            "Even if we take the most benign interpretation of the PTA’s statement, it doesn’t take much to see through the bugbear as a mere foothold in the larger conversation around regulating Pakistan’s internet sphere. And it doesn’t take much to see why the internet is proving to be a source of considerable consternation to the Pakistani state at this point.",
            "Regulating the internet under the pretext of hurt Muslim sentiment is something the state has been pushing for some time.",
            "It doesn’t take much to see that the China or Bangladesh or Burma model, whichever one is in vogue at this point, occupies many important minds.",
            "It received extra credence in the highly securitised atmosphere of the last decade, when anti-state jihadi content appeared as another cause for regulatory concern. The outcome, one that many are now familiar with, was the ill-thought-out Pakistan Electronic Crimes Act 2016, which was passed with considerable consensus by the previous, PML-N-led government. In the long list of things the party should be regretting, now that it’s on the other side of the quash, this should be pretty high up on the list.",
            "As highlighted by Ramsha Jahangir in an excellent online piece for this publication, PECA 2016 arms the regulator to assert its control by bypassing more thorough and consultative procedures for banning internet content. As a piece of legislation, PECA echoes the larger, danda-driven ethos of the Pakistani state on issues of political conflict, which has become all the more apparent in the last 12 months. What is this approach? Essentially, if you don’t like something, ban it, incarcerate it, and don’t let it see the light of day.",
            "None of this is to suggest that the issue of how a state (any state) interacts with internet content is straightforward. In countries like Pakistan, where physical violence against minorities of several types is common, provocations on and through the internet are a public policy issue that need to be resolved.",
            "But the pathway to resolution needs to be based on principles that are, at the very least, enshrined in the Constitution. To put it as briefly as possible, one unelected bureaucrat, appointed by an opaque process that was likely influenced by his former rank and institutional affiliation, cannot be making decisions that impact millions of internet users in the country. At the very least, it needs to be consultative and subject to transparent guidelines that can be debated and amended as and when the situation demands.",
            "On the other hand, this entire episode (and what’s gone on for the last three years with cyberspace in Pakistan as a whole), and in particular the examples that were cited in front of the Senate panel, provides us with a window into what the Pakistani state aspires to become.",
            "IR scholars have pointed out that norm diffusion is a powerful explanatory mechanism to understand how military and civilian leaders) make certain decisions. Norms often emanate from state-to-state power relations, with the more powerful ones providing blueprints for the less powerful ones. In Pakistan’s case, with increasing proximity to China and the Gulf, born out of our economic and geostrategic imperatives (or should one call them handicaps?), some of what defines those states is going to appear attractive to our decision-makers as well.",
            "This was something that people have highlighted at various points in the recent past as well. Authoritarianism is not something extraneous to the Pakistani state. The country has a long and illustrious (sic) history of centralising authority and utiliding coercion to achieve political objectives. What makes the current moment more pronounced is the perception of severity of the ‘national situation’. In other words, decision-makers now act on the sentiment that the country had become too soft, corrupt, and hollow in dealing with certain economic and political issues, and, therefore, needs a firmer grip on the handle to navigate through to eternal salvation.",
            "The PTA hearing made the analogies explicit, but it doesn’t take much to see that the China or Bangladesh or Burma model, whichever one is in vogue at this point, occupies many important minds. On paper, Pakistan is a parliamentary democracy, but such a remarkable one that every important decision is being taken by unelected technocrats, bureaucrats, and military officers of various shades. ",
            "To address and resolve this dissonance, I submit a fairly straightforward request: let those who wish to control this model, and those who wish to play along with it, come out with an institutional plan that suggests a new legal architecture for the state. The dissonance as it stands now just produces confusion and increases transaction costs. If the desire is to have a unitary state for however long, at least be open about it. That would allow citizens and politicians alike to engage with the actual truth, rather than switching back and forth between what is real and what is for show. ",
            "The writer teaches politics and sociology at Lums.",
            "umairjaved@outlook.com",
            "Twitter: @umairjav",
            "Published in Dawn, July 29th, 2019"
        ]
    },
    {
        "sr_no": 59,
        "newspaper": "Dawn",
        "headline": "Reservations on Taliban talks removed: Qureshi",
        "link": "https://www.dawn.com/news/1496801/reservations-on-taliban-talks-removed-qureshi",
        "brief": "",
        "date": "Updated July 29, 2019",
        "detailed_news": [
            "MULTAN: Foreign Minister Shah Mehmood Qureshi said on Sunday that the Taliban were ready for negotiations and Pakistan was playing the role of a mediator for restoration of peace in Afghanistan. ",
            "Talking to reporters, he said Afghan President Ashraf Ghani had some reservations over negotiations with the Taliban which had been removed by Pakistan.",
            "When Dawn contacted Mr Qureshi for his comment on a Taliban spokesman’s statement rejecting talks with the Afghan government, he said the Taliban were ready for talks with Islamabad and that’s what he meant to say earlier in the day.      ",
            "The minister said the visit of Prime Minister Imran Khan to the United States had given new dimensions to the US-Pakistan relations and its positive effects have started to show.",
            "“The entire world has witnessed improvement in relations between Pakistan and the US during the last 11 months and now there is a change in the attitude and thinking [of the US]. We did not go to the US to beg something rather we have exposed the enemies of peace before the US and the entire world. Earlier, Pakis­tan was being blamed for the situation in Afghanistan,” he said.",
            "He said Prime Minister Khan had been advocating for a long time that there was no other way than talks to find a peaceful solution and today the US, Russia, China, Europe and the entire Muslim world had endorsed this stand. Mr Qureshi, however, regretted that some forces were against peace in Pakistan and Afghanistan. “Soon we will expose these forces,” he said, adding that in the prevailing situation the support of the nation was required.",
            "“Pakistan Army is the best army of the world. Yesterday 10 army men sacrificed their lives for our security and we pay homage to them. Because of the sacrifices rendered and steps taken by the army peace has been restored in North Waziristan and other areas. Now the writ of the state has been established while development works have been started there and normality is returning,” he said.",
            "He said the PTI government had enhanced the respect of the country across the world. “Today you can see where the country is standing in connection with foreign affairs,” he said.",
            "Published in Dawn, July 29th, 2019"
        ]
    },
    {
        "sr_no": 69,
        "newspaper": "Tribune",
        "headline": "Captain among 10 soldiers martyred in two terrorist attacks",
        "link": "https://tribune.com.pk/story/2022737/1-six-soldiers-martyred-cross-border-attack/",
        "brief": "",
        "date": "July 27, 2019",
        "detailed_news": [
            "PESHAWAR / QUETTA: Two deadly attacks in the northwest and southwest of the country broke a relative lull in terrorist violence on Saturday. Ten soldiers – among them a captain – were martyred in the assaults on the security forces in North Waziristan tribal district of Khyber-Pakhtunkhwa and Turbat city of Balochistan.",
            "Army chief General Qamar Javed Bajwa described the two attacks as “dying efforts of frustrated inimical forces” while urging the international community to “facilitate regional peace”.",
            "“Salute to martyrs & families.We shall ensure defence & security of motherland at the cost of our sweat & blood.These are dying efforts of frustrated inimical forces while Pakistan moves from stability to enduring peace. It’s time for the world to facilitate regional peace”,COAS.",
            "— DG ISPR (@OfficialDGISPR) July 27, 2019",
            "In the first assault, six soldiers were martyred when their patrol came under attack in the Shawal tehsil of North Waziristan district close to the border with Afghanistan. According to the Inter-Services Public Relations (ISPR), the attack, which happened in the Gurbaz area of Shawal, was perpetrated by terrorists from across the border.",
            "The martyrs were shifted to Miramshah, the main city of North Waziristan, while the injured were ferried to a military hospital in the neighbouring Dera Ismail Khan district. The military has identified the martyrs as Havaldar Khalid, Sepoy Naveed, Sepoy Bachal, Sepoy Ali Raza, Sepoy M Babar, and Sepoy Ehsan.",
            "The area was cordoned off and a search operation was mounted after the deadly assault which, according to the media has been claimed by the Tehreek-e-Taliban Pakistan, the outlawed terrorist group which has found sanctuaries in Afghanistan after they were routed in a series of military offensives in the erstwhile tribal regions.",
            "North Waziristan – once a focal point in the global war on terror – held provincial elections for the first time earlier this month, a key step in bringing the region into the political mainstream after years of turmoil fuelled by terrorism.",
            "In the second attack, terrorists ambushed a patrol of the Frontier Corps in an area between Hushab and Turbat city on Friday, according to the military’s media wing. Four paramilitary soldiers were martyred in the ambush, the ISPR said while identifying the fatalities as Captain Aaqib, Sepoy Nadir, Sepoy Atif Altaf and Sepoy Hafeezullah.",
            "There was no immediate claim of responsibility for the attack, but Baloch terrorist groups fighting a low key insurgency in the province have carried out such attacks in the past. The deadliest of all these groups, the Balochistan Liberation Army (BLA), was designated by the United States as a global terrorist entity earlier this month.",
            "Balochistan is an important part of transport and energy projects that form part of China’s Belt and Road initiative, which has brought $57 billion of investment to Pakistan. India has publicly opposed the massive project, called China-Pakistan Economic Corridor.",
            "Pakistan has successfully stemmed the tide of terrorist violence as a result of a massive military operation, code-named Zarb-e-Azb, in 2014 in which the command and control centre of terrorists and their bomb-making factories had been decimated. The significant drop in terrorist violence has been acknowledged by national and international think tanks and monitors.",
            "According to the annual report of The Center for Research and Security Studies, violence-related casualties continued to decline in 2018, registering 45% drop from the previous year and 86% drop since 2013. However, the year 2019 saw a relative resurge in terrorist violence which Pakistani officials say is being fuelled by hostile agencies, India’s RAW in particular.",
            "The chief military spokesperson hinted at the possible involvement of foreign forces in the latest attacks. “Shahadat of 6 soldiers on Pak-Afghan border & 4 in Balochistan is the sacrifice Pakistan [is] making for peace in the region,” Maj Gen Asif Ghafoor wrote on his official Twitter handle.",
            "“While security of [erstwhile] tribal areas has been improved with efforts now focused to solidify [the] border, inimical forces are attempting to destabilise Balochistan. Their efforts shall Insha Allah fail,” he said in his tweet.",
            "Shahadat of 6 sldrs on Pak-Afg Bdr & 4 in Bln is the sacrifice Pakistan making for peace in the region. While security of tribal areas has been improved with efforts now focused to solidify border, inimical forces are attempting to destabilise Bln. Their efforts shall IA fail.",
            "— DG ISPR (@OfficialDGISPR) July 27, 2019",
            "Army chief Gen Qamar while paying tributes to the martyrs called upon the international community to facilitate peace in the region. “Salute to [the] martyrs & families. We shall ensure defence & security of [the] motherland at the cost of our sweat & blood,” Maj Gen Ghafoor quoted him as saying.",
            "“These are dying efforts of frustrated inimical forces while Pakistan moves from stability to enduring peace. It’s time for the world to facilitate regional peace,” the army chief further said.",
            "The two deadly attacks came days after a meeting between US President Donald Trump and Prime Minister Imran Khan which focused on Pakistan’s crucial role in helping to broker a political settlement to America’s longest, costliest and deadliest war in Afghanistan.",
            "The timing of the attacks is a telling reminder that whenever Pakistan moved to play a direct role in restoring peace in the strife-torn Afghanistan, inimical forces sabotaged these efforts in an attempt to deny Islamabad any credit for putting an end to the bloody war in its neighbourhood.",
            "Prime Minister Imran Khan also took to Twitter to condemn the attacks and laud the resolve of the armed forces in the country’s fight against terrorism.",
            "“My condolences and prayers go to the families of the 10 brave soldiers, including an officer, martyred fighting terrorists in North Waziristan and Balochistan today,” he wrote.",
            "I salute our armed forces personnel who continue to lay down their lives fighting terrorists to keep the nation safe. My condolences & prayers go to the families of the10 brave soldiers, including an officer, martyred fighting terrorists in North Waziristan & Balochistan today.",
            "— Imran Khan (@ImranKhanPTI) July 27, 2019",
            "K-P Chief Minister Mahmood Khan expressed grief over the martyrdom of the army soldiers. “We will eliminate terrorism from the country as the morale of the population is high,” he said. “Enemies of the country will never be successful in their plans.”",
            "Balochistan Chief Minister Jam Kamal Khan also condemned the terror attack in Turbat. “Coward terrorists have once again attacked the security forces that are making endless sacrifices for our country,” he said in a statement.",
            "(With additional input from agencies)"
        ]
    },
    {
        "sr_no": 75,
        "newspaper": "Tribune",
        "headline": "PM will inaugurate monsoon plantation campaign on ‘Plant for Pakistan’ day",
        "link": "https://tribune.com.pk/story/2023465/1-pm-will-inaugurate-monsoon-plantation-campaign-plant-pakistan-day/",
        "brief": "",
        "date": "July 28, 2019",
        "detailed_news": [
            "ISLAMABAD: The federal government has set a target of planting 140 million saplings across the country during a campaign which will be inaugurated by the prime minister in the first week of the August.",
            "The monsoon plantation drive will kick off by planting a sapling on the “Plant for Pakistan” day.",
            "Around one million sapling will be planted on the first day for which a ceremony to inaugurate the drive will be held at 161 places.",
            "According to documents, nine million saplings will be planted in Punjab, 104 million in Khyber-Pakhtunkhwa, 15 million in Sindh, 1.2 million in Balochistan, 3.3 million in Gilgit-Baltistan, seven million in Azad Kashmir and 0.5 million in Islamabad.",
            "On the first day of the campaign, one million saplings will be planted — 224,000 of them in Punjab, 600,000 in Sindh, 70,000 in K-P, 10,000 in Balochistan, 5,000 in Gilgit-Baltistan and 3,000 in Islamabad.",
            "Punjab Forest Department Deputy Director Mohammad Salim Malik said school students, college students, members of non-governmental organisations and citizens from every corner of life will participate in planting saplings in their respective areas.",
            "“Saplings will be planted in various parks including Jallo Park, Karol Jungle and Changa Manga Forest and their surrounding areas. Similarly, over 343,000 saplings will be planted on August 8 and 9 under the campaign name of Plant for Punjab.”",
            "The forest department will also provide 0.3 million plants to the Pakistan Army as part of Sarsabz-o-Shadab Pakistan programme. An official of the department told The Express Tribune that citizens can get plants at an affordable price from nurseries of the forest department.",
            "Three-month tree plantation drive begins",
            "Earlier this year, the Ministry of Climate Change planted around 95.4 million saplings across the country under the “Plant for Pakistan” programme.",
            "A target of planting 141,600,000 saplings during the spring season was set across the country. The target was set at 12 million saplings in Punjab, 13 million, 10 million in K-P, 1.2 million in Balochistan, 4.8 million in AJK and seven million in G-B as well as 500,000 each by the Capital Development Authority, the National Highway Authority and the Defence Ministry along with 20,000 by the Pakistan Aeronautical Complex.",
            "The ministry had recovered some 2,500 acres occupied public land in Baluki where the Prime Minister Imran Khan had kicked-off the campaign on February 9 at the beginning of spring season while the ministry had exceeded its target on the given day by planting more than five million saplings.",
            "All hospitals, dispensaries, farmhouses and agricultural farmhouses across the country took part in the drive on February 14 while the civil aviation department and the jail departments planted saplings on February 15. The educational institutions including school, colleges and universities participated in the campaign on February 15."
        ]
    },
    {
        "sr_no": 81,
        "newspaper": "Tribune",
        "headline": "Pakistan, Turkey naval special forces complete joint exercise",
        "link": "https://tribune.com.pk/story/2023366/1-pakistan-turkey-naval-special-forces-complete-joint-exercise/",
        "brief": "",
        "date": "July 28, 2019",
        "detailed_news": [
            "KARACHI: Pakistan Navy Special Services Group (SSGN) and Turkish Navy Special Forces, Su Alti Taarruz (SAT), successfully completed a joint exercise, AYYILDIZ-2019, in Karachi on Sunday.",
            "The exercise included training in anti-terrorism, hostage rescue, counter-terrorism in the maritime domain, and intelligence-based operations.",
            "The 12-day exercise was aimed at strengthening military relations, inter-operability and to exchange professional expertise of the special forces.",
            "This was the 12th exercise in the AYYILDIZ series, which is an annual feature between Pakistan and Turkey and reflects the strong bilateral military ties between the two countries.",
            "Russia, Pakistan military to hold joint drills",
            "Islamabad and Ankara have also collaborated on various defence forums and taken part in multilateral exercises.",
            "Pakistan will also soon participate in joint drills with Russia. Moscow recently announced that ‘Friendship-2019’ will be held in Russia in early October.",
            "“The joint exercise will be held with the aim of exchanging experience between military personnel, developing and strengthening military-technical cooperation between the two countries,” the Russian defence ministry said in a statement.",
            "Mixed special-purpose groups consisting of Russian and Pakistani military personnel will perform combat training tasks using Russian armament, it said.",
            "The drills will be held at the Molkino training range in the southern Russian Krasnodar region and will involve about 50 Russian servicemen from special forces units.",
            " "
        ]
    },
    {
        "sr_no": 96,
        "newspaper": "State Times",
        "headline": "RAW officer Johri appointed as new BSF DG",
        "link": "http://news.statetimes.in/raw-officer-johri-appointed-as-new-bsf-dg/",
        "brief": "",
        "date": "Sun, 28 Jul 2019 19:56:44 +0000",
        "detailed_news": "STATE TIMES NEWS New Delhi: IPS officer V K Johri has been appointed as the next Director General (DG) of country&#8217;s largest border guarding force, BSF, an official order said on Sunday. The order has been issued by the Appointments Committee of the Cabinet (ACC) that is headed by Prime Minister Narendra Modi and has [&#8230;]"
    },
    {
        "sr_no": 115,
        "newspaper": "The News",
        "headline": "Taliban reject direct talks with Afghan govt",
        "link": "https://www.thenews.com.pk/print/505051-taliban-reject-direct-talks-with-afghan-govt",
        "brief": "",
        "date": "Mon, 29 Jul 2019 00:00:00 +0500",
        "detailed_news": "KABUL: An Afghan official on Sunday said the government would hold its first-ever direct talks with the Taliban within two weeks, but the latter quickly denied any such meeting was planned and reiterated their opposition to negotiating with the government representatives.The Taliban have been holding peace talks with the US for nearly a year but have refused to recognise the Kabul government, viewing it as an American puppet. Abdul Salam Rahimi, Afghanistan's state minister for peace affairs, said a 15-member government delegation will meet with the Taliban in Europe, without elaborating.The Taliban, however, rejected direct peace talks with the Afghan government and reiterated their demand of complete US forces&rsquo; pullout from the war-battered Afghanistan for intra-Afghan talks.Taliban spokesperson Zabihullah Mujahid said there had been no agreement on such a meeting and that had not been coordinated with Taliban.He said once they reach an agreement with the US, they would be open to intra-Afghan talks, but any government representatives would have to participate in a personal capacity.Suhail Shaheen, a spokesman for the Taliban&rsquo;s political office in Qatar, said talks with Kabul would only come after the departure of US forces under a deal.Khalilzad said on Twitter that after the US concludes its agreements, intra-Afghan negotiations would take place between the Taliban and &ldquo;an inclusive and effective national negotiating team consisting of senior government officials, key political party representatives, civil society and women&rdquo;.He said it would include the Taliban and \"an inclusive and effective national negotiating team consisting of senior government officials, key political party representatives, civil society and women.\"Khalilzad has held several rounds of direct talks with the Taliban in Qatar since late last year with the focus on a Taliban demand for withdrawal of US and other foreign forces and a US demand the Taliban guarantee that Afghanistan will not be used as a base for terrorism.Two other main issues in the peace process are a ceasefire and Taliban&rsquo;s talks with the Afghan government. But the Taliban have refused to talk to the Afghan government, terming it a US puppet.There are reports that the US and Taliban are going to sign an MoU this week to firm up a plan for withdrawal of foreign troops.On Sunday, Taliban guerrillas destroyed police checkpoints killing at least seven policemen and civilians in an attempt to seize control of a district in Ghazni."
    },
    {
        "sr_no": 116,
        "newspaper": "The News",
        "headline": "Doha talks from today: Will Taliban, US reach peace agreement?",
        "link": "https://www.thenews.com.pk/print/505052-doha-talks-from-today-will-taliban-us-reach-peace-agreement",
        "brief": "",
        "date": "Mon, 29 Jul 2019 00:00:00 +0500",
        "detailed_news": "ISLAMABAD: The Taliban and the United States have choreographed an agreement to bring nearly 18 years of military intervention and bloodshed in Afghanistan to an end, as the latter will provide a schedule for withdrawal of its troops.In all probabilities, the historic accord would be inked in Doha, Qatar on Thursday (August 1).The draft of agreement is being fine-tuned by the two sides before its formal announcement and signing.Senior Pakistani diplomats will be present in Doha on the occasion of signing of the accord.The accord will pave the way for further enhancing the peace process that will ensure ceasefire and an undertaking by the Taliban that their areas of influence would not be used by any terror group for activities in the country or beyond its frontiers.Highly placed diplomatic sources told The News Sunday evening that Mulla Abdul Ghani Brather will lead the Taliban, while the US Special Representative to Afghanistan Zalmay Khalilzad will be heading the US team to sign the deal.Brather is already in Doha.The intra-Afghan negotiations will culminate in an agreement for the future system in the war-ravaged country.Khalilzad has already discussed with the Afghan government the \"next steps in the peace process, including identifying a national negotiating team that can participate in intra-Afghan negotiations,\" during his recent trip to Afghan capital Kabul, the sources pointed out.The next two weeks will be crucial regarding future of peace in Afghanistan.Taliban leader Mulla Haibatullah might travel to Pakistan for his all-important meetings here, including Prime Minister Imran Khan and Chief of Army Staff (COAS) General Qamar Javaid Bajwa, whereas President Ashraf Ghani&rsquo;s administration will have a maiden interaction with the Taliban leaders in Kabul.The presidential election in Afghanistan, which has been deferred twice and now September 28 has been fixed for the schedule of the presidential poll, could yet another time be postponed for facilitating Taliban to take part in the process.The sources reminded that the 8th round of talks between the Taliban and the US in Doha will be initiated today (Monday) and for the purpose Zalmay Khalilzad is traveling to Doha who has already submitted an extensive report to President Donald Trump and State Department in Washington last week.According to estimates, more than 31,000 civilian deaths have been reported in the 18-year Afghan war.Reports suggest that 29,900 civilians have been wounded. More than 111,000 Afghans, including civilians, soldiers and militants, are estimated to have been killed in the conflict.A total of seven US military members have died in Afghanistan in 2019 so far. In March, two soldiers were killed. Currently, the US has about 14,000 troops in Afghanistan.The sources revealed that the conflicting parties had agreed on so-called &ldquo;Road-map for peace in Afghanistan.&rdquo;Forming such a team is a fraught issue, as the Taliban have been refusing to negotiate directly with the Afghan government.Washington is hoping for a political agreement with the armed groups in Afghanistan ahead of the Afghan presidential election scheduled for late September.A breakthrough could pave way for withdrawal of international troops some 18 years after the 9/11 attacks, which led the US to invade Afghanistan to dislodge the Taliban government from Kabul.Zalmay Khalilzad has had several meetings with the Taliban in the past year, the most recent being in second week of this month.Earlier, the Taliban and other senior Afghan officials held intra-Afghan talks in the Qatari capital, pledging to deliver a \"road map for peace\" in Afghanistan.US President Donald Trump voiced optimism last week that Pakistani Prime Minister Imran Khan could help broker a political settlement to end the war.\"I think Pakistan is going to help us out to extricate ourselves,\" Trump said, with Khan sitting next to him on Monday last at the start of a White House meeting."
    },
    {
        "sr_no": 122,
        "newspaper": "The News",
        "headline": "Deadly violence mars start of Afghan election season",
        "link": "https://www.thenews.com.pk/print/505057-deadly-violence-mars-start-of-afghan-election-season",
        "brief": "",
        "date": "Mon, 29 Jul 2019 00:00:00 +0500",
        "detailed_news": "KABUL: The start of Afghanistan&rsquo;s election season was marred by deadly violence Sunday, just hours after President Ashraf Ghani insisted &ldquo;peace is coming&rdquo; to the war-torn nation.At least two people were killed and 25 others wounded in an attack targeting the Kabul office of Ghani&rsquo;s running mate, Amrullah Saleh. The violence came on the official starting day of campaign season for the upcoming presidential elections, serving as a grim reminder of Afghanistan&rsquo;s woeful security situation and the sort of mayhem and murder that have beset previous polls.The attack began around 4:40 pm, when a huge blast struck near the Green Trend office, a youth- and reform-focused civil society organisation Saleh heads. He escaped without serious injury, his office said. Three hours later, the attack was still ongoing. No group immediately claimed responsibility. &ldquo;The security forces have cordoned off the area. The security forces are trying to kill the attackers as soon as possible,&rdquo; interior ministry spokesman Nasrat Rahimi said.Health ministry spokesman Wahidullah Mayar said at least two people had been killed and 25 wounded.Earlier on Sunday, a buoyant Ghani kicked off his campaign by insisting &ldquo;peace is coming&rdquo; and that pivotal talks with the Taliban would take place. He is hoping to fend off challenges from 17 other candidates to score a second term at twice-postponed presidential elections now slated for September 28. On Saturday, Ghani&rsquo;s peace minister, Abdul Salam Rahimi, said direct talks would take place with the Taliban within two weeks as part of a larger, US-led push for peace. Such a development could be crucial, as the Taliban -- who now control or influence about half of Afghanistan -- have so far refused to speak to Ghani&rsquo;s government, as they consider the Kabul administration illegitimate. War aside, the country faces a host of major issues ahead of the election, including rocketing crime, a lacklustre economy, soaring unemployment, and crumbling infrastructure.Voters are despondent about the prospects of a fair election, and many worry about a repeat of the sort of violent attacks on previous polling stations by the Taliban and other insurgent groups trying to undermine Afghanistan&rsquo;s fragile democracy. Ghani insisted this year&rsquo;s election would be &ldquo;clean&rdquo;, but distrust is rife.Sayed Jan, a 27-year-old student, said he won&rsquo;t be voting as he has lost faith since the 2014 election that was mired in allegations of fraud and ballot stuffing. &ldquo;We have been betrayed by the candidates in the past, we cannot trust them this time,&rdquo; he said. &ldquo;We need peace in Afghanistan instead of elections. Even if I vote, the election will be fraudulent.&rdquo;In Kabul, security forces fanned out across the city as leading candidates held rallies. Ghani&rsquo;s top rival is Abdullah Abdullah, who currently serves as the president&rsquo;s chief executive under an awkward power-sharing arrangement brokered by the US after the 2014 election. &ldquo;It is our national and religious duty to take advantage of any opportunities for peace,&rdquo; Abdullah told a campaign rally.One crucial issue is that the elections happen at all: they were postponed twice this year and further delays could lead to more distrust. Despite Ghani&rsquo;s claim that a summit between his government and the Taliban would take place shortly, the insurgents said they would only talk to Kabul after the US had announced a timeline for a withdrawal of foreign forces -- a key part of any deal. &ldquo;The Kabul administration will be considered a political side, just like others, and not a government,&rdquo; Taliban political spokesman Suhail Shaheen wrote in Pashto on Twitter.Diplomatic sources have said the Afghan-Taliban talks are scheduled to begin in Oslo on August 7.US peace envoy Zalmay Khalilzad, who is leading a push to forge a peace deal with the Taliban, said Saturday that new &ldquo;intra-Afghan&rdquo; negotiations would only take place after the US and Taliban had concluded their own agreements.He is expected to fly to Doha next week for what would be the eighth round of direct US-Taliban talks.Other presidential candidates include Ghani&rsquo;s former national security advisor Hanif Atmar and former warlord Gulbuddin Hekmatyar, nicknamed the &ldquo;Butcher of Kabul&rdquo; for his alleged role in the killing of thousands of people in the capital in the 1990s."
    }
]