[
    {
        "sr_no": 1,
        "newspaper": "kashmir Times",
        "headline": "Civilian injured in Pak firing in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93252",
        "brief": "RAJOURI, Aug 1: A civilian got injured as Pakistan violated ceasefire on the fifth consecutive day by firing unprovoked along the Line of Control (LoC) in Nowshera sector of Rajouri district in Jammu on Thursday.\r\n“Pakistan violated the ceasefire last night in Nowshera...",
        "date": "8/3/2019 1:33:52 AM",
        "detailed_news": "RAJOURI, Aug 1: A civilian got injured as Pakistan violated ceasefire on the fifth consecutive day by firing unprovoked along the Line of Control (LoC) in Nowshera sector of Rajouri district in Jammu on Thursday.“Pakistan violated the ceasefire last night in Nowshera sector of Rajouri in which a civilian suffered injuries,” official sources said.The civilian identified as Mohammad Altaf (37), resident of Pukherni, sustained a bullet injury in neck and he was hospitalised.Earlier on July 30, an army jawan attained martyrdom in ceasefire violation along the Line of Control in Rajouri district.On July 29, three civilian suffered injuries in Shahpur area of Poonch including a 10-day old child, who succumbed during the treatment.On Wednesday, India issued a strong demarche to the Pakistan High Commission against the killing of an innocent Indian civilian in an unprovoked act of firing by Pakistan forces. The firing resulted into killing of an infant boy and injuring of two civilians in the Poonch sector of Jammu and Kashmir. New Delhi also called upon Islamabad to investigate into the incident. External Affairs Ministry shot off a letter to Pakistan High Commission in India and condemned the deliberate targeting of innocent civilians by Pakistan forces. The letter said, this act is against all established humanitarian norms and professional military conduct."
    },
    {
        "sr_no": 9,
        "newspaper": "kashmir Times",
        "headline": "Army jawan killed as Pak targets Indian posts, villages in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93161",
        "brief": "SUNDERBANI, Jul 30: An army jawan was killed as Pakistani troops violated the ceasefire for the third consecutive day and resorted to firing and shelling along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Tuesday.\r\n“The Pakistan army resorted t...",
        "date": "7/31/2019 11:08:18 PM",
        "detailed_news": "SUNDERBANI, Jul 30: An army jawan was killed as Pakistani troops violated the ceasefire for the third consecutive day and resorted to firing and shelling along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Tuesday.“The Pakistan army resorted to unprovoked ceasefire violation along the LoC in Sunderbani sector of Rajouri district today,” PRO Defence Lt Col Devender Anand said.He said the Indian army responded strongly and effectively. “Heavy damage to Pakistan army posts and casualties to Pakistani soldiers were inflicted by our troops. However in the exchange of fire, Naik Krishan Lal (34) was martyred,” Lt Col Anand said.LT Col Anand described Lal as a “brave, highly motivated and sincere” soldier. “The nation will always remain indebted to him for his supreme sacrifice and devotion to duty. Naik Krishan Lal hailed from Akhnoor 's Gagriyal village. He is survived by his wife Shashi Devi,” he said.This is the third such violation in as many days. On Monday, Pakistani troops had resorted to unprovoked firing and shelling along the LoC in Mankote and Shahpur sectors of Poonch district.A 10-day-old baby was killed and two persons injured in heavy shelling by Pakistan along the LoC in Shahpur sector of Poonch district on Sunday.In the meanwhile, army sources said that two Pakistani soldiers were gunned down in retaliatory action by the Indian army when the neighbouring country violated ceasefire in Tangdhar-Keran sector. However two civilians were injured in Jabdi, Tangdhar in cross LoC firing."
    },
    {
        "sr_no": 12,
        "newspaper": "kashmir Times",
        "headline": "Pak shells villages, border posts in Poonch on 2nd day",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93118",
        "brief": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.\r\nIndian side also r...",
        "date": "7/30/2019 3:53:20 PM",
        "detailed_news": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.Indian side also retaliated in equal measure. Two sides traded heavy fire till late afternoon.In the meanwhile, around 15-day infant, who had sustained critical splinter injuries in his abdomen along with his mother and another civilian in Pak shelling in Shahpur sector Sunday evening, succumbed to his injuries in Poonch District Hospital this morning. This afternoon, Deputy Commissioner Rahul Yadav also presented cash relief to persons injured in recent cross border firing.Army sources said, “Pakistani army violated ceasefire in Shahpur sector of Poonch this afternoon. Indian army retaliated with equal calibre and exchange of fire continued till 3.50 PM.”PRO Defence Devender Anand said, “At about 1245 hours, Pakistan initiated unprovoked ceasefire violation starting with firing of small arms followed by shelling with mortars along LoC in Shahpur sector (J&K). Indian army retaliated befittingly.”The army spokesperson said information on casualties on the Pakistani side in the retaliatory action was not immediately available.In the meanwhile, around 15-day old infant, who had sustained critical abdominal splinter injuries during heavy shelling by Pakistani troops along the Line of Control (LoC) in Shahpur sector of Poonch district Sunday evening, died at Poonch District hospital on Monday, a police official said.The infant, his mother Fatima Jan (35) and another civilian Mohammad Arif (40) were injured when mortar shells fired by Pakistan hit their village in Shahpur sector late Sunday evening. They were rushed to district hospital Poonch, where the minor succumbed to injuries this morning, he added.He said Jan and Arif were referred to the Government Medical College Hospital, Jammu, for specialised treatment where their condition was stated to be stable. The baby, however, was kept under observation in Poonch district hospital, where he breathed his last.Later this afternoon, Deputy Commissioner Rahul Yadav  presented cash relief to persons injured in recent cross border firing. He met the injured undergoing treatment at the District Hospital and inquired about their condition directed the doctors to provide them best possible treatment. The Deputy Commissioner provided a relief assistance of Rs 10,000 each to the injured out of Red Cross fund.Mortars and small arms were used from across the border to target forward posts and villages in Shahpur, Sawjian and Mendhar sectors between 5 PM and 10 PM on Sunday. Several houses were also damaged in the firing, the official said.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was injured in another incident of cross-border firing by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 14,
        "newspaper": "kashmir Times",
        "headline": "Pak shells Poonch villages, border posts",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93100",
        "brief": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district...",
        "date": "7/29/2019 11:05:01 PM",
        "detailed_news": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district on Sunday eveningPolice said that the Pakistan army resorted to heavy shelling targetting Indian forward posts and civilian areas at Shahpur, Mankote and Sawjian thus leading to heavy exchange of fire from both sides in these sectors.“In Pak shelling, three civilian namely Fatima Jan, 35, wife of Mohammed Qasim resident of Shahpur, her around 15-day old child and Mohammed Arif,33, son of Mohammed Sayeed, also resident of Shahpur were injured. All three injured were rushed to District Hospital Poonch from where Fatima Jan and Mohammed Sayeed were referred to Government Medical College hospital, Jammu. However, the infant, who too had sustained critical injuries in his abdomen, was being treated in Poonch hospital,” Medical Superintendent District Hospital Poonch Shamim-Ul-Nisa told KTNS.   Meanwhile Sarpanch Najab Din said that some shells landed into residential areas at Shahpur . In the incident, two residential houses got damaged and three civilians including mother-child duo sustained injuries. Sarpanch added, “As the heavy shelling continued in the area, it's not possible to assess the exact loss of life and property.”Earlier SSP Poonch Ramesh Kumar Angral, while confirming heavy shelling in border areas of Shahpur, Mankote, Sawjian, said, “ Pakistan army targetted not only army posts on the Line of Control but also civilian population. Some shells landed into residential areas as well. As a result, three civilians were injured. All three injured were immediately shifted to District Hospital Poonch for treatment. Indian army was also responding to the shelling effectively.”DC Poonch Rahul Yadav, who himself was camping at District Hospital Poonch, told reporters that the condition of infant was critical as he too had sustained splinter injury in his abdomen. “He was not referred to GMC, Jammu given his condition. The doctors here are trying to stabilise his condition. That’s the priority. The administration is providing all required assistance to the victims.”  Defence PRO Devender Anand said, “Today at about 1700 hours Pak initiated unprovoked ceasefire violation by firing  of small arms and intense shelling with mortars along LoC in Shahpur and Sawjian sectors in district Poonch. Indian army is retaliating befittingly.”Besides Shahpur, Sawjian, Mankote, the two sides also traded fire along the LoC in Mendhar and Krishna Ghati sectors. Few houses in these areas also got damaged during shelling, reports said.In Sawjian sector, the house of Amna Bi, widow of Said Mohammed Khan, resident of Sawjian was also damaged partially. Heavy shelling continued till the last reports poured in. The cross-border firing by Pakistan has ended a five-day lull in the border skirmishes between India and Pakistan armies.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was also injured in another incident of ceasefire violation by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 24,
        "newspaper": "Greater Times",
        "headline": "Air bases, military installations on high alert in Jammu",
        "link": "https://www.greaterkashmir.com/news/front-page-2/air-bases-military-installations-on-high-alert-in-jammu/?utm_source=rss&utm_medium=rss&utm_campaign=air-bases-military-installations-on-high-alert-in-jammu",
        "brief": "",
        "date": "Fri, 02 Aug 2019 21:11:28 +0000",
        "detailed_news": "Authorities on Friday sounded a high alert in Jammu province. “Air bases and military installations in Jammu have been asked to remain in every ready mode with additional deployment troops on borders and sensitive locations,” an official told Greater Kashmir. “Jammu Air Force station put on ultra alert since morning with drones hovering over and<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/front-page-2/air-bases-military-installations-on-high-alert-in-jammu/\">Read More</a>"
    },
    {
        "sr_no": 32,
        "newspaper": "Greater Times",
        "headline": "In decision to curtail Amarnath yatra, a direct link to Masood Azhar's brother",
        "link": "https://www.hindustantimes.com/india-news/in-decision-to-curtail-amarnath-yatra-a-direct-link-to-masood-azhar-s-brother/story-Hts7MlK7GcRE0KKeB43WaM.html",
        "brief": "",
        "date": "Sat, 03 Aug 2019 03:53:42 GMT ",
        "detailed_news": "Inputs also indicated that trained JeM cadre had also formed Border Action Teams under the leadership of Ibrahim Azhar and moved to forward Pakistan army posts across the Line of Control (LoC) action."
    },
    {
        "sr_no": 46,
        "newspaper": "Greater Times",
        "headline": "In decision to curtail Amarnath yatra, a direct link to Masood Azhar's brother",
        "link": "https://www.hindustantimes.com/india-news/in-decision-to-curtail-amarnath-yatra-a-direct-link-to-masood-azhar-s-brother/story-Hts7MlK7GcRE0KKeB43WaM.html",
        "brief": "",
        "date": "Sat, 03 Aug 2019 03:53:42 GMT ",
        "detailed_news": "Inputs also indicated that trained JeM cadre had also formed Border Action Teams under the leadership of Ibrahim Azhar and moved to forward Pakistan army posts across the Line of Control (LoC) action."
    },
    {
        "sr_no": 48,
        "newspaper": "Greater Times",
        "headline": "Terrorists moved by Pak ahead of Imran Khan's US visit are back at LoC",
        "link": "https://www.hindustantimes.com/india-news/terrorists-moved-by-pak-ahead-of-imran-khan-s-us-visit-are-back-at-loc/story-9sKdIUhpRkJa8IyHv0uk7K.html",
        "brief": "",
        "date": "Sat, 03 Aug 2019 03:40:52 GMT ",
        "detailed_news": "Imran Khan met US President Donald Trump last week on July 22. For the first time, a Pakistani prime minister was accompanied by the country’s army chief, General Qamar Bajwa and spy agency Inter services Intelligence’s chief, Faiz Hameed. "
    },
    {
        "sr_no": 63,
        "newspaper": "Dawn",
        "headline": "PM Imran knows better than to believe that Pakistan's media is free",
        "link": "https://www.dawn.com/news/1497874/pm-imran-knows-better-than-to-believe-that-pakistans-media-is-free",
        "brief": "",
        "date": "August 03, 2019",
        "detailed_news": [
            "IN an interview during his recent, much-hyped trip to Washington, Imran Khan claimed that the media in Pakistan is ‘much freer’ than its UK counterpart.",
            "Really, Mr Khan? ",
            "Had this absurd claim been made by a politician who had not travelled much, I would have put it down to sheer ignorance. But our prime minister has squeezed a lot of mileage out of his university days at Oxford, and his years as a professional cricketer in England. He was also married to the prominent London socialite, Jemima Goldsmith, who is now a well-known journalist.",
            "Given this background, Imran Khan should be aware of just how free the British media is. For example, the newly elected prime minister, Boris Johnson, has been called a liar, a cheat and a buffoon by irreverent columnists and editorial writers for years. And these are just the milder epithets. Johnson’s colourful private life is often in the news, and his recent spat with his partner in which neighbours called the police made the headlines. ",
            "The Guardian cartoonist, Steve Bell, regularly depicts him as a human backside half-covered with a mop of blond hair. But it could have been worse as Bell’s drawings of David Cameron, the ex-prime minister, show. The Que­en is a regular target for stand-up comics who also mock everybody from politicians to the Pope.  ",
            "An escalating crackdown on critical comment is under way.",
            "I doubt very much that Imran Khan would tolerate such barbs. Of course, I am not suggesting for a moment that the Pakistani media should resort to such scurrilous comments and images for our prime minister. However, he knows full well that the British media enjoys a degree of freedom that we in Pakistan can only dream of. Perhaps he ought to remember the abuse he deployed against his opponents.",
            "In his long campaign, Khan was helped by a media that boosted his image uncritically. No TV anchor, and few newspaper editors, examined what lay behind the charisma and the bombast. But had either the PPP or the PML-N governments pulled one of his many interviews off the air, he would have gone ballistic, accusing his rivals of censorship and authoritarian practices. ",
            "At the time of his months-long Islamabad dharna, TV channels gave the chaotic scenes around Khan’s container 24/7 coverage. Indeed, I recall two TV panellists urging the ‘third umpire’ to raise his finger. To his credit, another panellist, Zahid Hussain, walked off the show, declaring that he was not prepared to listen to such blatant calls for military intervention.",
            "So in a sense, the media has only itself to blame for its present predicament. By providing endless coverage to Khan and his single-item, anti-corruption agenda, our TV channels and newspapers helped catapult him to power, albeit via a highly questionable election. As the pithy Punjabi expression has it: ‘Hore chupo!’, roughly translated as “You asked for it!”",
            "Another issue here is that many media house owners don’t want to annoy powerful politicians, judges and generals. For them, the bottom line is what counts, not abstract ideals like the freedom of speech.",
            "But Khan is not the only politician to benefit from a fawning media that is driven by the search for higher ratings and increased circulation. The reality is that the public prefers flamboyant figures like Boris Johnson, Donald Trump and Imran Khan to grey, anonymous politicians. ",
            "However, while Trump and Johnson are regularly lambasted on liberal TV channels, in newspapers and in social media, we in Pakistan are witnessing an escalating crackdown on critical comment. Opposition voices are being stifled as interviews with prominent politicians are pulled in mid-sentence. Editors are more careful than ever to avoid giving offence to power centres like the executive, the judiciary and the security establishment. ",
            "In a sense, the glo­ves are off, leaving little doubt abo­ut who’s in charge. True, Khan is allergic to criticism, but was tolerance ever part of his CV? Ho­w­ever, given its narrow parliamentary majority, it is doubtful if the PTI government could have made a noisy and exuberant media come to heel so quickly, had it not received open-ended support from the ‘third umpire’. ",
            "I’m not sure if the prime minister has studied Pakistan’s chequered political history, but politicians in power have always hated a free media, while they crave one when no longer in office. Although aspirants to power extol the virtues of democratic institutions when they are awaiting their turn, they find these same institutions irksome when they are elected or selected to high office. ",
            "Khan is perceived as having the establishment and the judiciary on his side, a luxury neither of his two predecessors enjoyed. Thus his government’s media crackdown continues without check. The electronic media regulator, Pemra, is a creature of the security state, ready to axe any broadcast that might annoy the powerful. ",
            "So we go through yet another cycle of repression and censorship that will, hopefully, be followed by resistance and revolt. ",
            "irfan.husain@gmail.com",
            "Published in Dawn, August 3rd, 2019"
        ]
    },
    {
        "sr_no": 69,
        "newspaper": "Dawn",
        "headline": "British town evacuated as dam disintegrates",
        "link": "https://www.dawn.com/news/1497847/british-town-evacuated-as-dam-disintegrates",
        "brief": "",
        "date": "Updated August 03, 2019",
        "detailed_news": [
            "WHALEY BRIDGE: Hundreds of people were evacuated from a town in central England as a British military helicopter was called in Friday to prevent a reservoir dam from collapsing.",
            "The Toddbrook Reservoir dam was feared to be on the verge of caving in following heavy rain, threatening the lives and homes of residents in Whaley Bridge.",
            "One side of the dam spillway weakened when the panels started to come away on Thursday. A Royal Air Force (RAF) helicopter lowered bags of aggregate into the damaged part of the dam wall on Friday, while 150 firefighters, deployed from around the country, have been pumping water out of the reservoir.",
            "“It is a critical situation,” said Julie Sharman, chief operating officer of the canal and River Trust which runs the reservoir.",
            "She said water levels had reduced by around eight inches (20 centimetres) overnight.",
            "The British government has issued a  “severe flooding — danger to life” warning for the area directly below the dam.",
            "Standing at a police cordon, Sarah Hamlet, 32, a company director, said:  “It’s very surreal. It doesn’t seem like it’s happening at all. It genuinely is a nightmare.” Whaley Bridge in Derbyshire is on the edge of the Peak District National Park and 16 miles (26 kilometres) southeast of the city of Manchester.",
            "The reservoir, which contains around 1.3 million tonnes of water, dates back to the 19th century. Fast-flowing water had been rushing over the spillway before the collapse.",
            "“The rest of the village, if it actually bursts, it’ll wipe it out because there’s a school just at the bottom of the reservoir, there’s a park for the kids at the bottom of the reservoir, and all the shops and amenities are there,” said Martin, 56, a builder who lives in Whaley Bridge.",
            "Published in Dawn, August 3rd, 2019"
        ]
    },
    {
        "sr_no": 72,
        "newspaper": "Dawn",
        "headline": "Al Qaeda attack kills 19 soldiers in Yemen",
        "link": "https://www.dawn.com/news/1497853/al-qaeda-attack-kills-19-soldiers-in-yemen",
        "brief": "",
        "date": "Updated August 03, 2019",
        "detailed_news": [
            "ADEN: Al Qaeda gunmen killed 19 soldiers in an attack on an army base in southern Yemen on Friday, security officials said, a day after deadly assaults by rebels and a jihadist bomber.",
            "The gunmen stormed Al-Mahfad base in Abyan province and remained inside for several hours before military reinforcements came, three security officials said, adding that the soldiers were killed in clashes with the jihadists.",
            "“The Qaeda gunmen took advantage of what happened (Thursday) in Aden and launched an assault on Al-Mahfad base and clashed with soldiers,” a government security official said.",
            "“Military reinforcements were sent... and the gunmen were killed while others were driven out with air support from the (Saudi-led) coalition, in an operation that lasted hours,” the official said.",
            "“At least 19 soldiers were killed and others wounded.” The other two officials confirmed both the details and the death toll.",
            "Security analyst Aleksandar Mitreski said the attacks  “seem opportunistic”.",
            "“Al Qaeda has neither the capability nor the strategic appetite to open a new front in south Yemen,” Matreski who is also a researcher at the University of Sydney said.",
            "“We may see other sporadic attacks in the future motivated by Al Qaeda’s desire to remain a relevant actor in the Yemeni conflict.” The Yemen-based Al Qaeda in the Arabian Peninsula (AQAP), the militant Islamic State group and other jihadists have flourished in the chaos of the civil war between the government and the Houthi rebels.",
            "The United States considers AQAP the global jihadist network’s most dangerous branch and has waged a long-running drone war against its leaders.",
            "On Thursday, separate attacks by the Huthis and jihadists hit security forces in Yemen’s second city Aden, killing at least 49 people, many of them newly trained police cadets, officials said.",
            "The first attack was a suicide car bombing carried out by jihadists on a police station that killed 13 police officers and wounded several others, a security source said.",
            "The second attack was carried out by the Houthis, who said they launched a drone and a ballistic missile at a training camp west of Aden, that killed 39 people.",
            "Published in Dawn, August 3rd, 2019"
        ]
    },
    {
        "sr_no": 75,
        "newspaper": "Tribune",
        "headline": "India sets conditions for access to Jadhav",
        "link": "https://tribune.com.pk/story/2026908/1-india-sets-conditions-access-jadhav/",
        "brief": "",
        "date": "August 2, 2019",
        "detailed_news": [
            "ISLAMABAD: An Indian official’s scheduled meeting with convicted spy Kulbhushan Jadhav on Friday after Pakistan officially allowed him consular access in line with the International Court of Justice’s (ICJ) verdict could not take place after New Delhi came up with certain conditions in response to Islamabad’s offer.",
            "According to sources, the meeting was supposed to be held at 3pm. However, Indian media has reported that New Delhi has Islamabad to provide “unimpeded” consular access to Jadhav in an environment free from the “fear of intimidation”. Now, they added, India was awaiting a response from Pakistan to its conditions.",
            "Indian news outlets have reported that New Delhi, in its communication to Pakistan on Thursday, “virtually turned down” Islamabad’s offer of providing consular access to the convicted spy.",
            "After Pakistan’s proposal, Indian External Affairs Ministry spokesperson Raveesh Kumar was reported as saying that New Delhi was examining Islamabad’s offer. The spokesperson had declined to confirm the time and date of the meeting.",
            "On Thursday, Pakistan officially offered consular access to  Jadhav. “We have offered the Indian High Commission to avail consular access on Friday [today]. The reply from the Indian side is awaited,” Foreign Office spokesperson Dr Muhammad Faisal said at a weekly news briefing.",
            "The ICJ in its verdict disappointed India as it neither annulled Jadhav’s conviction nor referred his matter for retrial.",
            "The ICJ directed Pakistan to take all measures to provide for effective review and reconsideration, including, if necessary, by enacting “appropriate legislation”.",
            "The court believed that the obligation to provide effective review and reconsideration could be carried out in various ways and the choice of means was left to Pakistan.",
            "Jadhav, a serving commander in Indian Navy working for India’s Research and Analysis Wing (RAW), was arrested on March 3, 2016, from Balochistan. In his subsequent trial at a military court, Kulbhushan Jadhav confessed to his involvement in hatching terror plots against Pakistan.",
            "Army chief General Qamar Javed Bajwa on April 10, 2017, endorsed his death penalty. In June 2017, the Indian spy filed a mercy petition against his death penalty while India approached the ICJ against the conviction."
        ]
    },
    {
        "sr_no": 79,
        "newspaper": "Tribune",
        "headline": "US seeks Pak, Afghan guarantees of no cross border threats",
        "link": "https://tribune.com.pk/story/2026935/1-us-seeks-pak-afghan-guarantees-no-cross-border-threats/",
        "brief": "",
        "date": "August 2, 2019",
        "detailed_news": [
            "ISLAMABAD: The United States is seeking firm guarantees both from Afghanistan and Pakistan that “neither side’s territory is used to threaten the other’s” in what is seen as a crucial aspect of a possible Afghan peace deal.",
            "Afghanistan and Pakistan have often blamed each other for harbouring militant groups involved in cross border attacks, something that undermined bilateral relationship between the two neighbours.",
            "The issue has been one of the talking points the US is currently having with Pakistan and Afghanistan on the Afghan endgame.",
            "This was now confirmed by Zalmay Khalilzad, the US Special Representative for Afghanistan Reconciliation, in a statement issued here on Friday by the US Embassy.",
            "Khalilzad wrapped up his latest trip to Islamabad where he held talks with Foreign Minister Shah Mehmood Qureshi and also separately met Prime Minister Imran Khan.",
            "Before departing for Doha on Friday, Khalilzad interacted with Army Chief General Qamar Javed Bajwa.",
            "“As Ambassador Khalilzad discussed in Afghanistan and Pakistan, consolidating peace will require reliable assurances from Afghanistan and Pakistan that neither side’s territory is used to threaten the other’s,” according to the US embassy handout.",
            "“Such assurances on top of an intra-Afghan comprehensive peace agreement will allow for increased regional economic integration, connectivity, and development,” the statement quoted Khalilzad as saying.",
            "The statement also noted that in his meetings with Prime Minister Imran Khan, Foreign Minister Shah Mehmood Qureshi, and Chief of Army Staff General Javed Bajwa, Khalilzad outlined the positive momentum in the Afghan peace process and next steps.",
            "They also discussed the role Pakistan has played in support of the process and additional positive steps Pakistan can take.",
            "In a separate statement, the Inter-Services Public Relations (ISPR) said Khalilzad called on General Qamar Javed Bajwa, Chief of Army Staff (COAS) in continuation of ongoing discussions and efforts for success of peace process in Afghanistan.",
            "Both shared the steps taken in this regard and agreed to continue working towards mutually agreed goals. Khalilzad appreciated Pakistan’s whole-hearted support to the process and expressed hope that others would follow in same vein, said the military’s media wing.",
            "The army chief said that Pakistan will play its role to enhance all efforts for peace towards fullest potential.",
            "Talks between the US and Taliban have entered into a decisive phase as two sides are soon expected to sign a memorandum of understanding on the US troops withdrawal and assurance by Taliban that Afghan soil will never again be used by terrorist groups.",
            "The likely deal will pave the way for intra-Afghan dialogue where rival groups would then try to push for a consensus peace deal.",
            "Taliban have so far repeatedly refused to hold direct talks with the Afghan government, calling it a US puppet. However, they have agreed to speak to the Kabul administration once the deal is struck with the US.",
            " "
        ]
    },
    {
        "sr_no": 83,
        "newspaper": "Tribune",
        "headline": "Bizenjo’s remarks about ISI chief unfounded: ISPR DG",
        "link": "https://tribune.com.pk/story/2026312/1-bizenjos-remarks-isi-chief-unfounded-ispr-dg/",
        "brief": "",
        "date": "August 2, 2019",
        "detailed_news": [
            "Inter-Services Public Relations (ISPR) Director General Major General Asif Ghafoor on Thursday refuted Senator Mir Hasil Bizenjo’s remarks that hinted at the Inter-Services Intelligence (ISI) chief’s involvement in manipulating the results of the no-confidence motion against the Senate chairman.",
            "“Remarks by Senator Mir Hasil Bizenjo implicating head of national premier institution are unfounded,” the military spokesperson tweeted.",
            "Remarks by Senator Mir Hasil Bizenjo implicating head of national premier institution are unfounded. The tendency to bring entire democratic process into disrepute for petty political gains doesn’t serve democracy.",
            "— DG ISPR (@OfficialDGISPR) August 1, 2019",
            "“The tendency to bring entire democratic process into disrepute for petty political gains doesn’t serve democracy,” he added.",
            "Minister for Water Resources Faisal Vawda also tweeted.",
            "پہلے میمو گیٹ میں حسین حقانی جیسے غدار، پھر ڈان لیکس کے ذریعے غداری اور اب چوری بچانے اور آج بری طرح ہارنے کے بعد فوج کےخلاف ہرزہ سرائی کرنے لگے۔جہاں فوج کے جوان اپنی جانیں قربان کر رہے ہیں وہاں یہ بے شرم اسی فوج کو بدنام کرتے ہیں۔ اب صرف افسوس نہیں، ایکشن کا وقت ہے۔ https://t.co/UyX6HLlIDn",
            "— Faisal Vawda (@FaisalVawdaPTI) August 1, 2019",
            "Meanwhile, news anchor Moeed Pirzada also criticised Bizenjo.",
            "“Hasil Bizenjo’s comments understandably reflect his frustration & defeat! Senator forgot that he himself represented a move, an evil design, and PTI govt had every right of defeating a political move through politics of it’s own. Why not identify those who didn’t support?” he tweeted.",
            "Hasil Bizenjo's comments understandably reflect his frustration & defeat! Senator forgot that he himself represented a move, an evil design, and PTI govt had every right of defeating a political move through politics of it's own. Why not identify those who didn't support?",
            "— Moeed Pirzada (@MoeedNj) August 1, 2019",
            "Earlier after the results of the secret ballot in the Senate were announced, Senator Bizenjo while responding to a reporter’s query said the 14 opposition senators who voted against the joint opposition’s no-trust motion were “ISI DG Lt Gen Faiz Hameed’s men”."
        ]
    },
    {
        "sr_no": 86,
        "newspaper": "Tribune",
        "headline": "PM Imran's 'official working visit' to US costs only Rs11m to exchequer",
        "link": "https://tribune.com.pk/story/2025326/1-pm-imrans-official-working-visit-us-costs-rs11m-exchequer/",
        "brief": "",
        "date": "August 1, 2019",
        "detailed_news": [
            "KARACHI: With the nation taking keen interest into the official expenses of Prime Minister Imran Khan, the federal government released the costs of his recent three-day trip to the United States on Thursday.",
            "The premier’s maiden visit to Washington was followed by immense fanfare with the government vowing not to follow in the footsteps of former PPP and PML-N regimes when it came to travel and living costs.",
            "PM Imran’s visit cost almost Rs11 million to the national exchequer, which comes down to $67,180, according to the details released by the government.",
            "He took a 27-member delegation on his maiden trip, and flew on a commercial Qatar Airways flight with a stopover in Doha, instead of opting to charter an entire plane.",
            "Rs1.35 million were spent on the hotel expenses for the PM’s delegation with Rs6 million ditched out on their travelling expenses.",
            "Meanwhile, the prime minister gave gifts of Rs142,000 and spent Rs700,000 on tips.",
            "Rs1.3 million were spent on food and refreshments.",
            "He stayed at the Pakistani ambassador’s official residence, and not an expensive hotel during the official visit.",
            "In comparison, according to the government’s claim, former premier Nawaz Sharif had doled out $549,854 during his 2015 trip to the US whereas PPP Supremo Asif Ali Zardari spent $752,682.",
            "Facts speak for themselves! And it does not take spending huge amounts of public money to achieve tangible results for the country as PM IK's successful USA visit demonstrated! pic.twitter.com/dCjzIVE2pa",
            "— Shireen Mazari (@ShireenMazari1) July 31, 2019",
            "The trip was mostly hailed as a major diplomatic win for Islamabad with Trump even offering to mediate the Kashmir dispute between Pakistan and India.",
            "This caught New Delhi off-guard and was unexpected by the media and analysts.",
            "President Trump also reached out to premier Imran for his government to help negotiate a deal with the Taliban to end the longstanding conflict in Afghanistan."
        ]
    },
    {
        "sr_no": 89,
        "newspaper": "Daily Excelsior",
        "headline": "One Army personnel injured in exchange of fire between terrorists and security forces in Malmapanpora area of Sopore",
        "link": "https://www.dailyexcelsior.com/one-army-personnel-injured-in-exchange-of-fire-between-terrorists-and-security-forces-in-malmapanpora-area-of-sopore/",
        "brief": "",
        "date": "Sat, 03 Aug 2019 02:10:38 +0000",
        "detailed_news": "<p>One Army personnel injured in exchange of fire between terrorists and security forces in Malmapanpora area of Sopore. Operation underway. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com/one-army-personnel-injured-in-exchange-of-fire-between-terrorists-and-security-forces-in-malmapanpora-area-of-sopore/\">One Army personnel injured in exchange of fire between terrorists and security forces in Malmapanpora area of Sopore</a> appeared first on <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com\">Jammu Kashmir Latest News | Tourism | Breaking News J&amp;K</a>.</p>\n"
    },
    {
        "sr_no": 90,
        "newspaper": "Daily Excelsior",
        "headline": "Terrorist killed in encounter with security forces in Sopore",
        "link": "https://www.dailyexcelsior.com/terrorist-killed-in-encounter-with-security-forces-in-sopore/",
        "brief": "",
        "date": "Sat, 03 Aug 2019 02:07:12 +0000",
        "detailed_news": "<p>Srinagar : One terrorist has been killed in an encounter with the security forces in Sopore. One Army personnel was also injured in exchange of fire. The encounter broke out between terrorists and the security forces in Malmapanpora area of Warpora of North Kashmir&#8217;s Sopore on Saturday. A joint team of Army&#8217;s 22RR, SOG and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com/terrorist-killed-in-encounter-with-security-forces-in-sopore/\">Terrorist killed in encounter with security forces in Sopore</a> appeared first on <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com\">Jammu Kashmir Latest News | Tourism | Breaking News J&amp;K</a>.</p>\n"
    }
]