[
    {
        "sr_no": 9,
        "newspaper": "kashmir Times",
        "headline": "Civilian injured in Pak shelling in Poonch",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92933",
        "brief": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the se...",
        "date": "7/24/2019 3:07:43 PM",
        "detailed_news": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the second consecutive day on Tuesday.One civilian sustained minor injuries during ceasefire at 20.00 hours. The injured has been identified as Sher Mohd, 45, son of Mohammed Muneer resident of Mohalla  Bahchari Baloni.Defense PRO Lt Col Devender Anand, while confirming ceasefire violation by Pakistan, said, “This afternoon Pakistani army violated ceasefire in Dalhan sector of Poonch district. Indian army retaliated with equal caliber.”“Later Pakistan violated the ceasefire in Krishna Ghati, Mankote & Mendhar sectors of Poonch district. Pak initiated unprovoked ceasefire violation at around 1220 hours along LoC with firing of small arms in Poonch sector. Indian army befittingly retaliated the cross-border firing by the Pakistani army,’ he added.Local army sources said this afternoon at about 12.20 PM, Pakistani army opened indiscriminate fire towards Indian forward posts and civilian areas in Dalhan sector in Haveli. “Heavy mortar shelling was witnessed during ceasefire violation which was retaliated by India in equal measure. Both sides exchanged heavy gun fire and mortar shelling in the area,” Mohammed Sadiq, a local said. “In Pak shelling, two houses in our village were partially damaged. A number of forward LoC locations remained affected due to shelling and civilians were forced to remain inside their houses. The exchange of fire stopped at around 2.55 PM,” he added.Later this afternoon at around 3.25 PM, Pakistani army initiated unprovoked firing and shelling along the LoC in Krishna Ghati, Mankote sectors of Mendhar tehsil of Poonch district. Indian side too retaliated effectively and strongly.This was the third such violation in the past four days which left an army jawan dead and a civilian injured, the officials said. On Monday, Rifleman Mohammad Arif Shafi Alam Khan Pathan was killed in unprovoked firing by Pakistani troops in Sunderbani sector of Rajouri district.A civilian was injured in Pakistani firing in Balnoi village along the LoC in Mendhar sector of Poonch district on Saturday."
    },
    {
        "sr_no": 10,
        "newspaper": "kashmir Times",
        "headline": "Teenager shoots herself to death in Reasi",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92912",
        "brief": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. \r\nPolice stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at p...",
        "date": "7/24/2019 1:04:04 PM",
        "detailed_news": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. Police stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at present staying at Mamankote in the house of her maternal uncle Chamail Singh, son of Punjab Singh, who is serving in Indian army and presently posted in Haryana. “This evening she shot herself with her maternal uncle’s 12 bore rifle and died on spot. A case in this regard registered at Police Station Chassana and police started investigation to find the cause behind this extreme step,” police added."
    },
    {
        "sr_no": 12,
        "newspaper": "kashmir Times",
        "headline": "Rifleman killed in Pak firing in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92909",
        "brief": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.\r\nPRO Defence Lt Col Devender Anand, while confir...",
        "date": "7/24/2019 1:02:45 PM",
        "detailed_news": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.PRO Defence Lt Col Devender Anand, while confirming the ceasefire violation by neighbouring nation and death of a soldier, said, “Pakistan resorted to unprovoked ceasefire violation on the Line of Control (LoC). It resorted to mortar shelling and firing of small arms in the Sunderbani sector in the early hours. In the incident, Rifleman Mohammed Atif Shafi Alam Khan Pathan was critically injured. Rifleman was air evacuated to army hospital, where he succumbed to the injuries.”  “Indian troops responded strongly and inflicted heavy damage to Pakistan army posts and casualties to Pakistan soldiers in retaliation. However, the details of the damage on the Pakistan side are yet to be ascertained,” he added.“Rifleman Pathan, a young soldier, belonged to village Nawayard, tehsil Fatehganj district Vadodara, Gujarat and is survived by his parents, father Shafi Alam Khan Pathan and mother Habiban Banu. Rifleman Mohammed Atif Shafi Alam Khan Pathan was a brave, highly motivated and sincere soldier. The nation will always remain indebted to him for the supreme sacrifice and devotion to duty,” Defence spokesperson Lt Col Anand said.A police official said the cross-border firing started around 6.30 AM and continued intermittently for several hours, causing panic among the border residents who were advised to take necessary precautionary measures for their safety. This was the second ceasefire violation by Pakistan along the LoC in Jammu region in last three days.On Saturday, during the visit of Defence Minister Rajnath Singh to different parts of the state, Pakistani troops targeted Mendhar sector of Poonch district causing bullet injuries to a civilian in Balnoi village."
    },
    {
        "sr_no": 15,
        "newspaper": "Greater Times",
        "headline": "RAW officer Johri appointed as new BSF DG",
        "link": "https://www.greaterkashmir.com/news/kashmir/raw-officer-johri-appointed-as-new-bsf-dg/?utm_source=rss&utm_medium=rss&utm_campaign=raw-officer-johri-appointed-as-new-bsf-dg",
        "brief": "",
        "date": "Sun, 28 Jul 2019 20:05:38 +0000",
        "detailed_news": "IPS officer V K Johri has been appointed as the next Director General (DG) of country&#8217;s largest border guarding force, BSF, an official order said Sunday. The order has been issued by the Appointments Committee of the Cabinet (ACC) that is headed by Prime Minister NarendraModi and has Home Minister Amit Shah as its member.<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/kashmir/raw-officer-johri-appointed-as-new-bsf-dg/\">Read More</a>"
    },
    {
        "sr_no": 43,
        "newspaper": "Hindustan Times",
        "headline": "Pak Army spokesperson tweets doctored video of Indian war hero",
        "link": "https://www.hindustantimes.com/india-news/pak-army-spokesperson-tweets-doctored-video-of-indian-war-hero/story-dUg8s873sjFbNGQDJQYc7M.html",
        "brief": "",
        "date": "Sun, 28 Jul 2019 05:48:51 GMT ",
        "detailed_news": "Netizens were quick to point out that the video was recorded in 2015, approximately four years before the Balakot and its ensuing incidents occurred in 2019."
    },
    {
        "sr_no": 53,
        "newspaper": "Hindustan Times",
        "headline": "Islamabad must walk the talk on terrorism",
        "link": "https://www.hindustantimes.com/editorials/islamabad-must-walk-the-talk-on-terrorism/story-NkUGvmos7GWjGkNyXm9HSK.html",
        "brief": "",
        "date": "Thu, 25 Jul 2019 02:42:33 GMT ",
        "detailed_news": "Imran Khan must root out the terror infrastructure and prosecute the culprits"
    },
    {
        "sr_no": 69,
        "newspaper": "Tribune",
        "headline": "Captain among 10 soldiers martyred in two terrorist attacks",
        "link": "https://tribune.com.pk/story/2022737/1-six-soldiers-martyred-cross-border-attack/",
        "brief": "",
        "date": "July 27, 2019",
        "detailed_news": [
            "PESHAWAR / QUETTA: Two deadly attacks in the northwest and southwest of the country broke a relative lull in terrorist violence on Saturday. Ten soldiers – among them a captain – were martyred in the assaults on the security forces in North Waziristan tribal district of Khyber-Pakhtunkhwa and Turbat city of Balochistan.",
            "Army chief General Qamar Javed Bajwa described the two attacks as “dying efforts of frustrated inimical forces” while urging the international community to “facilitate regional peace”.",
            "“Salute to martyrs & families.We shall ensure defence & security of motherland at the cost of our sweat & blood.These are dying efforts of frustrated inimical forces while Pakistan moves from stability to enduring peace. It’s time for the world to facilitate regional peace”,COAS.",
            "— DG ISPR (@OfficialDGISPR) July 27, 2019",
            "In the first assault, six soldiers were martyred when their patrol came under attack in the Shawal tehsil of North Waziristan district close to the border with Afghanistan. According to the Inter-Services Public Relations (ISPR), the attack, which happened in the Gurbaz area of Shawal, was perpetrated by terrorists from across the border.",
            "The martyrs were shifted to Miramshah, the main city of North Waziristan, while the injured were ferried to a military hospital in the neighbouring Dera Ismail Khan district. The military has identified the martyrs as Havaldar Khalid, Sepoy Naveed, Sepoy Bachal, Sepoy Ali Raza, Sepoy M Babar, and Sepoy Ehsan.",
            "The area was cordoned off and a search operation was mounted after the deadly assault which, according to the media has been claimed by the Tehreek-e-Taliban Pakistan, the outlawed terrorist group which has found sanctuaries in Afghanistan after they were routed in a series of military offensives in the erstwhile tribal regions.",
            "North Waziristan – once a focal point in the global war on terror – held provincial elections for the first time earlier this month, a key step in bringing the region into the political mainstream after years of turmoil fuelled by terrorism.",
            "In the second attack, terrorists ambushed a patrol of the Frontier Corps in an area between Hushab and Turbat city on Friday, according to the military’s media wing. Four paramilitary soldiers were martyred in the ambush, the ISPR said while identifying the fatalities as Captain Aaqib, Sepoy Nadir, Sepoy Atif Altaf and Sepoy Hafeezullah.",
            "There was no immediate claim of responsibility for the attack, but Baloch terrorist groups fighting a low key insurgency in the province have carried out such attacks in the past. The deadliest of all these groups, the Balochistan Liberation Army (BLA), was designated by the United States as a global terrorist entity earlier this month.",
            "Balochistan is an important part of transport and energy projects that form part of China’s Belt and Road initiative, which has brought $57 billion of investment to Pakistan. India has publicly opposed the massive project, called China-Pakistan Economic Corridor.",
            "Pakistan has successfully stemmed the tide of terrorist violence as a result of a massive military operation, code-named Zarb-e-Azb, in 2014 in which the command and control centre of terrorists and their bomb-making factories had been decimated. The significant drop in terrorist violence has been acknowledged by national and international think tanks and monitors.",
            "According to the annual report of The Center for Research and Security Studies, violence-related casualties continued to decline in 2018, registering 45% drop from the previous year and 86% drop since 2013. However, the year 2019 saw a relative resurge in terrorist violence which Pakistani officials say is being fuelled by hostile agencies, India’s RAW in particular.",
            "The chief military spokesperson hinted at the possible involvement of foreign forces in the latest attacks. “Shahadat of 6 soldiers on Pak-Afghan border & 4 in Balochistan is the sacrifice Pakistan [is] making for peace in the region,” Maj Gen Asif Ghafoor wrote on his official Twitter handle.",
            "“While security of [erstwhile] tribal areas has been improved with efforts now focused to solidify [the] border, inimical forces are attempting to destabilise Balochistan. Their efforts shall Insha Allah fail,” he said in his tweet.",
            "Shahadat of 6 sldrs on Pak-Afg Bdr & 4 in Bln is the sacrifice Pakistan making for peace in the region. While security of tribal areas has been improved with efforts now focused to solidify border, inimical forces are attempting to destabilise Bln. Their efforts shall IA fail.",
            "— DG ISPR (@OfficialDGISPR) July 27, 2019",
            "Army chief Gen Qamar while paying tributes to the martyrs called upon the international community to facilitate peace in the region. “Salute to [the] martyrs & families. We shall ensure defence & security of [the] motherland at the cost of our sweat & blood,” Maj Gen Ghafoor quoted him as saying.",
            "“These are dying efforts of frustrated inimical forces while Pakistan moves from stability to enduring peace. It’s time for the world to facilitate regional peace,” the army chief further said.",
            "The two deadly attacks came days after a meeting between US President Donald Trump and Prime Minister Imran Khan which focused on Pakistan’s crucial role in helping to broker a political settlement to America’s longest, costliest and deadliest war in Afghanistan.",
            "The timing of the attacks is a telling reminder that whenever Pakistan moved to play a direct role in restoring peace in the strife-torn Afghanistan, inimical forces sabotaged these efforts in an attempt to deny Islamabad any credit for putting an end to the bloody war in its neighbourhood.",
            "Prime Minister Imran Khan also took to Twitter to condemn the attacks and laud the resolve of the armed forces in the country’s fight against terrorism.",
            "“My condolences and prayers go to the families of the 10 brave soldiers, including an officer, martyred fighting terrorists in North Waziristan and Balochistan today,” he wrote.",
            "I salute our armed forces personnel who continue to lay down their lives fighting terrorists to keep the nation safe. My condolences & prayers go to the families of the10 brave soldiers, including an officer, martyred fighting terrorists in North Waziristan & Balochistan today.",
            "— Imran Khan (@ImranKhanPTI) July 27, 2019",
            "K-P Chief Minister Mahmood Khan expressed grief over the martyrdom of the army soldiers. “We will eliminate terrorism from the country as the morale of the population is high,” he said. “Enemies of the country will never be successful in their plans.”",
            "Balochistan Chief Minister Jam Kamal Khan also condemned the terror attack in Turbat. “Coward terrorists have once again attacked the security forces that are making endless sacrifices for our country,” he said in a statement.",
            "(With additional input from agencies)"
        ]
    },
    {
        "sr_no": 75,
        "newspaper": "Tribune",
        "headline": "PM will inaugurate monsoon plantation campaign on ‘Plant for Pakistan’ day",
        "link": "https://tribune.com.pk/story/2023465/1-pm-will-inaugurate-monsoon-plantation-campaign-plant-pakistan-day/",
        "brief": "",
        "date": "July 28, 2019",
        "detailed_news": [
            "ISLAMABAD: The federal government has set a target of planting 140 million saplings across the country during a campaign which will be inaugurated by the prime minister in the first week of the August.",
            "The monsoon plantation drive will kick off by planting a sapling on the “Plant for Pakistan” day.",
            "Around one million sapling will be planted on the first day for which a ceremony to inaugurate the drive will be held at 161 places.",
            "According to documents, nine million saplings will be planted in Punjab, 104 million in Khyber-Pakhtunkhwa, 15 million in Sindh, 1.2 million in Balochistan, 3.3 million in Gilgit-Baltistan, seven million in Azad Kashmir and 0.5 million in Islamabad.",
            "On the first day of the campaign, one million saplings will be planted — 224,000 of them in Punjab, 600,000 in Sindh, 70,000 in K-P, 10,000 in Balochistan, 5,000 in Gilgit-Baltistan and 3,000 in Islamabad.",
            "Punjab Forest Department Deputy Director Mohammad Salim Malik said school students, college students, members of non-governmental organisations and citizens from every corner of life will participate in planting saplings in their respective areas.",
            "“Saplings will be planted in various parks including Jallo Park, Karol Jungle and Changa Manga Forest and their surrounding areas. Similarly, over 343,000 saplings will be planted on August 8 and 9 under the campaign name of Plant for Punjab.”",
            "The forest department will also provide 0.3 million plants to the Pakistan Army as part of Sarsabz-o-Shadab Pakistan programme. An official of the department told The Express Tribune that citizens can get plants at an affordable price from nurseries of the forest department.",
            "Three-month tree plantation drive begins",
            "Earlier this year, the Ministry of Climate Change planted around 95.4 million saplings across the country under the “Plant for Pakistan” programme.",
            "A target of planting 141,600,000 saplings during the spring season was set across the country. The target was set at 12 million saplings in Punjab, 13 million, 10 million in K-P, 1.2 million in Balochistan, 4.8 million in AJK and seven million in G-B as well as 500,000 each by the Capital Development Authority, the National Highway Authority and the Defence Ministry along with 20,000 by the Pakistan Aeronautical Complex.",
            "The ministry had recovered some 2,500 acres occupied public land in Baluki where the Prime Minister Imran Khan had kicked-off the campaign on February 9 at the beginning of spring season while the ministry had exceeded its target on the given day by planting more than five million saplings.",
            "All hospitals, dispensaries, farmhouses and agricultural farmhouses across the country took part in the drive on February 14 while the civil aviation department and the jail departments planted saplings on February 15. The educational institutions including school, colleges and universities participated in the campaign on February 15."
        ]
    },
    {
        "sr_no": 81,
        "newspaper": "Tribune",
        "headline": "Pakistan, Turkey naval special forces complete joint exercise",
        "link": "https://tribune.com.pk/story/2023366/1-pakistan-turkey-naval-special-forces-complete-joint-exercise/",
        "brief": "",
        "date": "July 28, 2019",
        "detailed_news": [
            "KARACHI: Pakistan Navy Special Services Group (SSGN) and Turkish Navy Special Forces, Su Alti Taarruz (SAT), successfully completed a joint exercise, AYYILDIZ-2019, in Karachi on Sunday.",
            "The exercise included training in anti-terrorism, hostage rescue, counter-terrorism in the maritime domain, and intelligence-based operations.",
            "The 12-day exercise was aimed at strengthening military relations, inter-operability and to exchange professional expertise of the special forces.",
            "This was the 12th exercise in the AYYILDIZ series, which is an annual feature between Pakistan and Turkey and reflects the strong bilateral military ties between the two countries.",
            "Russia, Pakistan military to hold joint drills",
            "Islamabad and Ankara have also collaborated on various defence forums and taken part in multilateral exercises.",
            "Pakistan will also soon participate in joint drills with Russia. Moscow recently announced that ‘Friendship-2019’ will be held in Russia in early October.",
            "“The joint exercise will be held with the aim of exchanging experience between military personnel, developing and strengthening military-technical cooperation between the two countries,” the Russian defence ministry said in a statement.",
            "Mixed special-purpose groups consisting of Russian and Pakistani military personnel will perform combat training tasks using Russian armament, it said.",
            "The drills will be held at the Molkino training range in the southern Russian Krasnodar region and will involve about 50 Russian servicemen from special forces units.",
            " "
        ]
    },
    {
        "sr_no": 96,
        "newspaper": "State Times",
        "headline": "RAW officer Johri appointed as new BSF DG",
        "link": "http://news.statetimes.in/raw-officer-johri-appointed-as-new-bsf-dg/",
        "brief": "",
        "date": "Sun, 28 Jul 2019 19:56:44 +0000",
        "detailed_news": "STATE TIMES NEWS New Delhi: IPS officer V K Johri has been appointed as the next Director General (DG) of country&#8217;s largest border guarding force, BSF, an official order said on Sunday. The order has been issued by the Appointments Committee of the Cabinet (ACC) that is headed by Prime Minister Narendra Modi and has [&#8230;]"
    },
    {
        "sr_no": 113,
        "newspaper": "The News",
        "headline": "Ten Pak soldiers martyred in two terror incidents",
        "link": "https://www.thenews.com.pk/print/504602-ten-pak-soldiers-martyred-in-two-terror-incidents",
        "brief": "",
        "date": "Sun, 28 Jul 2019 00:00:00 +0500",
        "detailed_news": "RAWALPINDI: Ten personnel of Pakistan security forces were martyred in two separate terrorist incidents &ndash; the first incident happened on Pak-Afghan border in North Waziristan where six soldiers embraced martyrdom in a cross border attack, while four other security men embraced martyrdom in a combing operation in Balochistan, the Inter-Services Public Relations (ISPR) said, here on Saturday.According to the Pakistan military&rsquo;s media wing, terrorists from across the border targeted a border patrolling party of Pakistan Army near Gurbaz, North Waziristan. The attack left six soldiers &mdash; Havaldar Khalid, Sepoy Naveed, Sepoy Bachal, Sepoy Ali Raza, Sepoy M Babar and Sepoy Ahsan &mdash; martyred.Separately, terrorists fired upon the troops of FC Balochistan during a combing operation between Hushab and Turbat in Balochistan. Four personnel, including an officer, embraced martyrdom. The martyrs are Captain Aqib, Sepoy Nadir, Sepoy Atif Altaf and Sepoy Hafeezullah.Offering his condolences, Prime Minister Imran Khan tweeted: &ldquo;I salute our armed forces personnel, who continue to lay down their lives fighting terrorists to keep the nation safe.&rdquo;While Chief of Army Staff (COAS) Gen Qamar Javed Bajwa said the defence and security of motherland shall be ensured &ldquo;at the cost of our sweat & blood&rdquo;, as he urged the world community to facilitate regional peace, according to a statement tweeted by the DG ISPR.The Army chief stated: &ldquo;Salute to martyrs & families. We shall ensure defence & security of motherland at the cost of our sweat & blood. These are dying efforts of frustrated inimical forces while Pakistan moves from stability to enduring peace. It&rsquo;s time for the world to facilitate regional peace.&rdquo;Reacting to the terrorism incidents, ISPR Director General Maj-Gen Asif Ghafoor tweeted that Shahadat (martyrdom) of six soldiers on Pak-Afghan border and four in Balochistan was the sacrifice Pakistan was making for peace in the region. He said while security of tribal areas had been improved with efforts, now focus was on solidifying border. Maj-Gen Ghafoor said inimical forces were attempting to destabilise Balochistan but their efforts shall Insha Allah fail."
    },
    {
        "sr_no": 121,
        "newspaper": "The News",
        "headline": "Three killed in Taliban attack on Afghan police base",
        "link": "https://www.thenews.com.pk/print/504610-three-killed-in-taliban-attack-on-afghan-police-base",
        "brief": "",
        "date": "Sun, 28 Jul 2019 00:00:00 +0500",
        "detailed_news": "GHAZNI: At least three police officers were killed and a dozen more wounded on Saturday when a Taliban suicide bomber drove an explosives-packed, US-made armoured vehicle into a compound in eastern Afghanistan, officials said.The pre-dawn blast took place as violence rages across Afghanistan, even though the US is leading a push for a peace deal with the Taliban, with a new round of talks expected in the coming days. According to Aref Noori, the spokesman for Ghazni province, Saturday&rsquo;s attack targeted the police headquarters compound in Ghazni&rsquo;s Ab Band district.&ldquo;A Humvee vehicle was driven into the compound and blown up. Three police officers have been killed and 12 wounded,&rdquo; he told AFP, adding the vehicle had been captured from Afghan forces. Ahmad Khan Sirat, the provincial police spokesman, told AFP the police headquarters building had also been partially damaged in the attack, which was claimed by the Taliban.The attack came hours after another Taliban assault in Ghazni province late on Friday, this time in Khogyani district, which left at least three security forces dead including the district police chief, Noori said.The Taliban have increased their attacks across the country at the peak of their &ldquo;fighting season&rdquo;. The US, too, has stepped up air strikes this year. The bombings come as Zalmay Khalilzad, the US special envoy for peace in Afghanistan, is expected to resume a new round of talks with the Taliban in Doha."
    },
    {
        "sr_no": 123,
        "newspaper": "The News",
        "headline": "10 soldiers lay down lives for regional peace",
        "link": "https://www.thenews.com.pk/print/504636-10-soldiers-lay-down-lives-for-regional-peace",
        "brief": "",
        "date": "Sun, 28 Jul 2019 00:00:00 +0500",
        "detailed_news": "MIRANSHAH: Ten Pakistan armed forces personnel were martyred in two incidents of terrorism in North Waziristan and Balochistan on Saturday.According to the Inter Services Public Relations (ISPR), six Pakistan Army personnel were martyred when terrorists from across the Pak-Afghan border opened fire on the soldiers patrolling the border Gurbaz area of North Waziristan tribal district.The martyred included Havaldar Khalid and Sepoys Bachal, Ali Raza, M Babar, Naveed, and Ahsan, the ISPR said in a statementIn the second incident, four Frontier Corps personnel, including an officer, were martyred when terrorists opened fire on them near Turbat.According to the ISPR, the attack took place when the FC Balochistan troops were carrying out a combing and sensitisation operation between Hushab and Turbat area.The four martyred personnel include Captain Aaqib Javed and Sepoys Nadir, Atif Altaf and Hafeezullah.Prime Minister Imran Khan paid tributes to the martyred soldiers in a tweet.\"I salute our armed forces personnel, who continue to lay down their lives fighting terrorists to keep the nation safe. My condolences & prayers go to the families of the 10 brave soldiers, including an officer, martyred fighting terrorists in North Waziristan & Balochistan today,\" he wrote.Chief of the Army Staff (COAS) General Qamar Javed Bajwa termed the attacks \"dying efforts of frustrated inimical forces while Pakistan moves from stability to enduring peace. \"We shall ensure defence and security of [the] motherland at the cost of our sweat and blood,\" a tweet shared by the DG ISPR quoted him as saying.Gen Bajwa also said it was \"time for the world to facilitate regional peace\".The Tehreek Taliban Pakistan (TTP) claimed responsibility for the North Waziristan attack. There was no claim for the Balochistan attack.Meanwhile, condemnation poured in from the country&rsquo;s political circles following the martyrdom of 10 security forces personnel, including a captain, in two incidents of terrorism in North Waziristan and Balochistan.President Dr Arif Alvi strongly condemned the terrorist attacks. In a condolence message, the president paid rich tributes to those who embraced martyrdom in these incidents and said the sacrifices of armed forces for the defence of the motherland will be remembered forever.Special Assistant to the Prime Minister on Information and Broadcasting Dr. Firdous Ashiq Awan strongly condemned the terrorist attacks on the army personnel in North Waziristan from across the border and on FC personnel in Balochistan.&ldquo;The enemies of Pakistan&rsquo;s prosperity and peace will not go unpunished. Enemies are unable to digest Pakistan&rsquo;s appreciation in the world,&rdquo; she said in a tweet.She said those who had laid down their lives for the defence of Pakistan and the nation&rsquo;s security were pride of the nation and their supreme sacrifices would not go waste.Dr. Awan acknowledged the fact that the martyrs had fulfilled their obligation by laying down their lives for the country. She sympathized with the families of martyrs and prayed for their departed souls.Pakistan People&rsquo;s Party Parliamentarians (PPPP) President Asif Ali Zardari condemned the incident and expressed his profound grief and sorrow over the loss of lives of brave soldiers in the terror attacks.Zardari said if the National Action Plan was fully implemented, then nurseries of terror could have been eliminated. &ldquo;The nation salutes brave martyred soldiers and will never forget their sacrifices. The PPP and Bhutto family are with the victim families in this hour of grief,&rdquo; he said.He prayed to Almighty Allah for grant of eternal peace to the departed souls and strength and fortitude for the bereaved families to bear these irreparable losses with equanimity.Chairman Senate Muhammad Sadiq Sanjrani and Deputy Chairman Salim Mandviwala also strongly condemned the terrorist attacks, terming them cowardly acts. In separate statements, they said the nation stood united with its military to deal with terrorism.Sanjrani emphasized that the Afghan government would have to take measures to stop such terrorist assaults from its soil inside Pakistan.They said the enemies would not succeed in their nefarious designs against Pakistan and would face humiliation and defeat.Pakistan Tehreek-e-Insaf (PTI) leaders strongly condemned the terrorist attacks and expressed sympathies with the bereaved families of martyrs.In a statement, PTI Chief Organiser Saifullah Khan Nyazee strongly condemned the terrorist attacks and expressed grief over the loss of precious lives. &ldquo;Salute to the Pak Army officers and Jawans, who laid down their lives for their motherland in a cowardly attack in North Waziristan by the agencies of our enemies,&rdquo; he said.He said Afghanistan must ensure their land was not used in attacks against Pakistan or else we will take matters in our own hands.In a separate statement, Central Secretary General PTI Amir Mehmood Kiyani also condemned the attack and paid rich tributes to the martyrs of Pakistan Army. &ldquo;May Allah Almighty bestow the departed souls with highest ranks in Jannah,&rdquo; he prayed.Central Secretary Information Ahmed Jawad expressed heartfelt grief over the terror attack on the armed forces stating that these cowardly acts will not deter us from our resolve for peace.&ldquo;We have defeated terrorism with courage, commitment and faith,&rdquo; he remarked, adding that our brave armed forces will not let this scourge rise ever again. He expressed sympathies with the bereaved families and prayed for the departed souls."
    }
]