[
    {
        "sr_no": 3,
        "newspaper": "kashmir Times",
        "headline": "Civilian injured in Pak shelling in Poonch",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92933",
        "brief": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the se...",
        "date": "7/24/2019 3:07:43 PM",
        "detailed_news": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the second consecutive day on Tuesday.One civilian sustained minor injuries during ceasefire at 20.00 hours. The injured has been identified as Sher Mohd, 45, son of Mohammed Muneer resident of Mohalla  Bahchari Baloni.Defense PRO Lt Col Devender Anand, while confirming ceasefire violation by Pakistan, said, “This afternoon Pakistani army violated ceasefire in Dalhan sector of Poonch district. Indian army retaliated with equal caliber.”“Later Pakistan violated the ceasefire in Krishna Ghati, Mankote & Mendhar sectors of Poonch district. Pak initiated unprovoked ceasefire violation at around 1220 hours along LoC with firing of small arms in Poonch sector. Indian army befittingly retaliated the cross-border firing by the Pakistani army,’ he added.Local army sources said this afternoon at about 12.20 PM, Pakistani army opened indiscriminate fire towards Indian forward posts and civilian areas in Dalhan sector in Haveli. “Heavy mortar shelling was witnessed during ceasefire violation which was retaliated by India in equal measure. Both sides exchanged heavy gun fire and mortar shelling in the area,” Mohammed Sadiq, a local said. “In Pak shelling, two houses in our village were partially damaged. A number of forward LoC locations remained affected due to shelling and civilians were forced to remain inside their houses. The exchange of fire stopped at around 2.55 PM,” he added.Later this afternoon at around 3.25 PM, Pakistani army initiated unprovoked firing and shelling along the LoC in Krishna Ghati, Mankote sectors of Mendhar tehsil of Poonch district. Indian side too retaliated effectively and strongly.This was the third such violation in the past four days which left an army jawan dead and a civilian injured, the officials said. On Monday, Rifleman Mohammad Arif Shafi Alam Khan Pathan was killed in unprovoked firing by Pakistani troops in Sunderbani sector of Rajouri district.A civilian was injured in Pakistani firing in Balnoi village along the LoC in Mendhar sector of Poonch district on Saturday."
    },
    {
        "sr_no": 4,
        "newspaper": "kashmir Times",
        "headline": "Teenager shoots herself to death in Reasi",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92912",
        "brief": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. \r\nPolice stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at p...",
        "date": "7/24/2019 1:04:04 PM",
        "detailed_news": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. Police stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at present staying at Mamankote in the house of her maternal uncle Chamail Singh, son of Punjab Singh, who is serving in Indian army and presently posted in Haryana. “This evening she shot herself with her maternal uncle’s 12 bore rifle and died on spot. A case in this regard registered at Police Station Chassana and police started investigation to find the cause behind this extreme step,” police added."
    },
    {
        "sr_no": 6,
        "newspaper": "kashmir Times",
        "headline": "Rifleman killed in Pak firing in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92909",
        "brief": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.\r\nPRO Defence Lt Col Devender Anand, while confir...",
        "date": "7/24/2019 1:02:45 PM",
        "detailed_news": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.PRO Defence Lt Col Devender Anand, while confirming the ceasefire violation by neighbouring nation and death of a soldier, said, “Pakistan resorted to unprovoked ceasefire violation on the Line of Control (LoC). It resorted to mortar shelling and firing of small arms in the Sunderbani sector in the early hours. In the incident, Rifleman Mohammed Atif Shafi Alam Khan Pathan was critically injured. Rifleman was air evacuated to army hospital, where he succumbed to the injuries.”  “Indian troops responded strongly and inflicted heavy damage to Pakistan army posts and casualties to Pakistan soldiers in retaliation. However, the details of the damage on the Pakistan side are yet to be ascertained,” he added.“Rifleman Pathan, a young soldier, belonged to village Nawayard, tehsil Fatehganj district Vadodara, Gujarat and is survived by his parents, father Shafi Alam Khan Pathan and mother Habiban Banu. Rifleman Mohammed Atif Shafi Alam Khan Pathan was a brave, highly motivated and sincere soldier. The nation will always remain indebted to him for the supreme sacrifice and devotion to duty,” Defence spokesperson Lt Col Anand said.A police official said the cross-border firing started around 6.30 AM and continued intermittently for several hours, causing panic among the border residents who were advised to take necessary precautionary measures for their safety. This was the second ceasefire violation by Pakistan along the LoC in Jammu region in last three days.On Saturday, during the visit of Defence Minister Rajnath Singh to different parts of the state, Pakistani troops targeted Mendhar sector of Poonch district causing bullet injuries to a civilian in Balnoi village."
    },
    {
        "sr_no": 17,
        "newspaper": "kashmir Times",
        "headline": "Onus, now, on separatists: Rajnath",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92827",
        "brief": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.\r\nHis assertion came with a reminder that he had al...",
        "date": "7/21/2019 12:48:14 PM",
        "detailed_news": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.His assertion came with a reminder that he had already made exhaustive efforts to bring them to dialogue table as the Home Minister of the country, (in first tenure of Modi-government). Now it’s for them (separatists) to act to make things move - whatever way, he plainly told when queried about stand-off on the need of political initiative in Kashmir after effectively containing militancy in the Valley, as claimed by the government. The Defence Minister was speaking to media persons after inaugurating the 1000-meter long Ujh bridge along the International Border (IB) in Kathua district. “What stand-off..? There’s no stand-off. Jitni Pehl Iss Desh Key Griha-Mantri Ko Karni Chahiye Thi Utni Pehl To Maine Pehle Kardi… Ab Uskay Baad Woh Faisla Karengay Key Kya Karna Hai.. (The efforts and initiatives, expected from the Home Minister of this country, have already been exhausted by me in my tenure as the Union Home Minister… Now it is for them to take a call as what they want to do…),” he said.  Responding to another query related to “Operation All–Out” in the Valley to weed-out terrorism, Rajnath said that day was not far off to achieve that mark. “There are no two opinions about it that the Kashmir will get rid of terrorism very soon. Rest assured….it’s going to happen very soon. More so, I believe- as in case of any act of terror occurring anywhere in the world, the way the international community is rallying around on one platform, joining hands to take on this threat, it (terrorism) will be wiped out of - not only Kashmir, Jammu ...but the entire world,” he said.What was that challenge which was main obstacle in resolving Kashmir, in the Defence Minister’s opinion as he had earlier served as the Union Home Minister also? Faced with this query, Rajnath said, “There’s no need to analyse that challenge here. Whatever be the challenge, it will be tackled. We very well know all the reasons, we’ll sort them out and J&K will be rid of terrorism, for sure.”   In response to queries related to recurrent ceasefire violations by Pakistan on IB and LoC, even on the day of his visit to J&K today and the probability of another Kargil-like misadventure by the neighbouring nation (Pak), his terse reply was, “This message is for all the countrymen- Have faith in our country’s leadership - the Prime Minister Narendra Modi and the valiant jawans and officers of our armed forces. They will not let down your faith in them.”Earlier he said, “I’ve just returned from Kargil. Accompanied by the Army Chief General Bipin Rawat and Union Minister of State in PMO Dr Jitendra Singh, I saw those majestic peaks, which were freed from the clutches of Pakistan by our valiant soldiers by laying down their lives yet not before incurring a crushing defeat to the enemy and failing its evil designs. I’ve just witnessed the testimonies to their (gallant soldiers’) valour and heroic deeds which earned India a proud victory.”Rajnath stated that the Ujh bridge, which as per Director General-Border Road Organisation’s assertion, was the longest bridge constructed by the organization anywhere in the country, would ease problems of border residents related to connectivity. “In the form of bridge, the long pending demand of border residents has been realized. The strenuous efforts of Border Road Organisation (BRO) to complete this bridge in stipulated period despite lot of problems and hostile conditions are, undoubtedly, laudable,” the Defence Minister said."
    },
    {
        "sr_no": 20,
        "newspaper": "Greater Times",
        "headline": "Two OGWs arrested in north Kashmir's Bandipora: Police",
        "link": "https://www.greaterkashmir.com/news/kashmir/two-ogws-arrested-in-north-kashmirs-bandipora-police/?utm_source=rss&utm_medium=rss&utm_campaign=two-ogws-arrested-in-north-kashmirs-bandipora-police",
        "brief": "",
        "date": "Thu, 25 Jul 2019 13:30:39 +0000",
        "detailed_news": "Two overground workers (OGWs) facilitating infiltration and providing logistic support to the militants were arrested in north Kashmir’s Bandipora district, police said on Thursday. In a statement, a spokesman said that the Bandipora police along with Army 27 RR arrested two OGWs and recovered arms and ammunition and other incriminating material from their possession. He<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/kashmir/two-ogws-arrested-in-north-kashmirs-bandipora-police/\">Read More</a>"
    },
    {
        "sr_no": 30,
        "newspaper": "Greater Times",
        "headline": "Dhoni to join his Army battalion in Kashmir from July 31-Aug 15",
        "link": "https://www.greaterkashmir.com/news/kashmir/dhoni-to-join-his-army-battalion-in-kashmir-from-july-31-aug-15/?utm_source=rss&utm_medium=rss&utm_campaign=dhoni-to-join-his-army-battalion-in-kashmir-from-july-31-aug-15",
        "brief": "",
        "date": "Thu, 25 Jul 2019 08:59:44 +0000",
        "detailed_news": "Indian cricketer Mahendra Singh Dhoni, who was awarded the honorary rank of a lieutenant colonel in 2011, will join his battalion in Jammu and Kashmir at the end of the month and carry out duties with the troops, official sources said on Thursday. Dhoni will be with the 106 Territorial Army battalion (Para) from July<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/kashmir/dhoni-to-join-his-army-battalion-in-kashmir-from-july-31-aug-15/\">Read More</a>"
    },
    {
        "sr_no": 32,
        "newspaper": "Hindustan Times",
        "headline": "Peace the best way to solve problems: Lance Havaldar Ram Kumar’s family",
        "link": "http://www.hindustantimes.com/india-news/peace-the-best-way-to-solve-problems-lance-havaldar-ram-kumar-s-family/story-5X2DXpyGY63j7S4V4ErDRP.html",
        "brief": "",
        "date": "Jul 25, 2019 23:59 IST",
        "detailed_news": [
            "‘Peace is the best way to solve the problem between India and Pakistan’",
            "BHIWANI: It was 5.30pm on a hot June day in 1999, when a jeep of the Indian Army stopped outside the house of Lance Havildar Ram Kumar at Devawas village of Bhiwani district in Haryana. The officials had come to inform the family of Kumar’s martyrdom in the ongoing war with Pakistan, in Kargil.",
            "Singh, from 18 Grenadiers, an infantry regiment of the Indian Army posted at Drass-Kargil in Jammu and Kashmir, was just 33 when he was killed in battle.",
            "Though he was just six, Kumar’s son Nagender Singh recalled the June 5 evening clearly. He was playing with friends on the street outside his home, when a bunch of army officials stepped out of the jeep. ",
            "“Someone told them that I was Havaldar Ram Kumar’s son. One of the soldiers lifted me up and asked, ‘Beta, aapki mummy kahan hain’ (Son, where is your mother?),” Singh said. His mother had received a letter from the Army that same afternoon, and she had visited her sister, who was literate, to enquire about its contents. ",
            "As Singh went off to call his mother from a neighbour’s phone, the officials informed Kumar’s father, Chaudhary Charan Singh about his son’s demise. ",
            "“Within 15 to 20 minutes, the news of my father’s death had spread in the whole village,” he said.",
            "On the intervening night of June 2/3, 18 Grenadiers launched a third assault on Tololing peak in Drass sector to evict the Pakistan army regulars who had captured the post at over 15,000 feet. Ram Kumar was injured in the shoulder and waist from gunfire. However, he inched closer to the enemy bunker and lobbed a hand grenade, killing its occupants and injuring two more.",
            "Kamla Devi, Kumar’s wife who was 33 at the time of his death and a mother of three, said the conversation with the officials that evening left a deep impression. “The army officials told me that my husband fought bravely. I asked them to tell me how brave he was, what determination he showed, and how courageous and compassionate he was. I have been narrating the same answer to my children and now, grandchildren,” she said.",
            "Soon after Kumar’s death, Kamla Devi moved to Behal village, where the government allotted her a gas agency, as compensation to families of martyrs.",
            "“It was difficult for a woman to stay in another town just a year after her husband’s death. (But at least) I sent my children to good schools.” It wasn’t easy, but Kamla Devi doesn’t regret her decision. While Singh is completing his post graduate degree in law, her other son, Devender Lamba, runs the gas agency. Her daughter, Sonu, an engineer in computer science, lives in Delhi. ",
            "Kamla Devi also received Rs 10 lakh and a flat in Delhi.",
            "“I have only one compliant. The Haryana government gives jobs to martyr’s kin, but officer’s kin get B grade while sepoy’s kin get C and D grade positions. This is not fair,” she said.",
            "Lamba said that the bloodbath between both countries should end.",
            "“In war, the soldiers will have to die from both the sides and I urged both the governments to stop this bloodbath. Peace is the best way to solve a problem. Our family had no complaints from the government. The army officials are still in our touch and I am proud about all our soldiers,” he said. ",
            "\n\n"
        ]
    },
    {
        "sr_no": 34,
        "newspaper": "Hindustan Times",
        "headline": "Kargil report: Key changes, and missed targets",
        "link": "http://www.hindustantimes.com/india-news/kargil-report-key-changes-and-missed-targets/story-VxMnfwUd1Sr9a4UJuQNfWJ.html",
        "brief": "",
        "date": "Jul 25, 2019 23:56 IST",
        "detailed_news": [
            "NEW DELHI:The complete overhaul of India’s intelligence set-up, and the creation of a younger and fitter army are among the most significant changes made by the government on the basis of recommendations of the Kargil Review Committee (KRC).",
            "A four-member committee, set up in the immediate aftermath of India’s announcement on July 26, 1999 -- 20 years ago to the date -- that the enemy had been evicted from Kargil, examined lapses that allowed the Pakistani soldiers to occupy strategic heights in India and submitted a report. ",
            "The Kargil war lasted a little over two months and led to 527 deaths on India’s side. ",
            "On the eve of the 20th anniversary of the war, experts said the creation of the Defence Intelligence Agency in 2002 and the technical intelligence gathering agency, National Technical Research Organisation (NTRO) in 2004, were some of the report’s key outcomes.",
            "The report of the committee, headed by defence analyst, the late Krishnaswamy Subrahmanyam, was tabled its report in the Parliament in February 2000. Subrahmanyam is the father of India’s current foreign minister Dr S. Jaishankar. ",
            "“Kargil was the outcome of intelligence failures. To my mind, the NTRO and the DIA are the big takeaways from the KRC recommendations implemented by the government,” said Lieutenant General DB Shekatkar (Retd), whose report on enhancing the army’s combat potential is under implementation.",
            "A Group of Ministers (GoM) on national security, formed months after the KRC report was tabled also echoed the need to strengthen the intelligence apparatus.",
            "The KRC report also highlighted the need for “a young and fit army.” ",
            "As a result, the timespan for promotions was slashed up to the rank of commanding officers (COs) or colonels and their equivalent in the air force and navy.",
            "“Now you have officers in their late 30s commanding units compared to (those aged) 44-45 (years) earlier. It’s a very significant change,” said Shekatkar.",
            "However, certain KRC recommendations, such as creating the post of a Chief of Defence Staff — the 2001 GoM also batted for this —still remain to be implemented.",
            "Successive governments have failed to build the political consensus required for CDS, a position that was meant to provide single-point military advice to the government.",
            "“The fact is that CDS will have to be a political decision on an issue on which the three services are yet to find common ground,” said former army vice chief Lieutenant General AS Lamba (Retd.).",
            "The KRC had also recommended reducing the army’s role in counter-insurgency, but that proposal has made no headway.",
            "“The intensity of engagement in the present environment in Jammu and Kashmir is such that it may take the army a lot more time to do this (to limit its role in counter-insurgency operations),”  said Lamba. ",
            "\n\n"
        ]
    },
    {
        "sr_no": 37,
        "newspaper": "Hindustan Times",
        "headline": "Opinion|Lessons Pakistan Army learnt from Kargil — and one it did not",
        "link": "http://www.hindustantimes.com/india-news/lessons-pakistan-army-learnt-from-kargil-and-one-it-did-not/story-lM47QmP6q8s8K1CcDjD1SJ.html",
        "brief": "",
        "date": "Jul 25, 2019 14:11 IST",
        "detailed_news": [
            "In July 1999, the Indian Army was engaged in a ferocious battle against overwhelming odds in the icy heights of the Kargil Sector. It was the sheer bravery of Indian soldiers that led to our success against an entrenched enemy, and it is only fitting that the victory is being celebrated on its 20th anniversary, this year.",
            "It is, of course, another matter whether the lessons of the Kargil War, so faithfully recorded in the Kargil Review Committee (KRC), have been addressed. A number of articles have been written lamenting that many recommendations of the KRC and the subsequent Group of Ministers’ report on National Security have either been ignored or only partially implemented. ",
            "Wars are never one-sided, and in our analysis of the Kargil operations, it is also essential to study the lessons that the Pakistan Army learned from this conflict. And I am deliberately referring to the Pakistan Army and not their government, because strategic decisions concerning India are firmly in the hands of Pakistani generals.",
            "The first lesson was that the Line of Control (LoC) had acquired the inviolability of an international border and that any attempt to change it by force, risked dragging Pakistan into a full-fledged war with India. The initial assumptions of the small clique of Kargil planners was that the Indian response to the intrusion would be limited and that it would force India to come to the negotiating table on the Kashmir issue. Both the assumptions were flawed, and there was massive criticism in Pakistan on the fallout of the Kargil misadventure. A Rand Corporation monograph report, titled Limited Conflicts Under the Nuclear Umbrella: Indian and Pakistani Lessons from the Kargil Crisis, quoted Shahid M. Amin, a long-serving Pakistani diplomat as articulating a “commonly held opinion” when he stated, “It is high time that the country become ruthlessly realistic about its limitations and priorities. First and foremost, Pakistan’s survival must precede everything else, including our attachment to the Kashmir cause.”",
            "Also read | Air Force better equipped now than during Kargil conflict, says Dhanoa",
            "The second lesson was a result of the first. Kargil-type operations were no longer possible but a status quo on Kashmir, which suited India, was also not acceptable to the Pakistani deep state. Under these circumstances, the Pakistan Army would have to fall back on its trusted allies — the jihadis. The violence in Kashmir peaked following the Kargil war, and the number of terrorists killed doubled in the next two years, from 1387 in 1999 to 2645 in 2001. The Op Parakram mobilisation in 2002 [the mobilisation of troops launched in the wake of the December 13, 2011 attack on the Parliament] also saw little impact on infiltration of terrorists from Pakistan. In subsequent years, the Pakistan Army has calibrated the flow of terrorists into Kashmir, but only to suit its national interest. ",
            "The third lesson was on the utility of nuclear weapons. It was a commonly accepted view in Pakistan that the fear of an outbreak of nuclear war in South Asia would bring international pressure on India — led by the United States of America — and limit its response to terror activities sponsored by Pakistan. The Pakistan Army also saw its nuclear forces as deterring India from unleashing the full weight of its conventional superiority against Pakistan. The Indian decision to limit the conflict to the Kargil sector and not cross the LoC lent credence to this viewpoint. ",
            "However, there was also an understanding in the Pakistan Army that the presence of nuclear capability did not completely rule out a conventional conflict. As India adopted (though not officially) the Cold Start Doctrine (a strategy that relied on a speedy military victory while remaining below the nuclear threshold), Pakistan also set out to refine its conventional warfighting doctrine. The Pakistan Armed Forces conducted four Azm-e-Nau joint military exercises from 2009 to 2013, after which a doctrine named New Concept of War Fighting (NCWF) was formally adopted. The NCWF is designed to blunt India’s conventional superiority by faster mobilisation and create additional reserves at all levels to absorb the initial Indian offensive. ",
            "Pakistan’s weapons procurements in the last few years have also contributed to building up its conventional capability. Walter C. Ladwig, in his 2015 study, Indian Military Modernization and Conventional Deterrence in South Asia, has pointed out that “India’s defense procurement continues to underperform, producing far less in terms of military power than its spending would suggest. Conversely, Pakistan — assisted by China and others — has prevented the emergence of sharp asymmetries in the conventional military balance and even narrowed previously existing gaps.” Today, Pakistan Army could feel reasonably confident in limiting India’s success in a short, sharp conventional conflict.",
            "The final lesson was that the nature of civil-military relations in Pakistan leads to the making of poor strategic assessments. The Kargil war was entirely planned and commenced without taking the political leadership into confidence. Retired Lieutenant General of Pakistan army, Shahid Aziz, wrote in his article Putting our Children in Line of Fire, “An unsound military plan based on invalid assumptions, launched with little preparations and in total disregard to the regional and international environment, was bound to fail.”",
            "Unfortunately, this lesson has not been learned, and the Pakistan military continues to wield enormous political influence. The political leadership of Pakistan has meekly accepted the dominant role of the army, and the judiciary has often overlooked extraconstitutional acts of the military by quoting the doctrine of necessity. This will result in a continuation of Pakistan Army’s risk-taking behaviour without fully comprehending the political and diplomatic fallout of their actions.",
            "In studying any war, perspectives of the vanquished also matter. As Sun Tzu said, “If you know yourself but not the enemy, for every victory gained you will also suffer a defeat.” Let us celebrate the 20th anniversary of the Kargil war, but also be pragmatic in recognising the limited impact it had in changing Pakistan Army’s fundamental attitudes towards India. ",
            "(Retired Lt General DS Hooda PVSM, UYSM, AVSM, VSM (bar), ADC, is the former General Officer Commanding-in-chief Northern Command, who oversaw the 2016 surgical strike response to Pakistan’s attack on Uri.)",
            "Also read | Three Rohtak friends who lost their lives in Kargil war",
            "\n\n"
        ]
    },
    {
        "sr_no": 38,
        "newspaper": "Hindustan Times",
        "headline": "The inside story: How New Delhi charted its diplomatic win in Kargil",
        "link": "http://www.hindustantimes.com/analysis/the-inside-story-how-new-delhi-charted-its-diplomatic-win-in-kargil/story-gc9b9sQYEBe0RSGMMGWvaO.html",
        "brief": "",
        "date": "Jul 24, 2019 18:57 IST",
        "detailed_news": [
            "Once the Indian political establishment, led by Prime Minister Atal Bihari Vajpayee, became aware of the extent of Pakistan’s Kargil intrusion in 1999, it resolved to end it — if possible, without enlarging the conflict. Military and diplomatic elements of national power were brought into play in flawless coordination to achieve the objective. The splendid work of India’s defence forces has attracted great attention, but not, in any substantial measure, the country’s diplomatic endeavour in that testing time.",
            "The background to India’s diplomacy during the Kargil ingress was provided by Vajpayee’s visit to Lahore in February 1999. That visit was a consequence of a political initiative on the part of Vajpayee and Pakistan Prime Minister Nawaz Sharif. The two had first met in Colombo, on the sidelines of the Saarc summit, in July 1998, and had established a good rapport. Two months later, in their meeting on the margins of the United Nations General Assembly session in New York, they approved the modalities of the Composite Dialogue, and also decided to establish the Delhi-Lahore bus service. ",
            "After he had returned to power in February 1997, Sharif made efforts to tilt the country’s civilian-military balance in the former’s favour. He threw out the army chief, General Jahangir Karamat, in 1998, and hand-picked a relatively junior mohajir (a term to describe those who migrated from India during Partition)  general, Parvez Musharraf, to succeed him. At this time Sharif’s father, the influential Mian Muhammad Sharif, made inroads among the army’s corps commanders. These were indications that the Sharifs may be able to contain the army’s role while India-Pakistan ties improved. Vajpayee’s visit strengthened this impression, despite some negative army signals prior to his visit, and some during it. Apart from Vajpayee’s statesmanlike gestures, the visit also resulted in the Lahore Declaration, the most substantial bilateral document after the Simla Agreement of 1972.",
            "As India proceeded with its response to the intrusion, there was no way of firmly knowing the extent of Sharif’s involvement in the enterprise. It had to be logically assumed that he was fully complicit because of his seeming hold over the army. Besides, incontrovertible evidence had surfaced to show that Sharif had initially applauded the Kargil venture, though his father is believed to have admonished him for betraying Vajpayee. ",
            "At this stage, India had to rupture Sharif’s relations with the army. It successfully did so with the recording of Musharraf’s conversations with Chief of General Staff, General Aziz Khan, one of Indian external intelligence agency’s great achievements, playing a crucial part. Pakistan claimed that the mujahideen, and not its regular troops, had crossed the Line of Control (LoC). It linked the intrusion to militant and terrorist actions in the Kashmir Valley. This lie was exposed. The Kargil tapes showed that Pakistani forces were the aggressors, but eventually the Pakistani claim was torn to shreds when Indian troops recovered army documents and personal effects of its soldiers from recaptured posts. The message was effectively conveyed to the international community that Pakistani regulars were directly involved.",
            "The Kargil ingress was a violation of the LoC in Jammu and Kashmir. Without conceding that its regular troops had crossed the LoC, Pakistan tried to obfuscate the issue by seeking to project that it had not taken any extraordinary step, and that both sides nibbled at the LoC from time to time. It also tried to sow further confusion, through counter allegations regarding the Indian presence in Siachen. Indian diplomats had to clarify the intricacies of the LoC to their international interlocutors. They effectively emphasised that Pakistan’s action was direct and unacceptable territorial aggression. They also stressed that no responsible nuclear weapons-possessing State had ever undertaken such provocative and dangerous action against a neighbouring nuclear weapon State. ",
            "Pakistan had hoped that the major powers would insist on an immediate ceasefire, and that would leave it in control of the Kargil posts. Indian diplomacy had to ensure that instead of doing so, these important countries, especially the United States, leaned on Pakistan to withdraw from Kargil. The US in particular had to be convinced that India meant business. The military action, where Indian soldiers took a great number of casualties, but pursued the recovery of posts with an iron will, impressed the Americans of India’s determination. This was backed by Vajpayee’s simple-but-forceful confidential message to President Bill Clinton that the Pakistani action threatened India’s northern defences, and would not be allowed to stand. ",
            "Months after India had militarily recovered some Kargil posts, through the heroism of its soldiers or where Pakistan retreated, a senior American diplomat told me that the US had told the Pakistanis early on that, in no case, would India allow Pakistan to get away with the Kargil intrusion. Clearly, diplomatic messaging coupled with military action made the required impact.",
            "Throughout the tense period from the discovery of Pakistan’s Kargil surprise to India’s success, Vajpayee remained ethereally calm and unwaveringly focused on the objective of throwing out Pakistan from Kargil. National Security Adviser Brajesh Mishra ensured that all Indian institutions worked harmoniously to achieve the national aim of defeating Pakistan in Kargil. External affairs minister Jaswant Singh led the diplomatic effort from the front. Foreign secretary K Raghunath, ever thoughtful, sharpened India’s diplomatic arguments to profile Pakistan’s irresponsibility.",
            "Pakistan foreign minister Sartaj Aziz visited Delhi in June even as the fighting was raging. He suggested a ceasefire and an examination of the Indian charge of LoC violation to the Indian leadership. Maintaining complete diplomatic courtesy, Vajpayee and Singh told Aziz that India would compel Pakistan to vacate the Kargil posts whatever be the cost, and Pakistan should see the writing on the wall. Vajpayee asked Aziz, “How did the Lahore bus reach Kargil?”",
            "Pakistan’s Kargil intrusion made no strategic sense. It was premised on the Pakistani army’s prejudice that India (read Hindus) doesn’t have the stomach for sustained and difficult military actions. Now, Pakistani analysts uniformly blame a group of generals for Kargil. The problem is that the army has not abandoned its prejudices, and is engaged in the vain pursuit of confronting India, harming Pakistan and the region.",
            "Vivek Katju is a former Indian ambassador. He was the joint secretary handling the Pakistan division, both during the Lahore Summit and the Kargil war, in the ministry of external affairs. ",
            "The views expressed are personal. ",
            "(This is the fourth of a six part series marking 20 years of the war.)",
            "\n\n"
        ]
    },
    {
        "sr_no": 43,
        "newspaper": "Hindustan Times",
        "headline": "Murdered rifleman Aurangzeb’s brothers join army, vow to avenge his death",
        "link": "http://www.hindustantimes.com/india-news/murdered-rifleman-aurangzeb-s-brothers-join-army-vow-to-avenge-his-death/story-mN6UEKzcEcXGowb84m6EVI.html",
        "brief": "",
        "date": "Jul 23, 2019 14:53 IST",
        "detailed_news": [
            "Two brothers of an Indian Army soldier, who was abducted and killed by militants last year, have joined the armed forces to “serve the nation and avenge his death”.",
            "Mohammed Tariq, 23, and Mohammed Shabbir, 21, attended an enrolment parade of 100 new recruits in the Territorial Army in Rajouri on Monday, according to a defence spokesperson.",
            "“They were enrolled into a territorial battalion on Monday and now they will undergo training at Punjab Regimental Centre,” the spokesperson said.",
            "They posed with their parents Mohammed Hanif and Raaj Begum after donning the olive green. Hanif is also a former army man. ",
            "Aurangzeb was abducted in Pulwama and later killed by armed terrorists on June 14, 2018, when he was on his way back home in Poonch to celebrate Eid with his family. He was a rifleman in the army’s 44 Rashtriya Rifles. ",
            "“Our brother gave his life for the nation and we will also follow his footsteps. We will not step back when it comes to sacrificing our lives for the nation. We will make him proud and will make Punjab regiment proud by our duty,” said Tariq.",
            "Their father Hanif, a former Jammu and Kashmir Light Infantry soldier, said he may not live to see the “day but his two sons will take revenge of their brother Aurangzeb’s killing.”",
            "“Tariq and Shabbir also want to serve the nation and protect their fellow citizens. Yes, I have lost my son Aurangzeb and death lurks a soldier but then not many have the guts to sacrifice their life for the nation,” he said while speaking to HT over the phone.",
            "“Aurangzeb was trapped and then killed by the cowards. We still miss him,” Hanif said.",
            "Hanif joined the Bharatiya Janata Party (BJP) earlier this year in the presence of Prime Minister Narendra Modi at a public rally in Vijaypur area of Samba district.",
            "Also read | Militant involved in armyman’s murder among 4 killed in Valley",
            "\n\n"
        ]
    },
    {
        "sr_no": 46,
        "newspaper": "Hindustan Times",
        "headline": "In meeting with Imran Khan, Donald Trump offers to mediate on Kashmir",
        "link": "http://www.hindustantimes.com/india-news/donald-trump-meets-imran-khan-offers-to-mediate-kashmir-issue-between-india-and-pakistan/story-iLKSpROy6Yl4nFTxoSELkM.html",
        "brief": "",
        "date": "Jul 22, 2019 23:54 IST",
        "detailed_news": [
            "US President Donald Trump has offered to help resolve the Kashmir issue between India and Pakistan in initial remarks with visiting Prime Minister Imran Khan.",
            "“If I can help, I would love to be a mediator,” Trump said on Monday at a joint appearance in the White House with Khan following up on the Pakistani Prime Minister’s request that he would like the United States to mediate to resolve the Kashmir dispute.",
            "Trump also said that when he met Prime Minister Narendra Modi recently in Osaka on the sidelines of the G-20 summit, the latter had asked him if he would like to mediate on Kashmir. ",
            "While there was no immediate reaction from the ministry of external affairs on Trump’s remarks on mediation on Kashmir, former Jammu and Kashmir chief minister and National Conference leader Omar Abdullah was quick off the block to ask if there has been an undeclared shift India’s position on Kashmir.",
            "“Is Govt of India going to call @realDonaldTrump a liar or has there been an undeclared shift in India’s position on third party involvement in #Kashmir?” he tweeted.",
            "Prime Minister Narendra Modi likely to visit the US in September for the UN general assembly meeting",
            "Trump and Khan were to hold delegation-level meetings after the opening remarks, during which Afghanistan and counter-terrorism would be the chief topics of discussion.",
            "The US President also said Pakistan was helping the United States “a lot” in Afghanistan, which is the focus of his meeting with Khan.",
            "“Pakistan’s going to help us out to extricate ourselves,” the US president said. “We’re like policemen. We’re not fighting a war. If we wanted to fight a war in Afghanistan and win it, I could win that war in a week. I just don’t want to kill 10 million people. … I have plans on Afghanistan where if I wanted to win that war, Afghanistan would be wiped off the face of the earth,” Trump said.",
            "He also spoke of the suspension of the security aid for Pakistan, which he ordered in 2018 over Islamabad’s patchy counter-terrorism measures, and said relations were better between the two countries because of that.",
            "“We paid $1.3 billion to Pakistan in aid for many years,” Trump said, “The problem was Pakistan wasn’t doing anything for us. … I ended that a year and a half ago… To be honest, I think we have a better relationship with Pakistan right now than when we were paying that money. That money can come back.”",
            "In a fact-sheet on the visit, the White House said, “Pakistan has taken some steps against terrorist groups operating within Pakistan. It is vital that Pakistan take action to shut down all groups once and for all.”",
            "Khan said in response to a question from reporters that there was no military solution to Afghanistan and he hopes the Taliban will talk to the Afghanistan government to bring peace to the country. Trump said he agreed with the Prime Minister.",
            "\n\n"
        ]
    },
    {
        "sr_no": 47,
        "newspaper": "Dawn",
        "headline": "British navy to escort UK-flagged ships in Gulf strait",
        "link": "https://www.dawn.com/news/1496156/british-navy-to-escort-uk-flagged-ships-in-gulf-strait",
        "brief": "",
        "date": "July 25, 2019",
        "detailed_news": [
            "Britain on Thursday ordered its navy to escort UK-flagged ships through the Strait of Hormuz after Iranian soldiers seized a tanker in the flashpoint entrance to the Gulf.",
            "“The Royal Navy has been tasked to accompany British-flagged ships through the Strait of Hormuz, either individually or in groups, should sufficient notice be given of their passage,” the British defence ministry said in a statement to AFP.",
            "Know more: Iranian tanker could be released ‘with guarantees’, says UK",
            "The week-long standoff over the British-flagged Stena Impero and its 23-member crew has inflamed tensions between the Islamic republic and the United Kingdom.",
            "Britain responded on Monday by proposing a European-led mission that could secure the passage of vessels through the world's busiest oil shipping lane. But France said on Thursday it was not willing to send extra military assets to the Gulf, but would share information and coordinate its currently deployed assets.",
            "Iran had earlier warned Britain that it intended to retaliate for UK marines' involvement of the seizure of its own supertanker near Gibraltar on July 4.",
            "Britain currently has the HMS Montrose warship in the Gulf and a handful of smaller naval vessels.",
            "The Montrose had tried to rush in to rescue the Stena but arrived too late to the scene.",
            "Britain has already raised its security level in the region to the highest level and advised all boats in Iranian waters not to enter the strait.",
            "Its guidance before Thursday was for ships to notify the navy and receive instructions on “the safest way to transit” into the Gulf.",
            "“It is not possible for the Royal Navy to provide escorts for every single ship,” now-former foreign secretary Jeremy Hunt told parliament on Monday.",
            "The UK department of transport had earlier advised British-registered ships not to sail through the area.",
            "Hunt told parliament that two to three UK-flagged ships pass through the strait daily. He added that the Montrose had escorted 30 merchant vessels through the strait in 17 separate transits as of Monday.",
            "The 33-kilometre (22-mile) wide passageway provides the eastern entrance and exit point into the Gulf and runs between the United Arab Emirates and Iran."
        ]
    },
    {
        "sr_no": 49,
        "newspaper": "Dawn",
        "headline": "Afghan Taliban say will visit Pakistan if formally invited: BBC report",
        "link": "https://www.dawn.com/news/1496153/afghan-taliban-say-will-visit-pakistan-if-formally-invited-bbc-report",
        "brief": "",
        "date": "Updated July 25, 2019",
        "detailed_news": [
            "The Afghan Taliban have said that they will visit Pakistan and meet Prime Minister Imran Khan if they are formally invited for a meeting by Islamabad, BBC Urdu reported on Thursday, citing an official.",
            "During his visit to the United States earlier this week, Prime Minister Imran had hinted at a possible meeting with the insurgents.",
            "He had said he hoped that in the coming days, \"we will be able to urge the Taliban to talk with the Afghan government and come to a political solution\", a point that was promptly appreciated by US President Donald Trump — who noted that Pakistan had helped in the Afghan peace talks tremendously in recent weeks.",
            "Suhail Shaheen, the spokesman for the Taliban's political office in Qatar, told the BBC via telephone that members of the group would go to Pakistan if invited by the government.",
            "\"We visit regional and neighbouring countries from time to time, so if Pakistan formally invites us we will go because Pakistan too is our neighbour and a Muslim country,\" he was quoted as saying in the report.",
            "Shaheen dismissed the idea that a meeting with Pakistani authorities would entail allegations that the militant group has Pakistan's support, saying such allegations will be levelled by \"only the people who have no other justification to fight the Taliban\".",
            "He said although they don't allow anyone to interfere in their Islamic and national interests, \"as concerned the process of establishing contact with other countries or neighbouring countries, we already have contacts with them and we want to have [the same]\".",
            "According to the BBC report, a delegation of the Afghan Taliban was set to visit Islamabad and meet the prime minister earlier in February as well, but Imran Khan had refused to meet them after the Afghan government expressed concern over the gathering. The meeting that is expected to take place in the coming days will be with the consent of the Afghan government, the report said.",
            "After completing his maiden visit to Washington earlier this week, Prime Minister Imran had taken to Twitter to assure Trump that Pakistan \"will do everything within its power\" to facilitate the process aimed at ending Afghanistan's nearly 18-year war. The world owed it to the people of Afghanistan to bring about peace after four decades of conflict, the premier had added.",
            "The Taliban spokesperson also suggested that the group would meet all Afghan parties, including the Afghan government, if the ongoing talks with foreign powers turn out to be successful. ",
            "\"We have divided the Afghan issue into two stages, one external and the other internal. The negotiations underway in the first stage have reached the concluding stage.",
            "\"If these talks turn out to be successful, then in the second stage we will hold talks with all Afghan parties, in which the Afghan government too can participate as a party,\" he told the BBC. "
        ]
    },
    {
        "sr_no": 51,
        "newspaper": "Dawn",
        "headline": "India's Dhoni to carry out army duty in Kashmir conflict",
        "link": "https://www.dawn.com/news/1496151/indias-dhoni-to-carry-out-army-duty-in-kashmir-conflict",
        "brief": "",
        "date": "July 25, 2019",
        "detailed_news": [
            "India cricket legend M.S. Dhoni is to go on a tour of duty in Indian Kashmir after skipping a tour of the West Indies with the national team to join his regiment, a military source said.",
            "The 38-year-old Dhoni, an honorary lieutenant colonel in a reserve force, will go on patrols with the 106 Para TA Battalion during his stint in the troubled region where tens of thousands have died since an insurgency erupted three decades ago.",
            "Read more: Indian selectors face questions as Dhoni opts out of WI tour",
            "“Mahendra Singh Dhoni will be deployed in Kashmir with his regiment between July 31 and August 15,” an army source told AFP on condition of anonymity.",
            "“He will be doing patrols, guard and post duties,” the source added. Dhoni is to spend two months with the military in all.",
            "Dhoni, who led India to their 2011 World Cup triumph, got into trouble during the World Cup in England for having his regiment's insignia on his wicketkeeper's gloves.",
            "When he opted out of the West Indies series, that starts August 3, speculation mounted that he may retire.",
            "The wicketkeeper-batsman gave up Test cricket in 2014 but remained India's mainstay in limited-overs and is often seen as a key aide to skipper Virat Kohli.",
            "His uneven form at the World Cup set off talk of retirement even though the country's chief selector said the board would not tell any individual when to quit.",
            "India, who lost their World Cup semi-final to New Zealand, have been grooming Rishabh Pant to take over as number one wicketkeeper.",
            "India and West Indies will play three Twenty20 internationals, three one-day matches and two Tests."
        ]
    },
    {
        "sr_no": 55,
        "newspaper": "Dawn",
        "headline": "Tunisian president, 1st democratic leader, dies at 92",
        "link": "https://www.dawn.com/news/1496147/tunisian-president-1st-democratic-leader-dies-at-92",
        "brief": "",
        "date": "July 25, 2019",
        "detailed_news": [
            "Tunisian President Beji Caid Essebsi, the North African country’s first democratically elected leader and heir to Tunisia’s founding father, has died. He was 92.",
            "Essebsi died Thursday morning at the Tunis military hospital, where he was taken the night before, an official in the president’s office told The Associated Press. The presidential Facebook page said funeral plans will be announced soon.",
            "Under Tunisia’s constitution, the president of the parliament will assume the presidency for 45 to 90 days while elections are organised.",
            "Essebsi won office in 2014 in the wake of the country’s Arab Spring uprising. He emerged from retirement to seek the presidency at age 88, presenting his centrist movement as a bulwark against rising Islamic fundamentalism and political chaos that rocked Tunisia after the people’s people’s revolt overthrew a longtime dictator and unleashed similar movements throughout the region.",
            "But Essebsi was ultimately unable to bring prosperity or lasting calm to a country shaken by economic crises compounded by sporadic terror attacks.",
            "Most of Essebsi’s political career came well before the Arab Spring. He was a symbol of Tunisia’s independence generation, though he outlived most of his peers who helped the country shake off French rule in 1956.",
            "Born November 29, 1926 when Tunisia was a French protectorate, Essebsi entered politics in the 1940s and trained as a lawyer in Paris. But his name is most associated with Tunisia’s first president, Habib Bourguiba, who built up the country and educated its people — and brooked little opposition.",
            "Essebsi proudly claimed to be Bourguiba’s disciple, and from 1965 to 1986, he held several senior roles including defense minister, foreign minister and interior minister.",
            "After Bourguiba was overthrown in a bloodless coup by Zine el-Abidine Ben Ali in 1987, Essebsi took up a quiet life as a lawyer and author, until his re-emergence after the Arab Spring.",
            "Tunisia remains a haven of political openness and relative peace compared to the strongmen elsewhere in the Arab world and the chaos reigning in Libya.",
            "But the country has gone through nine governments since the 2011 uprising, and each one has failed to resolve widespread poverty, unemployment and disillusionment with democracy. Attacks by Islamic extremists, including some trained in neighboring Libya, have killed dozens and sent foreign tourists fleeing.",
            "Threatened this year with a general strike, Essebsi acknowledged the problems he was unable to resolve.",
            "“A democracy cannot be built in eight years,” he said in January. “Tangible results need time.”",
            "Essebsi recently announced he wouldn’t run in the election scheduled for November, saying a younger person should lead the country.",
            "Concerns had been growing about his fitness for office after he was hospitalised three times in recent weeks. His office released a video of the president meeting with the defense minister Monday, and Essebsi was visibly weakened."
        ]
    },
    {
        "sr_no": 60,
        "newspaper": "Dawn",
        "headline": "Europe's record-setting heatwave to spike even higher",
        "link": "https://www.dawn.com/news/1496144/europes-record-setting-heatwave-to-spike-even-higher",
        "brief": "",
        "date": "July 25, 2019",
        "detailed_news": [
            "A dangerously intense heatwave across much of Europe is to spike even higher on Thursday after already breaking records in several countries, impacting rail traffic and sending people in search of shade and water. ",
            "Paris was expected to see the mercury soar to as much as 41 or 42 degrees Celsius, breaking a 70-year-plus record of 40.4C and turning the Unesco-listed capital into a baking urban bowl. ",
            "Britain's Met Office predicted a chance that the UK record of 38.5C, which was recorded in Faversham, Kent, in August 2004, would also be exceeded on Thursday. ",
            "On Wednesday, Belgium, Germany and the Netherlands all recorded their all-time highest temperatures. ",
            "Thursday was forecast to be the peak of Europe's latest heatwave — the second in less than a month and impetus for new focus to be given to climate change. Cooler weather with rain was expected to provide relief from Friday. ",
            "The body-sapping, leaden, shrivelling heat was posing difficulties for humans, animals and crops across the continent. ",
            "The northern third of France, including Paris, was under a red alert while the rest of the country had a yellow warning and water-use restrictions were in force. ",
            "Cyclists in the Tour de France in southern France had to puff their way over the course in well over 30C. ",
            "In the Netherlands, farmers have been leaving their cows outside to sleep, rather than bringing them in at night, while Dutch media said hundreds of pigs died when a ventilator failed at Middelharnis. ",
            "On Wednesday, the southern Dutch town of Gilze-Rijen experienced 38.8C heat, surpassing a record dating back 75 years. ",
            "Belgium registered an all-time high of 39.9C at the Kleine-Brogel military base, beating a record that dated back to June 1947. ",
            "And Germany's western town of Geilenkirche sweltered through 40.5C. ",
            "Trains in Britain and France were slowed in response to the extreme weather. ",
            "French rail operator SNCF advised travellers in the worst affected areas to delay journeys planned at the peak of the heatwave Thursday. ",
            "Thalys and Eurostar train services between Brussels, Paris and London were on Wednesday disrupted by a failure on an overhead power line, although it was not immediately clear if this was due to the heatwave. ",
            "A Eurostar train bound for London tore down part of the cable support just outside Brussels. The 600 passengers were eventually taken back to Brussels, the Belga news agency said. ",
            "Across the area affected by the unusually high heat, people tried to cool off in lakes and rivers. ",
            "In London, police were searching for three people who went missing in the River Thames after going swimming while three people have drowned in Germany since Tuesday. ",
            "France's weather office said the scorching conditions “require particular care, notably for vulnerable or exposed people” with almost the entire country under an orange-level weather alert, the second-highest level. ",
            "Paris, in particular, remains haunted by the early summer of 2003 when 15,000 deaths were blamed on the heat and the authorities were bitterly criticised for not mobilising fast enough. ",
            "“We need to take care of ourselves but above all others especially those who are alone, and be able to detect the first symptoms of heatstroke,” said Prime Minister Edouard Philippe. ",
            "Local authorities have placed restrictions on water usage in many areas due to drought-like conditions that have seen ground and river water levels fall dramatically. ",
            "This summer's second heatwave has amplified concerns in Europe that human activity is heating the planet at a dangerous rate. ",
            "The June 26-28 blast of heat in France was four degrees Celsius hotter than an equally rare June heatwave would have been in 1900, the World Weather Attribution (WWA) team said this month.",
            "One study by the Swiss Federal Institute of Technology said the deadly, weeks-long heatwave across northern Europe in 2018 would have been statistically impossible without climate change. "
        ]
    },
    {
        "sr_no": 67,
        "newspaper": "Tribune",
        "headline": "Afghan Taliban say ready to meet PM Imran",
        "link": "https://tribune.com.pk/story/2021245/1-will-visit-pakistan-pm-imran-extends-invitation-afghan-taliban/",
        "brief": "",
        "date": "July 25, 2019",
        "detailed_news": [
            "ISLAMABAD: Afghan Taliban are ready to send their delegation to Pakistan for a meeting with Prime Minister Imran Khan if Islamabad extends formal invitation, the insurgent group that has been fighting against the US and Washington backed Kabul administration since 2001 announced on Thursday.",
            "“Pakistan is our neighbouring and Muslim country. We will definitely visit Pakistan if we are given formal invitation,” Sohail Shahin, spokesperson of Taliban’s Political Office in Doha, told BBC Urdu.",
            "“Taliban representatives frequently undertake visits to neighbouring and regional countries,” the spokesperson added. The militant group is currently holding talks with the US in Doha to find a political solution to the 18 year long war.",
            "The statement from Taliban came just a day after Prime Minister Imran Khan completed a ‘successful’ visit to the US. During his three-day visit, Afghan endgame remained on top of the agenda.",
            "While the US acknowledged Pakistan’s role in facilitating the ongoing talks, the Trump administration now wants Islamabad to persuade Taliban for permanent ceasefire and intra-Afghan dialogue.",
            "Imran, before wrapping up the all-important visit to Washington, said he assured President Trump that Pakistan would do ‘whatever in its power to facilitate the Afghan peace process.’",
            "He also indicated that he would meet the Afghan Taliban to convince them for a peace deal.",
            "In February, a Taliban delegation was to visit Islamabad for a meeting with Prime Minister Imran. The visit, however, was cancelled at the last minute after reservations expressed by Afghan government.",
            "PM visit ‘reset Pak-US ties’",
            "Meanwhile, foreign office spokesperson Dr Muhammad Faisal termed the outcome of the PM’s visit to Washington as beyond Pakistan’s expectations.",
            "“The visit of Prime Minister Imran Khan has brought a new impetus in relations between Pakistan and USA. The ties between the two countries have been reset,” Faisal told reporters at the weekly briefing.",
            "He said it was indeed a “very positive and successful visit.”  Relations between Pakistan and US were stalled at least since 2015, he admitted.",
            "“I would reiterate that the intent to enhance bilateral relations between Pakistan and the US has been expressed and now the relevant mechanisms will begin functioning to work out details of implementation,” the spokesperson added.",
            "On uproar in India after President Trump’s claim that Indian PM Narendra Modi recently requested him to mediate on Kashmir dispute between Pakistan and India, the spokesperson urged India and its media to respond “maturely whenever the Jammu and Kashmir dispute is discussed”.",
            "“As you have witnessed that soon after President Trump announced to play a mediatory role, different segments of Indian media started panicking and making all sorts of allegations.",
            "“As I said earlier, the only viable solution of Jammu and Kashmir dispute is through dialogue and diplomacy and full implementation of the UN Security Council Resolutions,” Faisal said."
        ]
    },
    {
        "sr_no": 74,
        "newspaper": "Tribune",
        "headline": "PM Imran pulls off a PR coup in US",
        "link": "https://tribune.com.pk/story/2019827/1-pm-imran-pulls-off-pr-coup-us/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "ISLAMABAD: When Prime Minister Imran Khan was preparing for his maiden visit to the US after assuming office, he was unsure of what to expect given US President Donald Trump’s unpredictable nature and his diatribe against Pakistan in the past.",
            "The prime minister was advised to tread carefully as the world would be watching and any misstep could undermine the summit.",
            "Speaking at the US Institute for Peace, Imran confirmed that he was “inundated with suggestions from all quarters” about what to discuss with the US President.",
            "Even Railways Minister Sheikh Rashid, who is known for his quips, before the prime minister’s visit remarked: “Both Imran and Trump are same. God help us, I am scared.”",
            "His statement was meant to suggest that given the unpredictability of both the leaders, anything could happen.",
            "PM Imran wants Pakistan-US ties ‘based on mutual trust’",
            "Amid this backdrop, when the prime minister finally stepped inside the White House and was greeted by President Trump, the other members of the Pakistani delegation were anxious. Even Imran visibly looked more cautious.",
            "Inside the Oval Office, the two leaders sat down for a photo op and brief remarks.",
            "Trump began by saying that he was honoured to welcome to the White House one of the greatest athletes of all times and now a popular leader.",
            "The media interaction was supposed to be brief but with Trump in the driving seat, almost nothing goes as per plan. The interaction lasted over 40 minutes where Trump unexpectedly and perhaps unintentionally handed Imran and Pakistan a major PR victory.",
            "In meetings such as the one between the leaders of two estranged allies, optics always matter. What Trump said on Kashmir was not only surprising for Pakistan but also rattled India and its jingoistic media given that it had always boasted a personal bond between Prime Minister Narendra Modi and Trump. They were expecting Trump to speak Modi’s language with Imran.",
            "But contrary to India’s expectations, Trump not only praised Pakistan’s efforts for facilitating the Afghan peace talks but also offered to mediate on the Kashmir dispute.",
            "‘Trump’s a liar’ — Indian fury over US president’s Kashmir mediation offer",
            "What came as a shock to everyone was Trump’s revelation that Modi himself had recently requested him to mediate between Pakistan and India over the Kashmir issue.",
            "His statement stirred uproar in India, which was quick to reject Trump’s claim that Modi had requested mediation. The controversy echoed in the Indian parliament where the opposition sought a personal clarification from Modi despite the Indian external affairs ministry’s denial.",
            "Before the visit, everyone was expecting the issue of Afghanistan to dominate the discussions. It certainly did, but only a few had expected that Kashmir and Pakistan-India relationship would steal the limelight.",
            "It is undoubtedly a PR victory for Pakistan because India, under the Modi regime, has been working to isolate Pakistan globally for quite some time. The Indian media proudly claims that the Trump administration favours New Delhi over Islamabad.",
            "Michael Kugelman, a senior associate working on South Asia at the Washington-based Wilson Center, summed up Imran-Trump meeting in his following tweet: “At any rate, my main takeaway is that Trump’s comments here, for the most part, are exactly what Pakistan wanted to hear. An unintended PR win for Islamabad.”",
            "Imran and his team members, who went to the White House with lot of skepticism on the back of their minds, returned with an outcome that Pakistan would be pretty glad with.",
            "Imran himself had acknowledged that he and his delegation were ‘blown away’ by President Trump’s hospitality and straight talk.",
            "Nevertheless, ultimately what determines the future of Pak-US relations or Trump-Imran bonhomie is how far Islamabad will be able to deliver on two key US demands that include persuading Afghan Taliban for a permanent ceasefire and convince them for an intra-Afghan dialogue.",
            "In a tweet, Prime Minister Imran while thanking Trump for his “warm and gracious hospitality”, assured him that Pakistan would do “everything within its power to facilitate the Afghan peace process”."
        ]
    },
    {
        "sr_no": 105,
        "newspaper": "The News",
        "headline": "Gathering Taliban for parleys not easy: Imran",
        "link": "https://www.thenews.com.pk/print/503107-gathering-taliban-for-parleys-not-easy-imran",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\t\n    \n\nWASHINGTON: Prime Minister Imran Khan has assured members of the US Congress that Pakistan will continue to play its role to help achieve the shared objective of a political solution in Afghanistan.He said Pakistan was trying its level best to bring Taliban to the negotiating table and a significant achievement has been made in this regard. He, however, said it was not an easy task. He said the entire country including the army and security forces are on the same page for the common objective of peaceful solution to the Afghan conflict.At a reception hosted by the Congressional Pakistan Caucus on Tuesday, the prime minister maintained that peace in the region was vitally important for the promotion of Pakistan&rsquo;s development agenda. He said that Pakistan had extended its full support to facilitate direct talks between the US and Taliban, which had made progress. He said Pakistan was in defensive position in this war so how could the demand to &lsquo;do more&rsquo; have been made to it. He added that the past governments did not express ground realities to the US.Hours before concluding his historical trip to the United States, Imran Khan visited the Capitol Hill, and addressed a number of Congress members including Sen Gary Peters, Sen Sherrod Brown and Sen Chris Van Hollen and several members of the House Foreign Affairs Committee. He was introduced to members of the Caucus including Republican Co-Chair Rep Jim Banks (R-IN) and Democratic Co-Chair Rep Thomas Suozzi (D-NY).The prime minister also met with the Speaker of the US House of Representatives, Nancy Pelosi and House Minority Leader Kevin McCarthy also joined the event.Speaking at the reception, Imran Khan thanked the attendees for the warm welcome and said that his government was committed to rebuilding the relationship on the basis of mutual trust and mutual respect.The prime minister said that Pakistan had facilitated the Afghan peace and reconciliation process as peace and stability in Afghanistan was vital for Pakistan. While cautioning about the complicated nature of the process and possible challenges, he said that Pakistan will continue to extend all possible facilitation in the process.Extending a warm welcome, Speaker Pelosi said it was a pleasure to welcome Prime Minister of Pakistan to the US Capitol and to discuss the vital ties between &ldquo;our economies, people & nations.&rdquo;  During the meeting, views were exchanged on matters relating to the Pakistan-US relations and regional developments.The prime minister told the Speaker that through his visit to the United States, he intended to enhance better understanding and renew and reinvigorate long-standing ties between the two countries. He said that Pakistan would continue to work with the United States for building an enduring partnership and promoting regional stability.The prime minister also shared his vision of peace, progress and prosperity in South Asia. He stressed that this could be achieved through peaceful resolution of outstanding disputes and building stable and cooperative relationships.The members of Congress also appreciated Pakistan&rsquo;s invaluable contribution in the Afghan peace and reconciliation process. They appreciated the role of the Pakistani American community in the US. They presented the prime minister copy of the special resolution, which had been introduced in the Congress to welcome the prime minister&rsquo;s inaugural visit to the US and to reaffirm the continuing support and commitment to the long and enduring friendship between Pakistan and the US.Congresswoman Jackson Lee thanked the Prime Minister for visiting the Congress and expressed the hope that relations between the two countries could be deepened by enhancing exchanges between the parliamentary representatives of both sides. They were of the view that Prime Minister Khan&rsquo;s visit to the Capitol will help generate greater interest and foster better understanding of Pakistan in the US Congress.Agencies add: Prime Minister Imran Khan has said after his visit and interaction with the US leadership, the people of America will have a better understanding about Pakistan. Speaking to the US Congressmen at the Capitol Hill, he said Pakistan had always close ties with the United States and expressed the hope to get back to the relationship, which was based on truth and trust as well as mutual respect.Imran Khan expressed the hope that from now onward, relationship between the two countries would be at different level. He said unfortunately, he felt that Pakistan was not understood there, specifically in the last 15 years when the war on terror was being fought in Afghanistan and on the border of Pakistan.More than 70,000 Pakistani people died and our economy suffered billions of dollars loss in the war against terror. The prime minister said over 40 terrorist groups came to Pakistan because of the US war that it fought and its own existence was endangered by it. He said Pakistan was fighting the US war on terror while Pakistan had nothing to do with the 9/11. Al Qaida was in Afghanistan and there were no militant Taliban in Pakistan. He said it was very important that he met President Donald Trump and Secretary of State Mike Pompeo and explained to them the way forward that the relationship has to be based on mutual trust.Prime Minister Imran Khan said he would meet with the Taliban after returning to his country, as part of efforts to end the 18 years of war in Afghanistan.He said he had also spoken with Afghan President Ashraf Ghani and now, when he goes back, \"I will meet the Taliban and I will try my best to get them to talk to the Afghan government.\"Speaking at the US Institute for Peace, a bipartisan federal body, Khan said he had been contacted by the Islamist extremist Afghan Taliban \"a few months back\", after his election win in July 2018, but did not take a meeting at that time because Kabul was not in favor of it. The militants reached out to him \"because I always maintained there was no military solution\" to the war in Afghanistan, he said.\"So because of that, I had a certain amount of credibility amongst them,\" added Khan. Khan earlier Tuesday met with US Secretary of State Mike Pompeo, who emphasised the importance of working together and \"Pakistan&rsquo;s significant role in supporting the Afghan peace process and counterterrorism,\" according to a US statement.\"It&rsquo;s not going to be easy because there&rsquo;s no centralised command, it&rsquo;s a devolved movement,\" Khan cautioned about the insurgent group. \"But we feel that if we all work together, we feel this is the best chance of there to be peace in Afghanistan.\"Khan also stressed that Afghanistan&rsquo;s presidential election in September \"must be an inclusive election where the Taliban also participate\". A breakthrough could pave the way for a withdrawal of international troops about 18 years after the 9/11 attacks on the United States, which led the US to launch an offensive that dislodged the Taliban government from Kabul. \"Today, there is no concept in Pakistan of &lsquo;strategic depth&rsquo; because we feel that by interfering in Afghanistan... we have actually done a lot of damage to our own country,\" he said.At the reception, Foreign Minister Shah Mahmood Qureshi, while addressing the ceremony, said the role of Congress is vital to further fortify the ties between Pakistan and the United States. The prime minister left for home Tuesday evening after the three-day visit to Washington.Congressmen presented Imran Khan a copy of the special resolution, which had been introduced in the Congress to welcome the prime minister&rsquo;s inaugural visit to the US and to reaffirm the continuing support and commitment to the long and enduring friendship between Pakistan and the US.\n\t\t\t"
    },
    {
        "sr_no": 111,
        "newspaper": "The News",
        "headline": "COAS meets Pompeo, US military leadership",
        "link": "https://www.thenews.com.pk/print/503113-coas-meets-pompeo-us-military-leadership",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\t\n    \n\nWASHINGTON/RAWALPINDI: Chief of the Army Staff (COAS) General Qamar Bajwa visited the US State Department and met with Secretary of State Mike Pompeo, said Director General Inter-Services Public Relations (ISPR) Major General Asif Ghafoor.According to the army&rsquo;s spokesperson, during the meeting the two leaders discussed regional security issues and Afghan peace process. In the meeting, the importance of an Afghan-led process and Afghan-controlled solution were noted, according to the ISPR.In another tweet, the DG ISPR quoted the COAS as saying Pakistan attaches great importance to restoring a robust bilateral relationship based on mutual respect, trust and shared values. During his series of meetings, the COAS also met with Senator Lindsey Graham and General (retd) Jack Keane to talk about the security situation. Senator Graham recalled his visit to Pakistan, appreciating the country&rsquo;s role in improving the security dynamics, stated the DG ISPR.The army chief briefed about the improved security situation in the country resulting in opportunities for foreign businesses to invest in Pakistan. Bilateral relationship holds potential for both countries and would also assist in regional stability, said the army chief.Meanwhile, Chief of the Army Staff (COAS) General Qamar Javed Bajwa visited Pentagon, according to the official web page of Inter-Services Public Relations (ISPR) on Wednesday.On arrival, the COAS was received by Chairman Joint Chief of Staff General Joseph F Dunford. The COAS was presented a guard of honour with 21 gun salute. The COAS had a discussion session with Acting Secretary of Defence Richard V Spencer and CJCS.Regional security situation including the Afghan peace process was discussed. The secretary and CJCS acknowledged contributions of Pakistan Army in the war against terrorism and the role towards Afghan peace process.The COAS also met Chief of Staff US Army General Mark A Milley.Matters related to security and bilateral military cooperation were discussed.Later, the COAS visited the Arlington National Cemetery to pay homage to US national heroes. A special ceremony was held at the cemetery playing national anthem of both countries.&nbsp;\n\t\t\t"
    },
    {
        "sr_no": 117,
        "newspaper": "The News",
        "headline": "Pak intelligence agencies didn’t know OBL was in Pakistan: ex-CIA chief",
        "link": "https://www.thenews.com.pk/print/503119-pak-intelligence-agencies-didn-t-know-obl-was-in-pakistan-ex-cia-chief",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\t\n    \n\nISLAMABAD: Former CIA Director General David Petraeus has said that he is \"convinced\" that the Pakistani intelligence agencies did not know Osama bin Laden (OBL) was in Pakistan, countering Prime Minister Imran Khan's claims that the ISI provided a lead to the CIA that helped the US track down and kill the terror group al-Qaeda&rsquo;s chief in 2011.Imran Khan's statement on Osama bin Laden during an interview with Fox News on Monday was significant as Pakistan had so far denied that it had any information about the hideout of the al-Qaeda chief before he was killed in a covert raid by US Navy SEAL commandos in the garrison city of Abbottabad.According to media report, David Petraeus, during an interactive session at the Indian Consulate in New York City on Tuesday, asserted the US is convinced that the Pakistani intelligence was not aware that the terrorist leader was hiding in their country.\"We are quite convinced that the ISI, Pakistani intelligence, no one else knew that OBL was there in Pakistan. They were not harbouring him or hiding him or anything like that. We have very good insights on that. We probably differ with those who said that the Pakistanis were allowing him to live in that particular compound in Abbottabad,\" he said.David Petraeus said during counter-insurgency campaigns, Pakistani authorities could never close in on North Waziristan where terror outfits such as the Haqqani network, al-Qaeda and others had their headquarters.He said that the US learnt later on that OBL was not in that area but near the Pakistan Military Academy in Abbottabad.\"I figured out later that I had probably flown right over his compound in a helicopter as I went to address the cadets at the military academy one time,\" he said, referring to the Pakistan Military Academy. David Petraeus said he hopes Imran Khan will be able to deal with the challenges of his country, where the economy is &ldquo;very distorted&rdquo; and where the \"realities of the situation are really quite difficult.\"\n\t\t\t"
    },
    {
        "sr_no": 125,
        "newspaper": "The News",
        "headline": "President Alvi rejects leakage of judge’s reference contents",
        "link": "https://www.thenews.com.pk/print/503127-president-alvi-rejects-leakage-of-judge-s-reference-contents",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\tISLAMABAD: President Dr Arif Alvi on Wednesday strongly rebuffed that the contents of a reference against a judge of the Supreme Court were leaked from the Aiwan-e-Sadr as he had held thorough investigation into it.In an interview with a private TV channel he explained that he had received the reference against Justice Qazi Faez Isa, judge of the Supreme Court, moved by the Ministry of Law and Justice.To a question in that regard the President further elaborated that after receiving the reference, he had three options over its disposal. First to sit over it like those who used such things for blackmailing (threats), second for holding a media trial, and the third one to proceed in accordance with relevant laws.He said that he preferred the legal one by sending the presidential reference to the Supreme Judicial Council (SJC) under the specific laws and expressed the confidence that SJC would decide it in accordance with the law.To another question, the President credited Prime Minister Imran Khan for effectively representing Pakistan&rsquo;s stance on various issues including a peaceful resolution to the Afghan issue during his visit to the United States. He said during the prime minister&rsquo;s visit, comprehensive talks were held on the peaceful resolution of the Afghan issue. Pakistan had assured the US about making all out efforts to bring Taliban to hold dialogue for the peaceful solution of the issue, he said adding, the US wanted a peaceful exit from Afghanistan and afterward, Pakistan could assist in the rehabilitation and restructuring efforts.The president to a question said the prime minister had already reminded the world and the US particularly that war was no solution to the issues as it was easy to flare up the conflicts without any end in the sight. President Trump thought out of the box which was his quality, he added.Parting ways with the transactional ties, the prime minister rightly projected that Pakistan wanted to live among the comity of nations with dignity and self respect which also correlated with PTI&rsquo;s motive of transforming the country into modern, Islamic and welfare state.President Alvi said that he had regular interaction with the opposition parties. In response to a question, he said media had a greater role than any other organ in the country to bring about social change by highlighting the social issues. The media should show the people the difference between the good and bad. It should further enhance its role and play its effective part in the national building, he added.The president informed that he had asked Pemra to provide him ranking of those TV channels concentrating on the social issues, so that they could be awarded.To another question, he said the process for the plea bargain as envisaged under the National Accountability law must be more open and should not be reached behind the closed doors. To make his point, the president cited a decision of the Supreme Court in which it opted for an offer over land encroachment case with Malik Riaz, the property tycoon.The president also advocated women&rsquo;s inheritance rights by saying that relevant laws were not being implemented. Recommendations in that regard had been forwarded to the Islamic Ideology Council, he said, adding religious elements, media and the prayers leaders should also play their respective roles in that regard.About International Court of Justice&rsquo;s decision on convicted Indian spy Kulbhushan Jadhav, the president said that the Attorney General for Pakistan and people in the Law Ministry had the opinion that consular access should have been provided to him. The ICJ held the same which was expected.The president said being an ordinary man, he wanted promotion of new technology in Pakistan and would like to work for provision of health facilities and ensuring women&rsquo;s hereditary rights, besides making efforts aimed at catering to the needs of the special people.He opined that MQM had changed itself and only the time would prove it how much the party had reformed itself. He stressed upon televising of special programmes at the PTV for those people who were suffering from hearing impairment.The president to a query said that he and his spouse had learnt many things from Imran Khan and his wife, including their passion for the welfare work.\n\t\t\t"
    },
    {
        "sr_no": 132,
        "newspaper": "The News",
        "headline": "Rouhani suggests deal possible over seized oil tanker",
        "link": "https://www.thenews.com.pk/print/503187-rouhani-suggests-deal-possible-over-seized-oil-tanker",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\tTEHRAN: Iran&rsquo;s president has signalled a deal could be possible regarding the British-flagged tanker seized in the Strait of Hormuz.President Hassan Rouhani suggested on Wednesday that the Stena Impero vessel could be released if the UK takes similar steps to hand back an Iranian oil tanker seized by the Royal Navy off Gibraltar earlier this month.The remarks could help reduce tensions between the two countries as Boris Johnson takes over as Prime Minister. &ldquo;We do not seek the continuation of tension with some European countries,&rdquo; Rouhani said in comments carried on his website.&ldquo;Should they be committed to international frameworks and give up their wrong actions, including what they did in Gibraltar, they will receive a proportional response from Iran.&rdquo; Rouhani described the Iranian seizure of the UK-flagged Stena Impero as &ldquo;professional and brave&rdquo;.The comments came after the tanker&rsquo;s owners said the crew are safe following communications with them in Iran. The vessel was taken by Iran&rsquo;s Revolutionary Guard on Friday amid worsening relations between Tehran and the West.Stena Bulk confirmed it has had direct contact with the crew of the impounded vessel.The ship&rsquo;s master said they were all safe and there had been good cooperation with the Iranian personnel on board. Stena Bulk said the crew&rsquo;s family members were being kept updated on the latest developments and being offered the firm&rsquo;s full support. Erik Hanell, president and CEO of Stena Bulk, said: &ldquo;We do of course appreciate this step of development and that this is a first sign that we will soon see more positive progress from the Iranian authorities.&rdquo;The development came as the head of the Iranian supreme leader&rsquo;s office said the UK was sending a mediator to negotiate for the release of the vessel.&ldquo;A country that at one time appointed ministers and lawyers in Iran has reached a point where they send a mediator and plead for their ship to be freed,&rdquo; Mohammad Mohammadi-Golpayegani said, according to the semi-official Tasnim news site.UK sources insisted they were not aware of any mediator being sent to Iran, insisting that diplomatic contacts were through the ambassador and embassy in Tehran. .\n\t\t\t"
    },
    {
        "sr_no": 139,
        "newspaper": "The News",
        "headline": "Bringing Taliban to negotiating table won’t be easy: Imran",
        "link": "https://www.thenews.com.pk/print/503193-bringing-taliban-to-negotiating-table-won-t-be-easy-imran",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\tBy News DeskWASHINGTON: Prime Minister Imran Khan has said Pakistan is now trying to bring the Afghan Taliban to the negotiating table and, despite the current progress, he cautioned US members of Congress that &ldquo;it is not going to be very easy&rdquo;.Speaking at Capitol Hill where a reception was held in his honour on Tuesday, the Prime Minister said the situation in Afghanistan is &ldquo;very complicated&rdquo;, but he assured the US leadership that the Pakistan government would be trying its best as the whole country is standing behind him, the Pakistan Army, and security forces all are behind him.&ldquo;We all have the same objective, and it is exactly the same objective the US had, and which is a peaceful solution of the Afghan issue as quickly as possible,&rdquo; he said. &ldquo;We were fighting the US war of terror as Pakistan had nothing to do with the 9/11. Al-Qaeda was in Afghanistan and there were no militant Taliban in Pakistan. &ldquo;We join the US war, but unfortunately when things went wrong and when I blame my government as we did not tell the US exactly the truth on the ground, part of the reason was our government was not in control. There were 40 different militant groups operating within Pakistan,&rdquo; he said.&ldquo;So Pakistan went through this scare, so why the US expected us to &lsquo;do more&rsquo; and help the US in this war,&rdquo; he said and added that Pakistan was at that time fighting for its own existence.The Prime Minister said it was very important that he met US President Donald Trump and Secretary of State Mike Pompeo, and explained to them the way forward that the relationship had to be based on mutual trust. &ldquo;Trust me, I will be telling the truth, I will be telling the US what we can do in this peace process.&ldquo;Pakistan had always close ties with the United States and expressed the hope to get back to the relationship, which was based on truth and trust as well as mutual respect.&rdquo;\n\t\t\t"
    },
    {
        "sr_no": 141,
        "newspaper": "The News",
        "headline": "Gathering Taliban for parleys not easy: Imran",
        "link": "https://www.thenews.com.pk/print/503313-gathering-taliban-for-parleys-not-easy-imran",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\tWASHINGTON: Prime Minister Imran Khan has assured members of the US Congress that Pakistan will continue to play its role to help achieve the shared objective of a political solution in Afghanistan.He said Pakistan was trying its level best to bring Taliban to the negotiating table and a significant achievement has been made in this regard. He, however; said it was not an easy task. He said the entire country including army and security forces are on same page for a common objective of peaceful solution to the Afghan conflict. At a reception hosted by the Congressional Pakistan Caucus on Tuesday, the prime minister maintained that peace in the region was vitally important for the promotion of Pakistan&rsquo;s development agenda.He said that Pakistan had extended its full support to facilitate direct talks between the US and Taliban, which had made progress. He said Pakistan was in defensive position in this war so how could the demand to &lsquo;do more&rsquo; have been made to it. He added that the past governments did not express ground realities to the US.Hours before concluding his historical trip to the United States, Imran Khan visited the Capitol Hill, and addressed a number of Congress members including Sen Gary Peters, Sen Sherrod Brown and Sen Chris Van Hollen and several members of the House Foreign Affairs Committee. He was introduced to members of the Caucus including Republican Co-Chair Rep Jim Banks (R-IN) and Democratic Co-Chair Rep Thomas Suozzi (D-NY).The prime minister also met with the Speaker of the US House of Representatives, Nancy Pelosi and House Minority Leader Kevin McCarthy also joined the event. Speaking at the reception, Imran Khan thanked the attendees for the warm welcome and said that his government was committed to rebuild the relationship on the basis of mutual trust and mutual respect.The Prime Minister said that Pakistan had facilitated the Afghan peace and reconciliation process as peace and stability in Afghanistan was vital for Pakistan. While cautioning about the complicated nature of the process and possible challenges, he said that Pakistan will continue to extend all possible facilitation in the process.Extending a warm welcome, Speaker Pelosi said it was a pleasure to welcome Prime Minister of Pakistan to the US Capitol and to discuss the vital ties between &ldquo;our economies, people & nations.&rdquo;  During the meeting, views were exchanged on matters relating to Pakistan-US relations and regional developments.The Prime Minister told the Speaker that, through his visit to the United States, he intended to enhance better understanding and renew and reinvigorate long-standing ties between the two countries. He said that Pakistan would continue to work with the United States for building an enduring partnership and promoting regional stability.The Prime Minister also shared his vision of peace, progress and prosperity in South Asia. He stressed that this could be achieved through peaceful resolution of outstanding disputes and building stable and cooperative relationships.The members of Congress also appreciated Pakistan&rsquo;s invaluable contribution in the Afghan peace and reconciliation process. They appreciated the role of the Pakistani American community in the US. They presented the Prime Minister copy of the special resolution, which had been introduced in the Congress to welcome the Prime Minister&rsquo;s inaugural visit to the U.S. and to reaffirm the continuing support and commitment to the long and enduring friendship between Pakistan and the U.S.Congresswoman Jackson Lee thanked the Prime Minister for visiting the Congress and expressed hope that relations between the two countries could be deepened by enhancing exchanges between the parliamentary representatives of both sides. They were of the view that Prime Minister Khan&rsquo;s visit to the Capitol will help generate greater interest and foster better understanding of Pakistan in the US Congress.Agencies add: Prime Minister Imran Khan has said after his visit and interaction with the US leadership, the people of America will have better understanding about Pakistan. Speaking to the US Congressmen at the Capitol Hill, he said Pakistan had always close ties with the United States and expressed the hope to get back to the relationship, which was based on truth and trust as well as mutual respect.Imran Khan expressed the hope that from now onward relationship between the two countries would be at different level. He said unfortunately, he felt that Pakistan was not understood there, specifically in the last 15 years when the war on terror was being fought in Afghanistan and on the border of Pakistan.More than 70,000 Pakistani people died and our economy suffered billions of dollars loss in the war against terror. The Prime Minister said over 40 terrorist groups came to Pakistan because of the US war that it fought and its own existence was endangered by it. he said Pakistan was fighting the US war on terror while Pakistan had nothing to do with the 9/11. Al Qaida was in Afghanistan and there were no militant Taliban in Pakistan. He said it was very important that he met President Donald Trump and Secretary of State Mike Pompeo and explained to them the way forward that the relationship has to be based on mutual trust.Prime Minister Imran Khan said he would meet with the Taliban after returning to his country, as part of efforts to end 18 years of war in Afghanistan.He said he had also spoken with Afghan President Ashraf Ghani, and now, when he goes back, \"I will meet the Taliban and I will try my best to get them to talk to the Afghan government.\"Speaking at the US Institute for Peace, a bipartisan federal body, Khan said he had been contacted by the Islamist extremist Afghan Taliban \"a few months back\", after his election win in July 2018, but did not take a meeting at that time because Kabul was not in favor of it.The militants reached out to him \"because I always maintained there was no military solution\" to the war in Afghanistan, he said.\"So because of that, I had a certain amount of credibility amongst them,\" added Khan. Khan earlier Tuesday met with US Secretary of State Mike Pompeo, who emphasised the importance of working together and \"Pakistan&acute;s significant role in supporting the Afghan peace process and counterterrorism,\" according to a US statement.\"It&acute;s not going to be easy because there&acute;s no centralised command, it&acute;s a devolved movement,\" Khan cautioned about the insurgent group. \"But we feel that if we all work together, we feel this is the best chance of there to be peace in Afghanistan.\"Khan also stressed that Afghanistan&acute;s presidential election in September \"must be an inclusive election where the Taliban also participate\". A breakthrough could pave the way for a withdrawal of international troops about 18 years after the 9/11 attacks on the United States, which led the US to launch an offensive that dislodged the Taliban government from Kabul.\"Today, there is no concept in Pakistan of &acute;strategic depth&acute; because we feel that by interfering in Afghanistan... we have actually done a lot of damage to our own country,\" he said.At the reception, Foreign Minister Shah Mahmood Qureshi, while addressing the ceremony, said the role of congress is vital to further fortify the ties between Pakistan and the United States.The Prime Minister left for home Tuesday evening after the three-day visit to Washington.Congressmen presented Imran Khan a copy of the special resolution, which had been introduced in the Congress to welcome the prime minister&rsquo;s inaugural visit to the US and to reaffirm the continuing support and commitment to the long and enduring friendship between Pakistan and the US.\n\t\t\t"
    },
    {
        "sr_no": 144,
        "newspaper": "The News",
        "headline": "COAS meets Pompeo, US military leadership",
        "link": "https://www.thenews.com.pk/print/503316-coas-meets-pompeo-us-military-leadership",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\tWASHINGTON/RAWALPINDI: Chief of Army Staff (COAS) General Qamar Bajwa visited the US State Department and met with Secretary of State Mike Pompeo, said Director General Inter Services Public Relations (ISPR) Major General Asif Ghafoor.According to the army&rsquo;s spokesperson during the meeting the two leaders discussed regional security issues and Afghan peace process. In the meeting the importance of an Afghan-led process and Afghan-controlled solution were noted, according to the ISPR.In another tweet the DG ISPR quoted the COAS as saying Pakistan attaches great importance to restoring a robust bilateral relationship based on mutual respect trust and shared values. During his series of meetings the COAS also met with Senator Lindsay Graham and General (R) Jack Keane to talk about the security situation. Senator Graham recalled his visit to Pakistan appreciating the country&rsquo;s role in improving the security dynamics, stated the DG ISPR.The army chief briefed about the improved security situation in the country resulting in opportunities for foreign businesses to invest in Pakistan. Bilateral relationship holds potential for both countries and would also assist in regional stability, said the army chief.Meanwhile Chief of Army Staff (COAS) General Qamar Javed Bajwa visited Pentagon, according to the official web page of Inter Services Public Relations (ISPR) on Wednesday.On arrival, COAS was received by Chairman Joint Chief of Staff General Joseph F Dunford. COAS was presented guard of honour with 21 gun salute. COAS had discussion session with Acting Secretary of Defence Richard V Spencer and CJCS.Regional security situation including Afghan peace process was discussed. Secretary and CJCS acknowledged contributions of Pakistan Army in war against terrorism and role towards Afghan peace process.COAS also met Chief of Staff US Army General Mark A Milley. Matters related to security and bilateral military cooperation were discussed.Later, COAS visited Arlington National Cemetery to pay homage to US National heroes. A special ceremony was held at cemetery playing national anthem of both countries.\n\t\t\t"
    },
    {
        "sr_no": 153,
        "newspaper": "The News",
        "headline": "President Alvi rejects leakage of judge’s reference contents",
        "link": "https://www.thenews.com.pk/print/503325-president-alvi-rejects-leakage-of-judge-s-reference-contents",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\tISLAMABAD: President Dr Arif Alvi on Wednesday strongly rebuffed that the contents of a reference against a judge of the Supreme Court were leaked from the Aiwan-e-Sadr as he had held thorough investigation into it.In an interview with a private TV channel he explained that he had received the reference against Justice Qazi Faez Isa, judge of the Supreme Court, moved by the Ministry of Law and Justice.To a question in that regard the President further elaborated that after receiving the reference, he had three options over its disposal. First to sit over it like those who used such things for blackmailing (threats), second for holding a media trial, and the third one to proceed in accordance with relevant laws. He said that he preferred the legal one by sending the presidential reference to the Supreme Judicial Council (SJC) under the specific laws and expressed the confidence that SJC would decide it in accordance with the law. To another question, the President credited Prime Minister Imran Khan for effectively representing Pakistan&rsquo;s stance on various issues including a peaceful resolution to the Afghan issue during his visit to the United States. He said during the prime minister&rsquo;s visit, comprehensive talks were held on the peaceful resolution of the Afghan issue. Pakistan had assured the US about making all out efforts to bring Taliban to hold dialogue for the peaceful solution of the issue, he said adding, the US wanted a peaceful exit from Afghanistan and afterward, Pakistan could assist in the rehabilitation and restructuring efforts. The president to a question said the prime minister had already reminded the world and the US particularly that war was no solution to the issues as it was easy to flare up the conflicts without any end in the sight. President Trump thought out of the box which was his quality, he added.Parting ways with the transactional ties, the prime minister rightly projected that Pakistan wanted to live among the comity of nations with dignity and self respect which also correlated with PTI&rsquo;s motive of transforming the country into modern, Islamic and welfare state. President Alvi said that he had regular interaction with the opposition parties. In response to a question, he said media had a greater role than any other organ in the country to bring about social change by highlighting the social issues. The media should show the people the difference between the good and bad. It should further enhance its role and play its effective part in the national building, he added. The president informed that he had asked Pemra to provide him ranking of those TV channels concentrating on the social issues, so that they could be awarded.To another question, he said the process for the plea bargain as envisaged under the National Accountability law must be more open and should not be reached behind the closed doors. To make his point, the president cited a decision of the Supreme Court in which it opted for an offer over land encroachment case with Malik Riaz, the property tycoon. The president also advocated women&rsquo;s inheritance rights by saying that relevant laws were not being implemented. Recommendations in that regard had been forwarded to the Islamic Ideology Council, he said, adding religious elements, media and the prayers leaders should also play their respective roles in that regard. About International Court of Justice&rsquo;s decision on convicted Indian spy Kulbhushan Jadhav, the president said that the Attorney General for Pakistan and people in the Law Ministry had the opinion that consular access should have been provided to him. The ICJ held the same which was expected.The president said being an ordinary man, he wanted promotion of new technology in Pakistan and would like to work for provision of health facilities and ensuring women&rsquo;s hereditary rights, besides making efforts aimed at catering to the needs of the special people.He opined that MQM had changed itself and only the time would prove it how much the party had reformed itself. He stressed upon televising of special programmes at the PTV for those people who were suffering from hearing impairment.The president to a query said that he and his spouse had learnt many things from Imran Khan and his wife, including their passion for the welfare work.\n\t\t\t"
    },
    {
        "sr_no": 158,
        "newspaper": "The News",
        "headline": "Intelligence agencies didn’t know OBL was in Pakistan: ex-CIA chief",
        "link": "https://www.thenews.com.pk/print/503330-intelligence-agencies-didn-t-know-obl-was-in-pakistan-ex-cia-chief",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\tISLAMABAD: Former CIA Director General David Petraeus has said that he is \"convinced\" that the Pakistani intelligence agencies did not know Osama bin Laden (OBL) was in Pakistan, countering Prime Minister Imran Khan's claims that the ISI provided a lead to the CIA that helped the US track downContinued on page 4and kill the terror group al-Qaeda&rsquo;s chief in 2011. Imran Khan's statement on Osama bin Laden during an interview with Fox News on Monday was significant as Pakistan had so far denied that it had any information about the hideout of the al-Qaeda chief before he was killed in a covert raid by US Navy SEAL commandos in the garrison city of Abbottabad.According to media report, David Petraeus, during an interactive session at the Indian Consulate in New York City on Tuesday following his address on Indo-Pacific, asserted the US is convinced that the Pakistani intelligence was not aware that the terrorist leader was hiding in their country.\"We are quite convinced that the ISI, Pakistani intelligence, no one else knew that OBL was there in Pakistan. They were not harbouring him or hiding him or anything like that. We have very good insights on that. We probably differ with those who said that the Pakistanis were allowing him to live in that particular compound in Abbottabad,\" he said. David Petraeus said that during counter-insurgency campaigns, Pakistani authorities could never close in on North Waziristan where terror outfits such as the Haqqani network, al-Qaeda and others had their headquarters and some of their forces. He said that the US learnt later on that OBL was not in that area but near the Pakistan Military Academy (PMA) in Abbottabad. \"I figured out later that I had probably flown right over his compound in a helicopter as I went to address the cadets at the military academy one time,\" he said, referring to the PMA. David Petraeus said he hopes Imran Khan will be able to deal with the challenges of his country, where the economy is &ldquo;very distorted&rdquo; and where the \"realities of the situation are really quite difficult.\"\n\t\t\t"
    },
    {
        "sr_no": 163,
        "newspaper": "The News",
        "headline": "Gathering Taliban for parleys not easy: Imran",
        "link": "https://www.thenews.com.pk/print/503388-gathering-taliban-for-parleys-not-easy-imran",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\tWASHINGTON: Prime Minister Imran Khan has assured members of the US Congress that Pakistan will continue to play its role to help achieve the shared objective of a political solution in Afghanistan.He said Pakistan was trying its level best to bring Taliban to the negotiating table and a significant achievement has been made in this regard. He, however; said it was not an easy task. He said the entire country including army and security forces are on same page for a common objective of peaceful solution to the Afghan conflict.At a reception hosted by the Congressional Pakistan Caucus on Tuesday, the prime minister maintained that peace in the region was vitally important for the promotion of Pakistan&rsquo;s development agenda. He said that Pakistan had extended its full support to facilitate direct talks between the US and Taliban, which had made progress. He said Pakistan was in defensive position in this war so how could the demand to &lsquo;do more&rsquo; have been made to it. He added that the past governments did not express ground realities to the US.Hours before concluding his historical trip to the United States, Imran Khan visited the Capitol Hill, and addressed a number of Congress members including Sen Gary Peters, Sen Sherrod Brown and Sen Chris Van Hollen and several members of the House Foreign Affairs Committee. He was introduced to members of the Caucus including Republican Co-Chair Rep Jim Banks (R-IN) and Democratic Co-Chair Rep Thomas Suozzi (D-NY).The prime minister also met with the Speaker of the US House of Representatives, Nancy Pelosi and House Minority Leader Kevin McCarthy also joined the event.Speaking at the reception, Imran Khan thanked the attendees for the warm welcome and said that his government was committed to rebuild the relationship on the basis of mutual trust and mutual respect.The Prime Minister said that Pakistan had facilitated the Afghan peace and reconciliation process as peace and stability in Afghanistan was vital for Pakistan. While cautioning about the complicated nature of the process and possible challenges, he said that Pakistan will continue to extend all possible facilitation in the process.Extending a warm welcome, Speaker Pelosi said it was a pleasure to welcome Prime Minister of Pakistan to the US Capitol and to discuss the vital ties between &ldquo;our economies, people & nations.&rdquo; During the meeting, views were exchanged on matters relating to Pakistan-US relations and regional developments.The Prime Minister told the Speaker that, through his visit to the United States, he intended to enhance better understanding and renew and reinvigorate long-standing ties between the two countries. He said that Pakistan would continue to work with the United States for building an enduring partnership and promoting regional stability.The Prime Minister also shared his vision of peace, progress and prosperity in South Asia. He stressed that this could be achieved through peaceful resolution of outstanding disputes and building stable and cooperative relationships.The members of Congress also appreciated Pakistan&rsquo;s invaluable contribution in the Afghan peace and reconciliation process. They appreciated the role of the Pakistani American community in the US. They presented the Prime Minister copy of the special resolution, which had been introduced in the Congress to welcome the Prime Minister&rsquo;s inaugural visit to the U.S. and to reaffirm the continuing support and commitment to the long and enduring friendship between Pakistan and the U.S.Congresswoman Jackson Lee thanked the Prime Minister for visiting the Congress and expressed hope that relations between the two countries could be deepened by enhancing exchanges between the parliamentary representatives of both sides. They were of the view that Prime Minister Khan&rsquo;s visit to the Capitol will help generate greater interest and foster better understanding of Pakistan in the US Congress.Agencies add: Prime Minister Imran Khan has said after his visit and interaction with the US leadership, the people of America will have better understanding about Pakistan. Speaking to the US Congressmen at the Capitol Hill, he said Pakistan had always close ties with the United States and expressed the hope to get back to the relationship, which was based on truth and trust as well as mutual respect.Imran Khan expressed the hope that from now onward relationship between the two countries would be at different level. He said unfortunately, he felt that Pakistan was not understood there, specifically in the last 15 years when the war on terror was being fought in Afghanistan and on the border of Pakistan.More than 70,000 Pakistani people died and our economy suffered billions of dollars loss in the war against terror. The Prime Minister said over 40 terrorist groups came to Pakistan because of the US war that it fought and its own existence was endangered by it. he said Pakistan was fighting the US war on terror while Pakistan had nothing to do with the 9/11. Al Qaida was in Afghanistan and there were no militant Taliban in Pakistan. He said it was very important that he met President Donald Trump and Secretary of State Mike Pompeo and explained to them the way forward that the relationship has to be based on mutual trust.Prime Minister Imran Khan said he would meet with the Taliban after returning to his country, as part of efforts to end 18 years of war in Afghanistan.He said he had also spoken with Afghan President Ashraf Ghani, and now, when he goes back, &ldquo;I will meet the Taliban and I will try my best to get them to talk to the Afghan government.&rdquo;Speaking at the US Institute for Peace, a bipartisan federal body, Khan said he had been contacted by the Islamist extremist Afghan Taliban &ldquo;a few months back&rdquo;, after his election win in July 2018, but did not take a meeting at that time because Kabul was not in favor of it.The militants reached out to him &ldquo;because I always maintained there was no military solution&rdquo; to the war in Afghanistan, he said.&ldquo;So because of that, I had a certain amount of credibility amongst them,&rdquo; added Khan. Khan earlier Tuesday met with US Secretary of State Mike Pompeo, who emphasised the importance of working together and &ldquo;Pakistan&rsquo;s significant role in supporting the Afghan peace process and counterterrorism,&rdquo; according to a US statement.&ldquo;It&rsquo;s not going to be easy because there&rsquo;s no centralised command, it&rsquo;s a devolved movement,&rdquo; Khan cautioned about the insurgent group. &ldquo;But we feel that if we all work together, we feel this is the best chance of there to be peace in Afghanistan.&rdquo;Khan also stressed that Afghanistan&rsquo;s presidential election in September &ldquo;must be an inclusive election where the Taliban also participate&rdquo;. A breakthrough could pave the way for a withdrawal of international troops about 18 years after the 9/11 attacks on the United States, which led the US to launch an offensive that dislodged the Taliban government from Kabul.&ldquo;Today, there is no concept in Pakistan of &lsquo;strategic depth&rsquo; because we feel that by interfering in Afghanistan... we have actually done a lot of damage to our own country,&rdquo; he said.At the reception, Foreign Minister Shah Mahmood Qureshi, while addressing the ceremony, said the role of congress is vital to further fortify the ties between Pakistan and the United States.The Prime Minister left for home Tuesday evening after the three-day visit to Washington. Congressmen presented Imran Khan a copy of the special resolution, which had been introduced in the Congress to welcome the prime minister&rsquo;s inaugural visit to the US and to reaffirm the continuing support and commitment to the long and enduring friendship between Pakistan and the US.\n\t\t\t"
    },
    {
        "sr_no": 166,
        "newspaper": "The News",
        "headline": "COAS meets Pompeo, US military leadership",
        "link": "https://www.thenews.com.pk/print/503391-coas-meets-pompeo-us-military-leadership",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\tWASHINGTON/RAWALPINDI: Chief of Army Staff (COAS) General Qamar Bajwa visited the US State Department and met with Secretary of State Mike Pompeo, said Director General Inter Services Public Relations (ISPR) Major General Asif Ghafoor.According to the army&rsquo;s spokesperson during the meeting the two leaders discussed regional security issues and Afghan peace process. In the meeting the importance of an Afghan-led process and Afghan-controlled solution were noted, according to the ISPR.In another tweet the DG ISPR quoted the COAS as saying Pakistan attaches great importance to restoring a robust bilateral relationship based on mutual respect trust and shared values. During his series of meetings the COAS also met with Senator Lindsay Graham and General (R) Jack Keane to talk about the security situation. Senator Graham recalled his visit to Pakistan appreciating the country&rsquo;s role in improving the security dynamics, stated the DG ISPR.The army chief briefed about the improved security situation in the country resulting in opportunities for foreign businesses to invest in Pakistan. Bilateral relationship holds potential for both countries and would also assist in regional stability, said the army chief.Meanwhile Chief of Army Staff (COAS) General Qamar Javed Bajwa visited Pentagon, according to the official web page of Inter Services Public Relations (ISPR) on Wednesday.On arrival, COAS was received by Chairman Joint Chief of Staff General Joseph F Dunford. COAS was presented guard of honour with 21 gun salute. COAS had discussion session with Acting Secretary of Defence Richard V Spencer and CJCS.Regional security situation including Afghan peace process was discussed. Secretary and CJCS acknowledged contributions of Pakistan Army in war against terrorism and role towards Afghan peace process.COAS also met Chief of Staff US Army General Mark A Milley. Matters related to security and bilateral military cooperation were discussed. Later, COAS visited Arlington National Cemetery to pay homage to US National heroes. A special ceremony was held at cemetery playing national anthem of both countries.\n\t\t\t"
    },
    {
        "sr_no": 173,
        "newspaper": "The News",
        "headline": "President Alvi rejects leakage of judge’s reference contents",
        "link": "https://www.thenews.com.pk/print/503398-president-alvi-rejects-leakage-of-judge-s-reference-contents",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\tISLAMABAD: President Dr Arif Alvi on Wednesday strongly rebuffed that the contents of a reference against a judge of the Supreme Court were leaked from the Aiwan-e-Sadr as he had held thorough investigation into it.In an interview with a private TV channel he explained that he had received the reference against Justice Qazi Faez Isa, judge of the Supreme Court, moved by the Ministry of Law and Justice.To a question in that regard the President further elaborated that after receiving the reference, he had three options over its disposal. First to sit over it like those who used such things for blackmailing (threats), second for holding a media trial, and the third one to proceed in accordance with relevant laws. He said that he preferred the legal one by sending the presidential reference to the Supreme Judicial Council (SJC) under the specific laws and expressed the confidence that SJC would decide it in accordance with the law.To another question, the President credited Prime Minister Imran Khan for effectively representing Pakistan&rsquo;s stance on various issues including a peaceful resolution to the Afghan issue during his visit to the United States. He said during the prime minister&rsquo;s visit, comprehensive talks were held on the peaceful resolution of the Afghan issue. Pakistan had assured the US about making all out efforts to  bring Taliban to hold dialogue for the peaceful solution of the issue, he said adding, the US wanted a peaceful exit from Afghanistan and afterward, Pakistan could assist in the rehabilitation and restructuring efforts.The president to a question said the prime minister had already reminded the world and the US particularly that war was no solution to the issues as it was easy to flare up the conflicts without any end in the sight. President Trump thought out of the box which was his quality, he added.Parting ways with the transactional ties, the prime minister rightly projected that Pakistan wanted to live among the comity of nations with dignity and self respect which also correlated with PTI&rsquo;s motive of transforming the country into modern, Islamic and welfare state. during his visit to the United States. In a series of tweets, she said the prime minister during his US visit, strongly highlighted the importance of resolution of outstanding dispute.She said Shahbaz Sharif should have also learnt from the simplicity and austerity of Imran Khan instead of criticising him for riding on the buses.Dr Awan claimed the popularity of the prime minister was increasing amongst the masses despite Shahbaz Sharif&rsquo;s efforts to misguide the people out of enviousness. &ldquo;Shahbaz Sahab! You do gimmickry by walking on London roads and when return to Pakistan, you fall back on the habit of protocol,&rdquo; she contended.Meanwhile, Dr Firdous Ashiq Awan on Wednesday said that provision of rights to the people, who were entitled to them, was mission of Prime Minister Imran Khan.\n\t\t\t"
    },
    {
        "sr_no": 181,
        "newspaper": "The News",
        "headline": "Intelligence agencies didn’t know OBL was in Pakistan: ex-CIA chief",
        "link": "https://www.thenews.com.pk/print/503406-intelligence-agencies-didn-t-know-obl-was-in-pakistan-ex-cia-chief",
        "brief": "",
        "date": "Thu, 25 Jul 2019 00:00:00 +0500",
        "detailed_news": "\n\n\t\t\t\tISLAMABAD: Former CIA Director General David Petraeus has said that he is \"convinced\" that the Pakistani intelligence agencies did not know Osama bin Laden (OBL) was in Pakistan, countering Prime Minister Imran Khan's claims that the ISI provided a lead to the CIA that helped the US track down and kill the terror group al-Qaeda&rsquo;s chief in 2011.Imran Khan's statement on Osama bin Laden during an interview with Fox News on Monday was significant as Pakistan had so far denied that it had any information about the hideout of the al-Qaeda chief before he was killed in a covert raid by US Navy SEAL commandos in the garrison city of Abbottabad.According to media report, David Petraeus, during an interactive session at the Indian Consulate in New York City on Tuesday following his address on Indo-Pacific, asserted the US is convinced that the Pakistani intelligence was not aware that the terrorist leader was hiding in their country.&ldquo;We are quite convinced that the ISI, Pakistani intelligence, no one else knew that OBL was there in Pakistan. They were not harbouring him or hiding him or anything like that. We have very good insights on that. We probably differ with those who said that the Pakistanis were allowing him to live in that particular compound in Abbottabad,&rdquo; he said. David Petraeus said that during counter-insurgency campaigns, Pakistani authorities could never close in on North Waziristan where terror outfits such as the Haqqani network, al-Qaeda and others had their headquarters and some of their forces.He said that the US learnt later on that OBL was not in that area but near the Pakistan Military Academy (PMA) in Abbottabad. &ldquo;I figured out later that I had probably flown right over his compound in a helicopter as I went to address the cadets at the military academy one time,&rdquo; he said, referring to the PMA. David Petraeus said he hopes Imran Khan will be able to deal with the challenges of his country, where the economy is &ldquo;very distorted&rdquo; and where the &ldquo;realities of the situation are really quite difficult.&rdquo;\n\t\t\t"
    }
]