[
    {
        "sr_no": 11,
        "newspaper": "kashmir Times",
        "headline": "Onus, now, on separatists: Rajnath",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92827",
        "brief": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.\r\nHis assertion came with a reminder that he had al...",
        "date": "7/21/2019 12:48:14 PM",
        "detailed_news": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.His assertion came with a reminder that he had already made exhaustive efforts to bring them to dialogue table as the Home Minister of the country, (in first tenure of Modi-government). Now it’s for them (separatists) to act to make things move - whatever way, he plainly told when queried about stand-off on the need of political initiative in Kashmir after effectively containing militancy in the Valley, as claimed by the government. The Defence Minister was speaking to media persons after inaugurating the 1000-meter long Ujh bridge along the International Border (IB) in Kathua district. “What stand-off..? There’s no stand-off. Jitni Pehl Iss Desh Key Griha-Mantri Ko Karni Chahiye Thi Utni Pehl To Maine Pehle Kardi… Ab Uskay Baad Woh Faisla Karengay Key Kya Karna Hai.. (The efforts and initiatives, expected from the Home Minister of this country, have already been exhausted by me in my tenure as the Union Home Minister… Now it is for them to take a call as what they want to do…),” he said.  Responding to another query related to “Operation All–Out” in the Valley to weed-out terrorism, Rajnath said that day was not far off to achieve that mark. “There are no two opinions about it that the Kashmir will get rid of terrorism very soon. Rest assured….it’s going to happen very soon. More so, I believe- as in case of any act of terror occurring anywhere in the world, the way the international community is rallying around on one platform, joining hands to take on this threat, it (terrorism) will be wiped out of - not only Kashmir, Jammu ...but the entire world,” he said.What was that challenge which was main obstacle in resolving Kashmir, in the Defence Minister’s opinion as he had earlier served as the Union Home Minister also? Faced with this query, Rajnath said, “There’s no need to analyse that challenge here. Whatever be the challenge, it will be tackled. We very well know all the reasons, we’ll sort them out and J&K will be rid of terrorism, for sure.”   In response to queries related to recurrent ceasefire violations by Pakistan on IB and LoC, even on the day of his visit to J&K today and the probability of another Kargil-like misadventure by the neighbouring nation (Pak), his terse reply was, “This message is for all the countrymen- Have faith in our country’s leadership - the Prime Minister Narendra Modi and the valiant jawans and officers of our armed forces. They will not let down your faith in them.”Earlier he said, “I’ve just returned from Kargil. Accompanied by the Army Chief General Bipin Rawat and Union Minister of State in PMO Dr Jitendra Singh, I saw those majestic peaks, which were freed from the clutches of Pakistan by our valiant soldiers by laying down their lives yet not before incurring a crushing defeat to the enemy and failing its evil designs. I’ve just witnessed the testimonies to their (gallant soldiers’) valour and heroic deeds which earned India a proud victory.”Rajnath stated that the Ujh bridge, which as per Director General-Border Road Organisation’s assertion, was the longest bridge constructed by the organization anywhere in the country, would ease problems of border residents related to connectivity. “In the form of bridge, the long pending demand of border residents has been realized. The strenuous efforts of Border Road Organisation (BRO) to complete this bridge in stipulated period despite lot of problems and hostile conditions are, undoubtedly, laudable,” the Defence Minister said."
    },
    {
        "sr_no": 16,
        "newspaper": "kashmir Times",
        "headline": "Army pays tribute to brave-heart",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92766",
        "brief": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. \r\nToday, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid hom...",
        "date": "7/19/2019 10:28:45 AM",
        "detailed_news": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. Today, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid homage to the martyr on behalf of a proud nation.Singh was 35 years old and had joined the Army in 2002. He belonged to Village Tibba of Dhuri Tehsil in Sangrur District of Punjab and is survived by wife, a son and a daughter."
    },
    {
        "sr_no": 19,
        "newspaper": "kashmir Times",
        "headline": "Village girl turned IAF fighter pilot inspiring J&K youngsters",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92763",
        "brief": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. \r\nIn a series of motivational lectures, Thakur told s...",
        "date": "7/19/2019 10:28:04 AM",
        "detailed_news": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. In a series of motivational lectures, Thakur told students on Thursday that the decision to come to Bhadarwah to take part in the \"Sangam Youth Festival\" organised by the army changed her life forever as she decided to join the armed forces. Hailing from Billan Bowlian in Udhampur district, Thakur joined the IAF as a fighter pilot this year, one of the first few women in the country to have done so. Her motivational lectures, organised by the Rashtriya Rifles unit based at Bhadarwah, are inspiring youngsters, especially girls, in the state to make a mark in life. “I decided that I had to go for it, whatever it took. I would want every young boy and girl wanting to become a fighter pilot to dream big,” Thakur told. In her message to the students of Kendriya Vidyalaya and PG College Bhadarwah, she said, “Your dreams may seem unconquerable at the moment. But you must chase those so hard that they become reality.” Stating that a \"combination of average qualities\" in her made her unique, Thakur said, “I climbed the ladder step by step, committing some mistakes as well, but kept going as I learned it the hard way. Instead of mourning over your failures and get into self pity, you should work harder to achieve your goals.” She said being an NCC cadet helped her keep her nerves in the most difficult situations. The lectures were followed by question-answer sessions with the students. Aarushi, a Class 12 science student of Kendriya Vidyalaya, said she always thought becoming a doctor was the only option for her but Thakur''s words changed that. “I already feel like flying as joining the army is my childhood dream. I will definitely strive harder to make my dream a reality,” she said. Komal Katal (27) of Garh Bhadarwah village said, “I always wanted to join the Army but in this part of the state, I never got an opportunity to try my luck. Although I could not appear in AFCAT (Air Force Common Admission Test) because of the age bar, after attending the lecture of Jubiksha, I will work harder and give it a try to join the Territorial Army.” Besides Thakur, Commanding Officer, 4 Rashtriya Rifles Colonel D D Pandey also shared his experiences with the students. “You should be passionate about your dreams and to reach your destination, you should not hesitate and think longer to take your first step. Just start your journey today and you will definitely reach your destination,” he said."
    },
    {
        "sr_no": 42,
        "newspaper": "Greater Times",
        "headline": "Brothers of slain rifleman Aurangzeb join Indian Army",
        "link": "https://www.greaterkashmir.com/news/pir-panjal/brothers-of-slain-rifleman-aurangzen-join-indian-army/?utm_source=rss&utm_medium=rss&utm_campaign=brothers-of-slain-rifleman-aurangzen-join-indian-army",
        "brief": "Two younger brothers of Rifleman Aurangzeb, who was abducted and killed by militants in Kashmir last year, have joined the Indian Army.&#160; The duo, Mohammad Tariq and Mohammad Shabir, sons of Mohammad Hanif of Saloni, Mendhar, was recruited in the Army during an enrollment parade held here on Monday.&#160;&#160; Aurangzeb, a soldier in 4th Jammu<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/pir-panjal/brothers-of-slain-rifleman-aurangzen-join-indian-army/\">Read More</a>",
        "date": "Mon, 22 Jul 2019 20:20:29 +0000",
        "detailed_news": ""
    },
    {
        "sr_no": 46,
        "newspaper": "Hindustan Times",
        "headline": "\nMurdered rifleman Aurangzeb’s brothers join army, vow to avenge his death\n",
        "link": "http://www.hindustantimes.com/india-news/murdered-rifleman-aurangzeb-s-brothers-join-army-vow-to-avenge-his-death/story-mN6UEKzcEcXGowb84m6EVI.html",
        "brief": "",
        "date": "Jul 23, 2019 14:53 IST",
        "detailed_news": [
            "Two brothers of an Indian Army soldier, who was abducted and killed by militants last year, have joined the armed forces to “serve the nation and avenge his death”.",
            "Mohammed Tariq, 23, and Mohammed Shabbir, 21, attended an enrolment parade of 100 new recruits in the Territorial Army in Rajouri on Monday, according to a defence spokesperson.",
            "“They were enrolled into a territorial battalion on Monday and now they will undergo training at Punjab Regimental Centre,” the spokesperson said.",
            "They posed with their parents Mohammed Hanif and Raaj Begum after donning the olive green. Hanif is also a former army man. ",
            "Aurangzeb was abducted in Pulwama and later killed by armed terrorists on June 14, 2018, when he was on his way back home in Poonch to celebrate Eid with his family. He was a rifleman in the army’s 44 Rashtriya Rifles. ",
            "“Our brother gave his life for the nation and we will also follow his footsteps. We will not step back when it comes to sacrificing our lives for the nation. We will make him proud and will make Punjab regiment proud by our duty,” said Tariq.",
            "Their father Hanif, a former Jammu and Kashmir Light Infantry soldier, said he may not live to see the “day but his two sons will take revenge of their brother Aurangzeb’s killing.”",
            "“Tariq and Shabbir also want to serve the nation and protect their fellow citizens. Yes, I have lost my son Aurangzeb and death lurks a soldier but then not many have the guts to sacrifice their life for the nation,” he said while speaking to HT over the phone.",
            "“Aurangzeb was trapped and then killed by the cowards. We still miss him,” Hanif said.",
            "Hanif joined the Bharatiya Janata Party (BJP) earlier this year in the presence of Prime Minister Narendra Modi at a public rally in Vijaypur area of Samba district.",
            "Also read | Militant involved in armyman’s murder among 4 killed in Valley",
            "\n\n"
        ]
    },
    {
        "sr_no": 59,
        "newspaper": "Hindustan Times",
        "headline": "\nIndian Army responds to MS Dhoni’s request of training with Parachute regiment for 2 months - Reports\n",
        "link": "http://www.hindustantimes.com/cricket/army-chief-approves-ms-dhoni-s-request-of-training-with-parachute-regiment-for-2-months-reports/story-HUqfM3M9QLoM0ppMbcAUDI.html",
        "brief": "",
        "date": "Jul 22, 2019 13:57 IST",
        "detailed_news": [
            "Army Chief General Bipin Rawat approved former India captain MS Dhoni’s request to train with the Parachute regiment for two months, top Army sources said on Sunday. The wicket-keeper batsman had requested the Indian Army to allow him to train with a territorial army battalion of the Parachute regiment for two months. “The request has now been approved by the Indian Army Chief Gen Bipin Rawat and the honorary Lt Col would train with the Parachute regiment battalion,” top Army sources told ANI.The wicketkeeper-batsman would now train with the Parachute regiment, a part of which is expected to take place in Jammu and Kashmir, sources said.",
            "Also Read: India’s full squads for T20I, ODI and Test series against West Indies",
            "The Army, however, will not allow Dhoni, who holds an honorary post of Lieutenant Colonel in the Territorial Army, to be part of any active operation, sources mentioned.",
            "India will tour West Indies for three T20Is and as many ODIs, and two Tests which are part of World Test Championship from August 3 to September 3.",
            "Dhoni had made himself unavailable for the upcoming Windies tour.",
            "\n\n"
        ]
    },
    {
        "sr_no": 67,
        "newspaper": "Dawn",
        "headline": "Doors now open for revival of diplomatic relations between US, Pakistan: FM Qureshi\n",
        "link": "https://www.dawn.com/news/1495731/doors-now-open-for-revival-of-diplomatic-relations-between-us-pakistan-fm-qureshi",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "Minister for Foreign Affairs Shah Mahmood Qureshi on Tuesday said United States President Donald Trump has accepted an invitation to visit Pakistan extended to him by Prime Minister Imran Khan.",
            "The foreign minister was addressing a press conference in Washington after three consecutive meetings between the senior leadership of both countries.",
            "\"During this tour, the thing that I find unique is that these people have seen the US [Pakistani] community's closeness to this prime minister. You saw that there were thousands gathered in the Capital One arena. ",
            "\"Even in this very room, we have seen extremely powerful prime ministers and presidents in the past having to address empty chairs. ",
            "\"The point is, the people that came there and the love that they expressed — that was a message from overseas Pakistanis. I have never seen this kind of a show before. ",
            "\"This was a very positive message and we are very happy with it,\" Qureshi said. ",
            "According to Qureshi, the exchanges in all three sessions were frank and Pakistan's delegation was able to deliver the message they had come with, \"which was to present Pakistan's point of view, as there had been a long gap [in discussions between the two sides] as an interaction of this level had not taken place in the past five years. ",
            "\"For five years, the top leadership of the two countries had not met. Our country did not have a foreign minister and for five to six years we did not have any lobbyists appointed here — all of this led to a vacuum in the relationship between the two sides.\"",
            "Qureshi said that in an effort to further revive the relations between the two countries, a meeting with the Pak-US caucus will be held. \"The caucus, which has been dormant for a while, will be revived. I remember I had made a promise to this effect in this very room. I would like to mention Tahir Javed, who made tremendous efforts towards the caucus's revival.",
            "\"I just met with Javed, and he let me know that the number [of people in the caucus] has gone up to nearly 80 now. I can assure you that in the recent past, no Pakistani leader has had the opportunity to have this much interaction [with the US leadership] as Prime Minister Imran has had. The point of all this interaction is to put forward Pakistan's point of view. This is because the structure [of the US government] is federal in nature, so no matter what the Executive wishes, nothing can happen without the support of the legislature. ",
            "\"You also know that the [US] legislature has a high-level of ingress from India. This is evident if you look at their staff and their think tanks. Keeping this in mind, we will also try to increase our interaction over there.  ",
            "\"I have told our ambassador here that our embassy's interaction with Capital Hill should increase and be more effective than before.\"",
            "Talking about the seriousness from both countries towards rebuilding the relationship, Qureshi said: \"We cannot forget the fact that the relationship between the two countries was such that no door was being opened for us in the time of Alice Wells and Lisa Curtis. We used to ask for time [for discussions] and they were not ready to give that to us. That was the level [we were at] a few months ago, please understand that. Wasn't our stance the same at the time? Was our Foreign Office not the same at the time?",
            "\"From that, we have come this far. I am not saying that this sitting has completely changed the way things were for us. I am saying that a door that was completely shut for us ... a possibility has been created for that door to be opened. We have come here in all seriousness to rebuild this relationship. The stiffness that once existed in our relationship has been lessened. ",
            "\"You must remember that when Secretary [of State] [Mike] Pompeo visited Pakistan in August 2018 and when I reciprocated the visit in October 2018, we had said that it is our wish to reset our relationship. That's when people had said that on one hand there's the US South Asia Strategy, on the other there is this wish — it was deemed to be quite a contrast. Today we have seen a new beginning, a new chapter is being opened, we should take this positively and hope that things will get better.",
            "Speaking on the trade front, the foreign minister said: \"Interactions between two countries are heavily based on economic ties, which is why it is important that we now pay attention to economic diplomacy too — like I mentioned yesterday during my interaction with the investors.",
            "\"The world looks at economics and looks for ways to cater to its own economic needs, so we will try that we also move forward in that direction.\"",
            "When asked about US economic assistance which had been withdrawn in recent times, Qureshi said: \"The first thing that we need to see is why the [economic] programmes had stopped. It was because of the trust deficit that had been built between the two countries. ",
            "\"Now that we are making an effort to curb that deficit, we can hope that those programmes will be reinstated.\"",
            "Speaking of the FATF and the pressure being exerted on Pakistan, Qureshi said: \"The FATF's greatest focus is on money laundering. Prime Minister Imran Khan has openly said that the plight of South Asian countries lies in the fact that the elite class their takes the money that the country is making and the foreign assistance it gets and misuses it. They send their money out of the country through money laundering.",
            "\"America needs to help us out, keep a check on money laundering. Until that happens, the common man in third world countries will continue to suffer and poverty will remain on the rise there. These are words used by the prime minister himself today. He made these comments in today's sitting. This is his commitment, as far as money laundering is concerned.",
            "\"The other thing is terror financing. You all know what our stance is on that, we have paid a hefty price for it. We make very clear cut statements in this regard today. We have not come here to lie, nor have we come here to make promises that we cannot keep. There is no point in promising something that you cannot deliver on — that is what we have been doing in the past. We as a government will not promise that which we cannot deliver.",
            "\"That said, we want progress in both these things (against money laundering and terror financing). I don't know how much political will the previous governments had in these matters, but one thing is sure, the current government has a very strong will to move forward in these matters — and we have taken concrete measures in this regard. We even have told everyone about the measures we have taken. ",
            "\"However, there are limitations, but we are trying to get past those. Earlier, there was neither will nor capacity in this regard — now there is will and capacity is being built, so we believe there will be progress in this regard.\"",
            "Speaking of India's reaction to President Trump's offer to mediate between Pakistan and India over Kashmir, Qureshi said:",
            "\"Of course India has reacted this way, what else can we expect? They are hardly going to blow trumpets on the offer. India has always reacted this way, they do not want any sort of interference on the Kashmir matter. ",
            "\"They always say that they want bilateral talks on Kashmir, then they never come to the table for these talks. They do not want mediation and they do not want bilateral talks. ",
            "\"Pakistan's stance on the matter is very simple: we want peace, we want peace efforts, we believe that the only solution to the problem is through talks.\"",
            "Speaking of the current situation in Afghanistan and Pakistan's efforts to restore peace in its own tribal areas, Qureshi said:",
            "\"We all saw that right before the current [Pakistan] government elected, a new US policy was announced and in it, Pakistan was primarily blamed for the situation in Afghanistan. Our point of view is completely opposite to that. ",
            "\"We believe that the reasons for the Afghan situation are manifold. The internal situation within Pakistan plays a great role in their regional situation. Furthermore, we kept saying and now the world has seen that Pakistan has made huge efforts on our side of the border and cleansed our own areas. We have restored peace there and started reconstruction there, because of which, a number of people that had to repatriate from there have started returning to their homes.",
            "\"The latest example [of peace and normalcy] there is the election that took place in the tribal belt a couple of days ago. The best thing about those elections was that they were completely peaceful, no untoward incident was reported there. The second great thing about those elections was that a large number of people took part in the voting process there — including a lot of women. Thirdly, the results of those elections were accepted by everyone.\"",
            "The foreign minister also touched upon the matter of some candidates, wishing to be a part of PTI, that contested the election independently because they were not given a party ticket. \"Some candidates that have won independently wished to contest the election under the PTI banner. However, the party's committee made some decisions and was unable to provide them tickets. Those candidates then chose to contest the elections independently while saying that once they win, they would join the PTI and support it. Due to these claims, we believe that the PTI will be able to secure 10 out of the 16 seats that were contested upon. Five of those seats already belong to the PTI, the other five we will gain when the independents join us, as is their constitutional right after being notified by the election commission.\"",
            "\"The point of letting everyone know this is to show that the world and the people of the area have all witnessed and accepted these elections and appreciated the efforts the government has put into them.\"",
            "FM Qureshi's views on the matter differ from Khyber Pakhtunkhwa Chief Minister Mahmood Khan, who said that strict action will be taken against PTI members that chose to contest the election independently. ",
            "Answering a question regarding the ISI and army chiefs' presence in the tour, the foreign minister said: \"This is actually not the first time that our country's [military] leadership has been part of our discussions with the US. ",
            "\"I remember clearly, when I was the foreign minister earlier, a strategic dialogue had taken place. In that dialogue, I was present with Hillary Clinton and our chief of army staff at the time, General Kayani, had been having a discussion in the same room with the US military leadership. So this has happened before and it is not out of the ordinary\"."
        ]
    },
    {
        "sr_no": 75,
        "newspaper": "Tribune",
        "headline": "\nTrump accepts PM Imran's invitation for Pakistan visit\n",
        "link": "https://tribune.com.pk/story/2019293/1-trump-accepts-pm-imran-invitation-pakistan-visit/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "US President Donald Trump has accepted Prime Minister Imran Khan’s invitation to visit Pakistan, said the Foreign Office on Tuesday.",
            "The invitation was extended during the prime minister’s meeting with Trump on Monday – the first summit-level engagement between the two countries since 2015.",
            "President Trump welcomed the premier at the entrance of the White House. The two leaders jointly addressed the press and later had a one-on-one meeting, which was followed by delegation-level talks between the two sides.",
            "President Trump also hosted a luncheon in the Prime Minister’s honour.",
            "The two leaders held comprehensive discussions with a focus on building a broad-based and enduring partnership between Pakistan and the United States and strengthening cooperation between the two countries to bring peace, stability and economic prosperity in South Asia.",
            "The two leaders reviewed the progress of the Afghan peace and reconciliation process. President Trump appreciated Pakistan’s contribution to the peace talks and Prime Minister Imran reaffirmed Pakistan’s commitment to continue to support the process in good faith. He also added that pursuing the process was a shared responsibility.",
            "The two also affirmed their resolve to work together across a broad range of areas and acknowledged the immense opportunity and potential for mutually beneficial collaboration in diverse fields such as trade, investment, energy, economic connectivity, and defense and security cooperation. Prime Minister Imran also invited the US corporate sector to invest in Pakistan.",
            "It was decided to establish a mechanism to follow-up on the understandings reached.",
            "The prime minister also briefed the US president about his vision of the socio-economic development of Pakistan. He said that “peaceful neighborhood” was a priority of Pakistan’s foreign policy, adding that peace and stability in the region would allow Pakistan to harness its human resource potential to generate growth and spur regional connectivity.",
            "President Trump appreciated the premier’s vision for peace in South Asia.",
            "The Prime Minister said Pakistan was convinced that normalisation of relations with India would be mutually beneficial for the two countries. He underlined that Pakistan would continue to pursue dialogue and diplomacy to resolve longstanding disputes, including the core dispute of Jammu and Kashmir. President Trump expressed his readiness to play a facilitating role in resolution of the Kashmir dispute.",
            "Following the conclusion of official talks, President Trump took Prime Minister Khan and members of the delegation on a tour of the White House.",
            "Pakistan’s delegation included the Foreign Minister, Chief of Army Staff, DG (ISI), Advisors on Finance and Commerce, Special Assistant on Overseas Pakistanis, Foreign Secretary, Ambassador-at-Large on Investment and Pakistan’s Ambassador to the United States."
        ]
    },
    {
        "sr_no": 79,
        "newspaper": "Tribune",
        "headline": "Corruption crackdown ‘politically motivated’",
        "link": "https://tribune.com.pk/story/2019222/1-corruption-crackdown-politically-motivated/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "ISLAMABAD.: The Rahbar Committee of the opposition parties has termed the arrests made by the government on corruption charges as “political arrests” and decided to hold a protest outside the NAB office against the arrest of former prime minister Shahid Khaqan Abbasi.",
            "The development came during the third in-camera meeting of the Rahbar Committee presided over by Jamiat Ulema-e-Islam-Fazl’s Akram Durrani here on Monday.",
            "Briefing the media after the meeting, Durrani said targeting of political leaders, including Pakistan Muslim League-Nawaz supremo Nawaz Sharif and Pakistan Peoples Party Co-chairman Asif Zardari, was political victimisation.",
            "PML-N demands NAB chairman’s resignation",
            "He announced that the opposition would hold a protest outside the NAB office against the arrest of Abbasi.\nRahbar Committee convener Akram Durrani said, “[Prime Minister] Imran Khan promised to provide containers, but obstacles were created to stop Maryam Nawaz from holding the rally.”",
            "He said opposition parties would take out rallies all over the country on July 25. “Imran Khan is an uninvited guest in the US tour while the real tour is of the army chief,” said Durrani.\nHe alleged that there was rigging in the erstwhile Federally Administered Tribal Areas (Fata) elections and evidences in this regard would be provided soon.\nDurrani said that the opposition’s Peshawar rally would be attended by Maulana Fazlur Rehman and Asfandyar Wali Khan, while PML-N President Shehbaz Sharif would address the rally in Lahore.",
            "PML-N mulls strategy in face of arrests",
            "He said Bilawal Bhutto Zardari would address the rally in Karachi while Mehmood Khan Achakzai and Hasil Bizenjo would address the rally in Quetta. Durrani said, “Even today the opposition has showed that the number of its senators is complete and tomorrow the cameras will capture that in the Senate.”\nDurrani said that a petition would be filed in the Supreme Court against censorship on media.",
            "“On July 25, public’s lack of confidence in the government will be seen,” he added.",
            "He accused the ruling Pakistan Tehreek-e-Insaf of resorting to rigging in the tribal areas’ polls. “Even after rigging, they only managed to bag five seats,” said Durrani, adding that proof of rigging had started to come forward."
        ]
    },
    {
        "sr_no": 82,
        "newspaper": "Tribune",
        "headline": "PM Imran arrives on three-day visit to US",
        "link": "https://tribune.com.pk/story/2017349/1-pm-imran-leaves-us-three-day-visit/",
        "brief": "",
        "date": "July 20, 2019",
        "detailed_news": [
            "Prime Minister Imran Khan has arrived in Washington on his three-day visit to the United States in the wee hours of Sunday.",
            "The prime minister is visiting Washington on the invitation of President Donald Trump.",
            "The premier is accompanied by Adviser to PM on Commerce Abdul Razzak Dawood, Special Assistant on Overseas Zulfi Bukhari and Army Chief General Qamar Javed Bajwa while Foreign Minister Shah Mehmood Qureshi is already in Washington as part of the entourage.",
            "CEO of Qatar Airways Akbar Albaker called on Prime Minister Imran Khan in Doha, Qatar on Saturday morning during transit to Washington.",
            "‘Austerity drive’: PM Imran to fly on commercial flight to US",
            "This is Imran Khan’s maiden visit to the United States after assuming office.",
            "The trip was originally planned in June but was postponed because of the PM’s prior domestic engagements, including the federal budget.",
            "The prime minister is expected to discuss regional issues with US President Donald Trump during his visit.",
            "Relations between Pakistan and the US have remained strained since Trump took charge of the White House.",
            "Imran Khan’s US visit: courting an unpredictable ally",
            "Trump, highly critical of Pakistan’s role in Afghanistan and overall war on terror, suspended the security and other assistance to Pakistan.",
            "Last year he and PM Imran had a war of words on Twitter after the US president reiterated his allegations against Pakistan for “playing a double game”.",
            "Pakistani officials, however, feel that direct interaction between PM Imran and Trump can help address some of the misgivings."
        ]
    },
    {
        "sr_no": 84,
        "newspaper": "Tribune",
        "headline": "\nPresident Trump gifts cricket bat to PM Imran\n",
        "link": "https://tribune.com.pk/story/2019386/1-president-trump-gifts-cricket-bat-pm-imran/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "WASHINGTON: Prime Minister Imran Khan was gifted a cricket bat by US President Donald Trump along with the picture of President Eisenhower – the only US President who had watched a Test match in Pakistan.",
            "President Trump said that it is a great honour to have a “very popular, a great athlete, one of the greatest, the prime minister of Pakistan.”",
            "PM Imran arrives on three-day visit to US",
            "Underscoring PM Imran’s leadership, the US president said that “a lot of things are happening for the US, and I think a lot of great things are going to be happening for Pakistan too, under your leadership.  I really feel that”.",
            "The world cup winning captain on Sunday arrived in Washington on his three-day visit to the US on the invitation of President Trump.",
            "The premier was accompanied by Adviser to PM on Commerce, Abdul Razzak Dawood, Special Assistant on Overseas, Zulfi Bukhari, and Chief of the Army Staff, General Qamar Javed Bajwa, while Foreign Minister Shah Mehmood Qureshi was already in Washington as part of the entourage."
        ]
    },
    {
        "sr_no": 11,
        "newspaper": "kashmir Times",
        "headline": "Onus, now, on separatists: Rajnath",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92827",
        "brief": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.\r\nHis assertion came with a reminder that he had al...",
        "date": "7/21/2019 12:48:14 PM",
        "detailed_news": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.His assertion came with a reminder that he had already made exhaustive efforts to bring them to dialogue table as the Home Minister of the country, (in first tenure of Modi-government). Now it’s for them (separatists) to act to make things move - whatever way, he plainly told when queried about stand-off on the need of political initiative in Kashmir after effectively containing militancy in the Valley, as claimed by the government. The Defence Minister was speaking to media persons after inaugurating the 1000-meter long Ujh bridge along the International Border (IB) in Kathua district. “What stand-off..? There’s no stand-off. Jitni Pehl Iss Desh Key Griha-Mantri Ko Karni Chahiye Thi Utni Pehl To Maine Pehle Kardi… Ab Uskay Baad Woh Faisla Karengay Key Kya Karna Hai.. (The efforts and initiatives, expected from the Home Minister of this country, have already been exhausted by me in my tenure as the Union Home Minister… Now it is for them to take a call as what they want to do…),” he said.  Responding to another query related to “Operation All–Out” in the Valley to weed-out terrorism, Rajnath said that day was not far off to achieve that mark. “There are no two opinions about it that the Kashmir will get rid of terrorism very soon. Rest assured….it’s going to happen very soon. More so, I believe- as in case of any act of terror occurring anywhere in the world, the way the international community is rallying around on one platform, joining hands to take on this threat, it (terrorism) will be wiped out of - not only Kashmir, Jammu ...but the entire world,” he said.What was that challenge which was main obstacle in resolving Kashmir, in the Defence Minister’s opinion as he had earlier served as the Union Home Minister also? Faced with this query, Rajnath said, “There’s no need to analyse that challenge here. Whatever be the challenge, it will be tackled. We very well know all the reasons, we’ll sort them out and J&K will be rid of terrorism, for sure.”   In response to queries related to recurrent ceasefire violations by Pakistan on IB and LoC, even on the day of his visit to J&K today and the probability of another Kargil-like misadventure by the neighbouring nation (Pak), his terse reply was, “This message is for all the countrymen- Have faith in our country’s leadership - the Prime Minister Narendra Modi and the valiant jawans and officers of our armed forces. They will not let down your faith in them.”Earlier he said, “I’ve just returned from Kargil. Accompanied by the Army Chief General Bipin Rawat and Union Minister of State in PMO Dr Jitendra Singh, I saw those majestic peaks, which were freed from the clutches of Pakistan by our valiant soldiers by laying down their lives yet not before incurring a crushing defeat to the enemy and failing its evil designs. I’ve just witnessed the testimonies to their (gallant soldiers’) valour and heroic deeds which earned India a proud victory.”Rajnath stated that the Ujh bridge, which as per Director General-Border Road Organisation’s assertion, was the longest bridge constructed by the organization anywhere in the country, would ease problems of border residents related to connectivity. “In the form of bridge, the long pending demand of border residents has been realized. The strenuous efforts of Border Road Organisation (BRO) to complete this bridge in stipulated period despite lot of problems and hostile conditions are, undoubtedly, laudable,” the Defence Minister said."
    },
    {
        "sr_no": 16,
        "newspaper": "kashmir Times",
        "headline": "Army pays tribute to brave-heart",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92766",
        "brief": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. \r\nToday, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid hom...",
        "date": "7/19/2019 10:28:45 AM",
        "detailed_news": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. Today, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid homage to the martyr on behalf of a proud nation.Singh was 35 years old and had joined the Army in 2002. He belonged to Village Tibba of Dhuri Tehsil in Sangrur District of Punjab and is survived by wife, a son and a daughter."
    },
    {
        "sr_no": 19,
        "newspaper": "kashmir Times",
        "headline": "Village girl turned IAF fighter pilot inspiring J&K youngsters",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92763",
        "brief": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. \r\nIn a series of motivational lectures, Thakur told s...",
        "date": "7/19/2019 10:28:04 AM",
        "detailed_news": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. In a series of motivational lectures, Thakur told students on Thursday that the decision to come to Bhadarwah to take part in the \"Sangam Youth Festival\" organised by the army changed her life forever as she decided to join the armed forces. Hailing from Billan Bowlian in Udhampur district, Thakur joined the IAF as a fighter pilot this year, one of the first few women in the country to have done so. Her motivational lectures, organised by the Rashtriya Rifles unit based at Bhadarwah, are inspiring youngsters, especially girls, in the state to make a mark in life. “I decided that I had to go for it, whatever it took. I would want every young boy and girl wanting to become a fighter pilot to dream big,” Thakur told. In her message to the students of Kendriya Vidyalaya and PG College Bhadarwah, she said, “Your dreams may seem unconquerable at the moment. But you must chase those so hard that they become reality.” Stating that a \"combination of average qualities\" in her made her unique, Thakur said, “I climbed the ladder step by step, committing some mistakes as well, but kept going as I learned it the hard way. Instead of mourning over your failures and get into self pity, you should work harder to achieve your goals.” She said being an NCC cadet helped her keep her nerves in the most difficult situations. The lectures were followed by question-answer sessions with the students. Aarushi, a Class 12 science student of Kendriya Vidyalaya, said she always thought becoming a doctor was the only option for her but Thakur''s words changed that. “I already feel like flying as joining the army is my childhood dream. I will definitely strive harder to make my dream a reality,” she said. Komal Katal (27) of Garh Bhadarwah village said, “I always wanted to join the Army but in this part of the state, I never got an opportunity to try my luck. Although I could not appear in AFCAT (Air Force Common Admission Test) because of the age bar, after attending the lecture of Jubiksha, I will work harder and give it a try to join the Territorial Army.” Besides Thakur, Commanding Officer, 4 Rashtriya Rifles Colonel D D Pandey also shared his experiences with the students. “You should be passionate about your dreams and to reach your destination, you should not hesitate and think longer to take your first step. Just start your journey today and you will definitely reach your destination,” he said."
    },
    {
        "sr_no": 42,
        "newspaper": "Greater Times",
        "headline": "Brothers of slain rifleman Aurangzeb join Indian Army",
        "link": "https://www.greaterkashmir.com/news/pir-panjal/brothers-of-slain-rifleman-aurangzen-join-indian-army/?utm_source=rss&utm_medium=rss&utm_campaign=brothers-of-slain-rifleman-aurangzen-join-indian-army",
        "brief": "Two younger brothers of Rifleman Aurangzeb, who was abducted and killed by militants in Kashmir last year, have joined the Indian Army.&#160; The duo, Mohammad Tariq and Mohammad Shabir, sons of Mohammad Hanif of Saloni, Mendhar, was recruited in the Army during an enrollment parade held here on Monday.&#160;&#160; Aurangzeb, a soldier in 4th Jammu<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/pir-panjal/brothers-of-slain-rifleman-aurangzen-join-indian-army/\">Read More</a>",
        "date": "Mon, 22 Jul 2019 20:20:29 +0000",
        "detailed_news": ""
    },
    {
        "sr_no": 46,
        "newspaper": "Hindustan Times",
        "headline": "\nMurdered rifleman Aurangzeb’s brothers join army, vow to avenge his death\n",
        "link": "http://www.hindustantimes.com/india-news/murdered-rifleman-aurangzeb-s-brothers-join-army-vow-to-avenge-his-death/story-mN6UEKzcEcXGowb84m6EVI.html",
        "brief": "",
        "date": "Jul 23, 2019 14:53 IST",
        "detailed_news": [
            "Two brothers of an Indian Army soldier, who was abducted and killed by militants last year, have joined the armed forces to “serve the nation and avenge his death”.",
            "Mohammed Tariq, 23, and Mohammed Shabbir, 21, attended an enrolment parade of 100 new recruits in the Territorial Army in Rajouri on Monday, according to a defence spokesperson.",
            "“They were enrolled into a territorial battalion on Monday and now they will undergo training at Punjab Regimental Centre,” the spokesperson said.",
            "They posed with their parents Mohammed Hanif and Raaj Begum after donning the olive green. Hanif is also a former army man. ",
            "Aurangzeb was abducted in Pulwama and later killed by armed terrorists on June 14, 2018, when he was on his way back home in Poonch to celebrate Eid with his family. He was a rifleman in the army’s 44 Rashtriya Rifles. ",
            "“Our brother gave his life for the nation and we will also follow his footsteps. We will not step back when it comes to sacrificing our lives for the nation. We will make him proud and will make Punjab regiment proud by our duty,” said Tariq.",
            "Their father Hanif, a former Jammu and Kashmir Light Infantry soldier, said he may not live to see the “day but his two sons will take revenge of their brother Aurangzeb’s killing.”",
            "“Tariq and Shabbir also want to serve the nation and protect their fellow citizens. Yes, I have lost my son Aurangzeb and death lurks a soldier but then not many have the guts to sacrifice their life for the nation,” he said while speaking to HT over the phone.",
            "“Aurangzeb was trapped and then killed by the cowards. We still miss him,” Hanif said.",
            "Hanif joined the Bharatiya Janata Party (BJP) earlier this year in the presence of Prime Minister Narendra Modi at a public rally in Vijaypur area of Samba district.",
            "Also read | Militant involved in armyman’s murder among 4 killed in Valley",
            "\n\n"
        ]
    },
    {
        "sr_no": 59,
        "newspaper": "Hindustan Times",
        "headline": "\nIndian Army responds to MS Dhoni’s request of training with Parachute regiment for 2 months - Reports\n",
        "link": "http://www.hindustantimes.com/cricket/army-chief-approves-ms-dhoni-s-request-of-training-with-parachute-regiment-for-2-months-reports/story-HUqfM3M9QLoM0ppMbcAUDI.html",
        "brief": "",
        "date": "Jul 22, 2019 13:57 IST",
        "detailed_news": [
            "Army Chief General Bipin Rawat approved former India captain MS Dhoni’s request to train with the Parachute regiment for two months, top Army sources said on Sunday. The wicket-keeper batsman had requested the Indian Army to allow him to train with a territorial army battalion of the Parachute regiment for two months. “The request has now been approved by the Indian Army Chief Gen Bipin Rawat and the honorary Lt Col would train with the Parachute regiment battalion,” top Army sources told ANI.The wicketkeeper-batsman would now train with the Parachute regiment, a part of which is expected to take place in Jammu and Kashmir, sources said.",
            "Also Read: India’s full squads for T20I, ODI and Test series against West Indies",
            "The Army, however, will not allow Dhoni, who holds an honorary post of Lieutenant Colonel in the Territorial Army, to be part of any active operation, sources mentioned.",
            "India will tour West Indies for three T20Is and as many ODIs, and two Tests which are part of World Test Championship from August 3 to September 3.",
            "Dhoni had made himself unavailable for the upcoming Windies tour.",
            "\n\n"
        ]
    },
    {
        "sr_no": 67,
        "newspaper": "Dawn",
        "headline": "Doors now open for revival of diplomatic relations between US, Pakistan: FM Qureshi\n",
        "link": "https://www.dawn.com/news/1495731/doors-now-open-for-revival-of-diplomatic-relations-between-us-pakistan-fm-qureshi",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "Minister for Foreign Affairs Shah Mahmood Qureshi on Tuesday said United States President Donald Trump has accepted an invitation to visit Pakistan extended to him by Prime Minister Imran Khan.",
            "The foreign minister was addressing a press conference in Washington after three consecutive meetings between the senior leadership of both countries.",
            "\"During this tour, the thing that I find unique is that these people have seen the US [Pakistani] community's closeness to this prime minister. You saw that there were thousands gathered in the Capital One arena. ",
            "\"Even in this very room, we have seen extremely powerful prime ministers and presidents in the past having to address empty chairs. ",
            "\"The point is, the people that came there and the love that they expressed — that was a message from overseas Pakistanis. I have never seen this kind of a show before. ",
            "\"This was a very positive message and we are very happy with it,\" Qureshi said. ",
            "According to Qureshi, the exchanges in all three sessions were frank and Pakistan's delegation was able to deliver the message they had come with, \"which was to present Pakistan's point of view, as there had been a long gap [in discussions between the two sides] as an interaction of this level had not taken place in the past five years. ",
            "\"For five years, the top leadership of the two countries had not met. Our country did not have a foreign minister and for five to six years we did not have any lobbyists appointed here — all of this led to a vacuum in the relationship between the two sides.\"",
            "Qureshi said that in an effort to further revive the relations between the two countries, a meeting with the Pak-US caucus will be held. \"The caucus, which has been dormant for a while, will be revived. I remember I had made a promise to this effect in this very room. I would like to mention Tahir Javed, who made tremendous efforts towards the caucus's revival.",
            "\"I just met with Javed, and he let me know that the number [of people in the caucus] has gone up to nearly 80 now. I can assure you that in the recent past, no Pakistani leader has had the opportunity to have this much interaction [with the US leadership] as Prime Minister Imran has had. The point of all this interaction is to put forward Pakistan's point of view. This is because the structure [of the US government] is federal in nature, so no matter what the Executive wishes, nothing can happen without the support of the legislature. ",
            "\"You also know that the [US] legislature has a high-level of ingress from India. This is evident if you look at their staff and their think tanks. Keeping this in mind, we will also try to increase our interaction over there.  ",
            "\"I have told our ambassador here that our embassy's interaction with Capital Hill should increase and be more effective than before.\"",
            "Talking about the seriousness from both countries towards rebuilding the relationship, Qureshi said: \"We cannot forget the fact that the relationship between the two countries was such that no door was being opened for us in the time of Alice Wells and Lisa Curtis. We used to ask for time [for discussions] and they were not ready to give that to us. That was the level [we were at] a few months ago, please understand that. Wasn't our stance the same at the time? Was our Foreign Office not the same at the time?",
            "\"From that, we have come this far. I am not saying that this sitting has completely changed the way things were for us. I am saying that a door that was completely shut for us ... a possibility has been created for that door to be opened. We have come here in all seriousness to rebuild this relationship. The stiffness that once existed in our relationship has been lessened. ",
            "\"You must remember that when Secretary [of State] [Mike] Pompeo visited Pakistan in August 2018 and when I reciprocated the visit in October 2018, we had said that it is our wish to reset our relationship. That's when people had said that on one hand there's the US South Asia Strategy, on the other there is this wish — it was deemed to be quite a contrast. Today we have seen a new beginning, a new chapter is being opened, we should take this positively and hope that things will get better.",
            "Speaking on the trade front, the foreign minister said: \"Interactions between two countries are heavily based on economic ties, which is why it is important that we now pay attention to economic diplomacy too — like I mentioned yesterday during my interaction with the investors.",
            "\"The world looks at economics and looks for ways to cater to its own economic needs, so we will try that we also move forward in that direction.\"",
            "When asked about US economic assistance which had been withdrawn in recent times, Qureshi said: \"The first thing that we need to see is why the [economic] programmes had stopped. It was because of the trust deficit that had been built between the two countries. ",
            "\"Now that we are making an effort to curb that deficit, we can hope that those programmes will be reinstated.\"",
            "Speaking of the FATF and the pressure being exerted on Pakistan, Qureshi said: \"The FATF's greatest focus is on money laundering. Prime Minister Imran Khan has openly said that the plight of South Asian countries lies in the fact that the elite class their takes the money that the country is making and the foreign assistance it gets and misuses it. They send their money out of the country through money laundering.",
            "\"America needs to help us out, keep a check on money laundering. Until that happens, the common man in third world countries will continue to suffer and poverty will remain on the rise there. These are words used by the prime minister himself today. He made these comments in today's sitting. This is his commitment, as far as money laundering is concerned.",
            "\"The other thing is terror financing. You all know what our stance is on that, we have paid a hefty price for it. We make very clear cut statements in this regard today. We have not come here to lie, nor have we come here to make promises that we cannot keep. There is no point in promising something that you cannot deliver on — that is what we have been doing in the past. We as a government will not promise that which we cannot deliver.",
            "\"That said, we want progress in both these things (against money laundering and terror financing). I don't know how much political will the previous governments had in these matters, but one thing is sure, the current government has a very strong will to move forward in these matters — and we have taken concrete measures in this regard. We even have told everyone about the measures we have taken. ",
            "\"However, there are limitations, but we are trying to get past those. Earlier, there was neither will nor capacity in this regard — now there is will and capacity is being built, so we believe there will be progress in this regard.\"",
            "Speaking of India's reaction to President Trump's offer to mediate between Pakistan and India over Kashmir, Qureshi said:",
            "\"Of course India has reacted this way, what else can we expect? They are hardly going to blow trumpets on the offer. India has always reacted this way, they do not want any sort of interference on the Kashmir matter. ",
            "\"They always say that they want bilateral talks on Kashmir, then they never come to the table for these talks. They do not want mediation and they do not want bilateral talks. ",
            "\"Pakistan's stance on the matter is very simple: we want peace, we want peace efforts, we believe that the only solution to the problem is through talks.\"",
            "Speaking of the current situation in Afghanistan and Pakistan's efforts to restore peace in its own tribal areas, Qureshi said:",
            "\"We all saw that right before the current [Pakistan] government elected, a new US policy was announced and in it, Pakistan was primarily blamed for the situation in Afghanistan. Our point of view is completely opposite to that. ",
            "\"We believe that the reasons for the Afghan situation are manifold. The internal situation within Pakistan plays a great role in their regional situation. Furthermore, we kept saying and now the world has seen that Pakistan has made huge efforts on our side of the border and cleansed our own areas. We have restored peace there and started reconstruction there, because of which, a number of people that had to repatriate from there have started returning to their homes.",
            "\"The latest example [of peace and normalcy] there is the election that took place in the tribal belt a couple of days ago. The best thing about those elections was that they were completely peaceful, no untoward incident was reported there. The second great thing about those elections was that a large number of people took part in the voting process there — including a lot of women. Thirdly, the results of those elections were accepted by everyone.\"",
            "The foreign minister also touched upon the matter of some candidates, wishing to be a part of PTI, that contested the election independently because they were not given a party ticket. \"Some candidates that have won independently wished to contest the election under the PTI banner. However, the party's committee made some decisions and was unable to provide them tickets. Those candidates then chose to contest the elections independently while saying that once they win, they would join the PTI and support it. Due to these claims, we believe that the PTI will be able to secure 10 out of the 16 seats that were contested upon. Five of those seats already belong to the PTI, the other five we will gain when the independents join us, as is their constitutional right after being notified by the election commission.\"",
            "\"The point of letting everyone know this is to show that the world and the people of the area have all witnessed and accepted these elections and appreciated the efforts the government has put into them.\"",
            "FM Qureshi's views on the matter differ from Khyber Pakhtunkhwa Chief Minister Mahmood Khan, who said that strict action will be taken against PTI members that chose to contest the election independently. ",
            "Answering a question regarding the ISI and army chiefs' presence in the tour, the foreign minister said: \"This is actually not the first time that our country's [military] leadership has been part of our discussions with the US. ",
            "\"I remember clearly, when I was the foreign minister earlier, a strategic dialogue had taken place. In that dialogue, I was present with Hillary Clinton and our chief of army staff at the time, General Kayani, had been having a discussion in the same room with the US military leadership. So this has happened before and it is not out of the ordinary\"."
        ]
    },
    {
        "sr_no": 75,
        "newspaper": "Tribune",
        "headline": "\nTrump accepts PM Imran's invitation for Pakistan visit\n",
        "link": "https://tribune.com.pk/story/2019293/1-trump-accepts-pm-imran-invitation-pakistan-visit/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "US President Donald Trump has accepted Prime Minister Imran Khan’s invitation to visit Pakistan, said the Foreign Office on Tuesday.",
            "The invitation was extended during the prime minister’s meeting with Trump on Monday – the first summit-level engagement between the two countries since 2015.",
            "President Trump welcomed the premier at the entrance of the White House. The two leaders jointly addressed the press and later had a one-on-one meeting, which was followed by delegation-level talks between the two sides.",
            "President Trump also hosted a luncheon in the Prime Minister’s honour.",
            "The two leaders held comprehensive discussions with a focus on building a broad-based and enduring partnership between Pakistan and the United States and strengthening cooperation between the two countries to bring peace, stability and economic prosperity in South Asia.",
            "The two leaders reviewed the progress of the Afghan peace and reconciliation process. President Trump appreciated Pakistan’s contribution to the peace talks and Prime Minister Imran reaffirmed Pakistan’s commitment to continue to support the process in good faith. He also added that pursuing the process was a shared responsibility.",
            "The two also affirmed their resolve to work together across a broad range of areas and acknowledged the immense opportunity and potential for mutually beneficial collaboration in diverse fields such as trade, investment, energy, economic connectivity, and defense and security cooperation. Prime Minister Imran also invited the US corporate sector to invest in Pakistan.",
            "It was decided to establish a mechanism to follow-up on the understandings reached.",
            "The prime minister also briefed the US president about his vision of the socio-economic development of Pakistan. He said that “peaceful neighborhood” was a priority of Pakistan’s foreign policy, adding that peace and stability in the region would allow Pakistan to harness its human resource potential to generate growth and spur regional connectivity.",
            "President Trump appreciated the premier’s vision for peace in South Asia.",
            "The Prime Minister said Pakistan was convinced that normalisation of relations with India would be mutually beneficial for the two countries. He underlined that Pakistan would continue to pursue dialogue and diplomacy to resolve longstanding disputes, including the core dispute of Jammu and Kashmir. President Trump expressed his readiness to play a facilitating role in resolution of the Kashmir dispute.",
            "Following the conclusion of official talks, President Trump took Prime Minister Khan and members of the delegation on a tour of the White House.",
            "Pakistan’s delegation included the Foreign Minister, Chief of Army Staff, DG (ISI), Advisors on Finance and Commerce, Special Assistant on Overseas Pakistanis, Foreign Secretary, Ambassador-at-Large on Investment and Pakistan’s Ambassador to the United States."
        ]
    },
    {
        "sr_no": 77,
        "newspaper": "Tribune",
        "headline": "\nBilawal supports PM Imran's efforts to 'engage with the world'\n",
        "link": "https://tribune.com.pk/story/2019533/1-bilawal-supports-pm-imrans-efforts-engage-world/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "Pakistan Peoples Party (PPP) Chairman Bilawal Bhutto-Zardari on Tuesday extended unconditional support to Prime Minister Imran Khan for his efforts to ‘engage with the world’.",
            "Bilawal, reacting to the meeting between PM Imran and President Trump, took to social media to reiterate support for Pakistan despite “reservations with the premier”.",
            "I‘ve many reservations about our PM, his undemocratic politics & economically fatal polices. I also believe much of his conduct abroad particularly his jalsa is unbecoming of a PM who is supposed to represent  not just PTI. 1/2 #TrumpHostsKhan",
            "— BilawalBhuttoZardari (@BBhuttoZardari) July 23, 2019",
            "PM Imran arrives on three-day visit to US",
            "On July 21, PM Imran arrived in Washington on his three-day visit to the United States, accompanied by Chief of the Army Staff General Qamar Javed Bajwa, Adviser to PM on Commerce Abdul Razzak Dawood and Special Assistant on Overseas Pakistanis Zulfi Bukhari.",
            "The premier’s trip was originally planned in June but was postponed because of prior domestic engagements, including the federal budget.",
            " ",
            " ",
            " "
        ]
    },
    {
        "sr_no": 80,
        "newspaper": "Tribune",
        "headline": "Corruption crackdown ‘politically motivated’",
        "link": "https://tribune.com.pk/story/2019222/1-corruption-crackdown-politically-motivated/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "ISLAMABAD.: The Rahbar Committee of the opposition parties has termed the arrests made by the government on corruption charges as “political arrests” and decided to hold a protest outside the NAB office against the arrest of former prime minister Shahid Khaqan Abbasi.",
            "The development came during the third in-camera meeting of the Rahbar Committee presided over by Jamiat Ulema-e-Islam-Fazl’s Akram Durrani here on Monday.",
            "Briefing the media after the meeting, Durrani said targeting of political leaders, including Pakistan Muslim League-Nawaz supremo Nawaz Sharif and Pakistan Peoples Party Co-chairman Asif Zardari, was political victimisation.",
            "PML-N demands NAB chairman’s resignation",
            "He announced that the opposition would hold a protest outside the NAB office against the arrest of Abbasi.\nRahbar Committee convener Akram Durrani said, “[Prime Minister] Imran Khan promised to provide containers, but obstacles were created to stop Maryam Nawaz from holding the rally.”",
            "He said opposition parties would take out rallies all over the country on July 25. “Imran Khan is an uninvited guest in the US tour while the real tour is of the army chief,” said Durrani.\nHe alleged that there was rigging in the erstwhile Federally Administered Tribal Areas (Fata) elections and evidences in this regard would be provided soon.\nDurrani said that the opposition’s Peshawar rally would be attended by Maulana Fazlur Rehman and Asfandyar Wali Khan, while PML-N President Shehbaz Sharif would address the rally in Lahore.",
            "PML-N mulls strategy in face of arrests",
            "He said Bilawal Bhutto Zardari would address the rally in Karachi while Mehmood Khan Achakzai and Hasil Bizenjo would address the rally in Quetta. Durrani said, “Even today the opposition has showed that the number of its senators is complete and tomorrow the cameras will capture that in the Senate.”\nDurrani said that a petition would be filed in the Supreme Court against censorship on media.",
            "“On July 25, public’s lack of confidence in the government will be seen,” he added.",
            "He accused the ruling Pakistan Tehreek-e-Insaf of resorting to rigging in the tribal areas’ polls. “Even after rigging, they only managed to bag five seats,” said Durrani, adding that proof of rigging had started to come forward."
        ]
    },
    {
        "sr_no": 83,
        "newspaper": "Tribune",
        "headline": "PM Imran arrives on three-day visit to US",
        "link": "https://tribune.com.pk/story/2017349/1-pm-imran-leaves-us-three-day-visit/",
        "brief": "",
        "date": "July 20, 2019",
        "detailed_news": [
            "Prime Minister Imran Khan has arrived in Washington on his three-day visit to the United States in the wee hours of Sunday.",
            "The prime minister is visiting Washington on the invitation of President Donald Trump.",
            "The premier is accompanied by Adviser to PM on Commerce Abdul Razzak Dawood, Special Assistant on Overseas Zulfi Bukhari and Army Chief General Qamar Javed Bajwa while Foreign Minister Shah Mehmood Qureshi is already in Washington as part of the entourage.",
            "CEO of Qatar Airways Akbar Albaker called on Prime Minister Imran Khan in Doha, Qatar on Saturday morning during transit to Washington.",
            "‘Austerity drive’: PM Imran to fly on commercial flight to US",
            "This is Imran Khan’s maiden visit to the United States after assuming office.",
            "The trip was originally planned in June but was postponed because of the PM’s prior domestic engagements, including the federal budget.",
            "The prime minister is expected to discuss regional issues with US President Donald Trump during his visit.",
            "Relations between Pakistan and the US have remained strained since Trump took charge of the White House.",
            "Imran Khan’s US visit: courting an unpredictable ally",
            "Trump, highly critical of Pakistan’s role in Afghanistan and overall war on terror, suspended the security and other assistance to Pakistan.",
            "Last year he and PM Imran had a war of words on Twitter after the US president reiterated his allegations against Pakistan for “playing a double game”.",
            "Pakistani officials, however, feel that direct interaction between PM Imran and Trump can help address some of the misgivings."
        ]
    },
    {
        "sr_no": 84,
        "newspaper": "Tribune",
        "headline": "\nPresident Trump gifts cricket bat to PM Imran\n",
        "link": "https://tribune.com.pk/story/2019386/1-president-trump-gifts-cricket-bat-pm-imran/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "WASHINGTON: Prime Minister Imran Khan was gifted a cricket bat by US President Donald Trump along with the picture of President Eisenhower – the only US President who had watched a Test match in Pakistan.",
            "President Trump said that it is a great honour to have a “very popular, a great athlete, one of the greatest, the prime minister of Pakistan.”",
            "PM Imran arrives on three-day visit to US",
            "Underscoring PM Imran’s leadership, the US president said that “a lot of things are happening for the US, and I think a lot of great things are going to be happening for Pakistan too, under your leadership.  I really feel that”.",
            "The world cup winning captain on Sunday arrived in Washington on his three-day visit to the US on the invitation of President Trump.",
            "The premier was accompanied by Adviser to PM on Commerce, Abdul Razzak Dawood, Special Assistant on Overseas, Zulfi Bukhari, and Chief of the Army Staff, General Qamar Javed Bajwa, while Foreign Minister Shah Mehmood Qureshi was already in Washington as part of the entourage."
        ]
    },
    {
        "sr_no": 11,
        "newspaper": "kashmir Times",
        "headline": "Onus, now, on separatists: Rajnath",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92827",
        "brief": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.\r\nHis assertion came with a reminder that he had al...",
        "date": "7/21/2019 12:48:14 PM",
        "detailed_news": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.His assertion came with a reminder that he had already made exhaustive efforts to bring them to dialogue table as the Home Minister of the country, (in first tenure of Modi-government). Now it’s for them (separatists) to act to make things move - whatever way, he plainly told when queried about stand-off on the need of political initiative in Kashmir after effectively containing militancy in the Valley, as claimed by the government. The Defence Minister was speaking to media persons after inaugurating the 1000-meter long Ujh bridge along the International Border (IB) in Kathua district. “What stand-off..? There’s no stand-off. Jitni Pehl Iss Desh Key Griha-Mantri Ko Karni Chahiye Thi Utni Pehl To Maine Pehle Kardi… Ab Uskay Baad Woh Faisla Karengay Key Kya Karna Hai.. (The efforts and initiatives, expected from the Home Minister of this country, have already been exhausted by me in my tenure as the Union Home Minister… Now it is for them to take a call as what they want to do…),” he said.  Responding to another query related to “Operation All–Out” in the Valley to weed-out terrorism, Rajnath said that day was not far off to achieve that mark. “There are no two opinions about it that the Kashmir will get rid of terrorism very soon. Rest assured….it’s going to happen very soon. More so, I believe- as in case of any act of terror occurring anywhere in the world, the way the international community is rallying around on one platform, joining hands to take on this threat, it (terrorism) will be wiped out of - not only Kashmir, Jammu ...but the entire world,” he said.What was that challenge which was main obstacle in resolving Kashmir, in the Defence Minister’s opinion as he had earlier served as the Union Home Minister also? Faced with this query, Rajnath said, “There’s no need to analyse that challenge here. Whatever be the challenge, it will be tackled. We very well know all the reasons, we’ll sort them out and J&K will be rid of terrorism, for sure.”   In response to queries related to recurrent ceasefire violations by Pakistan on IB and LoC, even on the day of his visit to J&K today and the probability of another Kargil-like misadventure by the neighbouring nation (Pak), his terse reply was, “This message is for all the countrymen- Have faith in our country’s leadership - the Prime Minister Narendra Modi and the valiant jawans and officers of our armed forces. They will not let down your faith in them.”Earlier he said, “I’ve just returned from Kargil. Accompanied by the Army Chief General Bipin Rawat and Union Minister of State in PMO Dr Jitendra Singh, I saw those majestic peaks, which were freed from the clutches of Pakistan by our valiant soldiers by laying down their lives yet not before incurring a crushing defeat to the enemy and failing its evil designs. I’ve just witnessed the testimonies to their (gallant soldiers’) valour and heroic deeds which earned India a proud victory.”Rajnath stated that the Ujh bridge, which as per Director General-Border Road Organisation’s assertion, was the longest bridge constructed by the organization anywhere in the country, would ease problems of border residents related to connectivity. “In the form of bridge, the long pending demand of border residents has been realized. The strenuous efforts of Border Road Organisation (BRO) to complete this bridge in stipulated period despite lot of problems and hostile conditions are, undoubtedly, laudable,” the Defence Minister said."
    },
    {
        "sr_no": 16,
        "newspaper": "kashmir Times",
        "headline": "Army pays tribute to brave-heart",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92766",
        "brief": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. \r\nToday, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid hom...",
        "date": "7/19/2019 10:28:45 AM",
        "detailed_news": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. Today, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid homage to the martyr on behalf of a proud nation.Singh was 35 years old and had joined the Army in 2002. He belonged to Village Tibba of Dhuri Tehsil in Sangrur District of Punjab and is survived by wife, a son and a daughter."
    },
    {
        "sr_no": 19,
        "newspaper": "kashmir Times",
        "headline": "Village girl turned IAF fighter pilot inspiring J&K youngsters",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92763",
        "brief": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. \r\nIn a series of motivational lectures, Thakur told s...",
        "date": "7/19/2019 10:28:04 AM",
        "detailed_news": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. In a series of motivational lectures, Thakur told students on Thursday that the decision to come to Bhadarwah to take part in the \"Sangam Youth Festival\" organised by the army changed her life forever as she decided to join the armed forces. Hailing from Billan Bowlian in Udhampur district, Thakur joined the IAF as a fighter pilot this year, one of the first few women in the country to have done so. Her motivational lectures, organised by the Rashtriya Rifles unit based at Bhadarwah, are inspiring youngsters, especially girls, in the state to make a mark in life. “I decided that I had to go for it, whatever it took. I would want every young boy and girl wanting to become a fighter pilot to dream big,” Thakur told. In her message to the students of Kendriya Vidyalaya and PG College Bhadarwah, she said, “Your dreams may seem unconquerable at the moment. But you must chase those so hard that they become reality.” Stating that a \"combination of average qualities\" in her made her unique, Thakur said, “I climbed the ladder step by step, committing some mistakes as well, but kept going as I learned it the hard way. Instead of mourning over your failures and get into self pity, you should work harder to achieve your goals.” She said being an NCC cadet helped her keep her nerves in the most difficult situations. The lectures were followed by question-answer sessions with the students. Aarushi, a Class 12 science student of Kendriya Vidyalaya, said she always thought becoming a doctor was the only option for her but Thakur''s words changed that. “I already feel like flying as joining the army is my childhood dream. I will definitely strive harder to make my dream a reality,” she said. Komal Katal (27) of Garh Bhadarwah village said, “I always wanted to join the Army but in this part of the state, I never got an opportunity to try my luck. Although I could not appear in AFCAT (Air Force Common Admission Test) because of the age bar, after attending the lecture of Jubiksha, I will work harder and give it a try to join the Territorial Army.” Besides Thakur, Commanding Officer, 4 Rashtriya Rifles Colonel D D Pandey also shared his experiences with the students. “You should be passionate about your dreams and to reach your destination, you should not hesitate and think longer to take your first step. Just start your journey today and you will definitely reach your destination,” he said."
    },
    {
        "sr_no": 42,
        "newspaper": "Greater Times",
        "headline": "Brothers of slain rifleman Aurangzeb join Indian Army",
        "link": "https://www.greaterkashmir.com/news/pir-panjal/brothers-of-slain-rifleman-aurangzen-join-indian-army/?utm_source=rss&utm_medium=rss&utm_campaign=brothers-of-slain-rifleman-aurangzen-join-indian-army",
        "brief": "Two younger brothers of Rifleman Aurangzeb, who was abducted and killed by militants in Kashmir last year, have joined the Indian Army.&#160; The duo, Mohammad Tariq and Mohammad Shabir, sons of Mohammad Hanif of Saloni, Mendhar, was recruited in the Army during an enrollment parade held here on Monday.&#160;&#160; Aurangzeb, a soldier in 4th Jammu<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/pir-panjal/brothers-of-slain-rifleman-aurangzen-join-indian-army/\">Read More</a>",
        "date": "Mon, 22 Jul 2019 20:20:29 +0000",
        "detailed_news": ""
    },
    {
        "sr_no": 46,
        "newspaper": "Hindustan Times",
        "headline": "\nMurdered rifleman Aurangzeb’s brothers join army, vow to avenge his death\n",
        "link": "http://www.hindustantimes.com/india-news/murdered-rifleman-aurangzeb-s-brothers-join-army-vow-to-avenge-his-death/story-mN6UEKzcEcXGowb84m6EVI.html",
        "brief": "",
        "date": "Jul 23, 2019 14:53 IST",
        "detailed_news": [
            "Two brothers of an Indian Army soldier, who was abducted and killed by militants last year, have joined the armed forces to “serve the nation and avenge his death”.",
            "Mohammed Tariq, 23, and Mohammed Shabbir, 21, attended an enrolment parade of 100 new recruits in the Territorial Army in Rajouri on Monday, according to a defence spokesperson.",
            "“They were enrolled into a territorial battalion on Monday and now they will undergo training at Punjab Regimental Centre,” the spokesperson said.",
            "They posed with their parents Mohammed Hanif and Raaj Begum after donning the olive green. Hanif is also a former army man. ",
            "Aurangzeb was abducted in Pulwama and later killed by armed terrorists on June 14, 2018, when he was on his way back home in Poonch to celebrate Eid with his family. He was a rifleman in the army’s 44 Rashtriya Rifles. ",
            "“Our brother gave his life for the nation and we will also follow his footsteps. We will not step back when it comes to sacrificing our lives for the nation. We will make him proud and will make Punjab regiment proud by our duty,” said Tariq.",
            "Their father Hanif, a former Jammu and Kashmir Light Infantry soldier, said he may not live to see the “day but his two sons will take revenge of their brother Aurangzeb’s killing.”",
            "“Tariq and Shabbir also want to serve the nation and protect their fellow citizens. Yes, I have lost my son Aurangzeb and death lurks a soldier but then not many have the guts to sacrifice their life for the nation,” he said while speaking to HT over the phone.",
            "“Aurangzeb was trapped and then killed by the cowards. We still miss him,” Hanif said.",
            "Hanif joined the Bharatiya Janata Party (BJP) earlier this year in the presence of Prime Minister Narendra Modi at a public rally in Vijaypur area of Samba district.",
            "Also read | Militant involved in armyman’s murder among 4 killed in Valley",
            "\n\n"
        ]
    },
    {
        "sr_no": 59,
        "newspaper": "Hindustan Times",
        "headline": "\nIndian Army responds to MS Dhoni’s request of training with Parachute regiment for 2 months - Reports\n",
        "link": "http://www.hindustantimes.com/cricket/army-chief-approves-ms-dhoni-s-request-of-training-with-parachute-regiment-for-2-months-reports/story-HUqfM3M9QLoM0ppMbcAUDI.html",
        "brief": "",
        "date": "Jul 22, 2019 13:57 IST",
        "detailed_news": [
            "Army Chief General Bipin Rawat approved former India captain MS Dhoni’s request to train with the Parachute regiment for two months, top Army sources said on Sunday. The wicket-keeper batsman had requested the Indian Army to allow him to train with a territorial army battalion of the Parachute regiment for two months. “The request has now been approved by the Indian Army Chief Gen Bipin Rawat and the honorary Lt Col would train with the Parachute regiment battalion,” top Army sources told ANI.The wicketkeeper-batsman would now train with the Parachute regiment, a part of which is expected to take place in Jammu and Kashmir, sources said.",
            "Also Read: India’s full squads for T20I, ODI and Test series against West Indies",
            "The Army, however, will not allow Dhoni, who holds an honorary post of Lieutenant Colonel in the Territorial Army, to be part of any active operation, sources mentioned.",
            "India will tour West Indies for three T20Is and as many ODIs, and two Tests which are part of World Test Championship from August 3 to September 3.",
            "Dhoni had made himself unavailable for the upcoming Windies tour.",
            "\n\n"
        ]
    },
    {
        "sr_no": 69,
        "newspaper": "Dawn",
        "headline": "Doors now open for revival of diplomatic relations between US, Pakistan: FM Qureshi\n",
        "link": "https://www.dawn.com/news/1495731/doors-now-open-for-revival-of-diplomatic-relations-between-us-pakistan-fm-qureshi",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "Minister for Foreign Affairs Shah Mahmood Qureshi on Tuesday said United States President Donald Trump has accepted an invitation to visit Pakistan extended to him by Prime Minister Imran Khan.",
            "The foreign minister was addressing a press conference in Washington after three consecutive meetings between the senior leadership of both countries.",
            "\"During this tour, the thing that I find unique is that these people have seen the US [Pakistani] community's closeness to this prime minister. You saw that there were thousands gathered in the Capital One arena. ",
            "\"Even in this very room, we have seen extremely powerful prime ministers and presidents in the past having to address empty chairs. ",
            "\"The point is, the people that came there and the love that they expressed — that was a message from overseas Pakistanis. I have never seen this kind of a show before. ",
            "\"This was a very positive message and we are very happy with it,\" Qureshi said. ",
            "According to Qureshi, the exchanges in all three sessions were frank and Pakistan's delegation was able to deliver the message they had come with, \"which was to present Pakistan's point of view, as there had been a long gap [in discussions between the two sides] as an interaction of this level had not taken place in the past five years. ",
            "\"For five years, the top leadership of the two countries had not met. Our country did not have a foreign minister and for five to six years we did not have any lobbyists appointed here — all of this led to a vacuum in the relationship between the two sides.\"",
            "Qureshi said that in an effort to further revive the relations between the two countries, a meeting with the Pak-US caucus will be held. \"The caucus, which has been dormant for a while, will be revived. I remember I had made a promise to this effect in this very room. I would like to mention Tahir Javed, who made tremendous efforts towards the caucus's revival.",
            "\"I just met with Javed, and he let me know that the number [of people in the caucus] has gone up to nearly 80 now. I can assure you that in the recent past, no Pakistani leader has had the opportunity to have this much interaction [with the US leadership] as Prime Minister Imran has had. The point of all this interaction is to put forward Pakistan's point of view. This is because the structure [of the US government] is federal in nature, so no matter what the Executive wishes, nothing can happen without the support of the legislature. ",
            "\"You also know that the [US] legislature has a high-level of ingress from India. This is evident if you look at their staff and their think tanks. Keeping this in mind, we will also try to increase our interaction over there.  ",
            "\"I have told our ambassador here that our embassy's interaction with Capital Hill should increase and be more effective than before.\"",
            "Talking about the seriousness from both countries towards rebuilding the relationship, Qureshi said: \"We cannot forget the fact that the relationship between the two countries was such that no door was being opened for us in the time of Alice Wells and Lisa Curtis. We used to ask for time [for discussions] and they were not ready to give that to us. That was the level [we were at] a few months ago, please understand that. Wasn't our stance the same at the time? Was our Foreign Office not the same at the time?",
            "\"From that, we have come this far. I am not saying that this sitting has completely changed the way things were for us. I am saying that a door that was completely shut for us ... a possibility has been created for that door to be opened. We have come here in all seriousness to rebuild this relationship. The stiffness that once existed in our relationship has been lessened. ",
            "\"You must remember that when Secretary [of State] [Mike] Pompeo visited Pakistan in August 2018 and when I reciprocated the visit in October 2018, we had said that it is our wish to reset our relationship. That's when people had said that on one hand there's the US South Asia Strategy, on the other there is this wish — it was deemed to be quite a contrast. Today we have seen a new beginning, a new chapter is being opened, we should take this positively and hope that things will get better.",
            "Speaking on the trade front, the foreign minister said: \"Interactions between two countries are heavily based on economic ties, which is why it is important that we now pay attention to economic diplomacy too — like I mentioned yesterday during my interaction with the investors.",
            "\"The world looks at economics and looks for ways to cater to its own economic needs, so we will try that we also move forward in that direction.\"",
            "When asked about US economic assistance which had been withdrawn in recent times, Qureshi said: \"The first thing that we need to see is why the [economic] programmes had stopped. It was because of the trust deficit that had been built between the two countries. ",
            "\"Now that we are making an effort to curb that deficit, we can hope that those programmes will be reinstated.\"",
            "Speaking of the FATF and the pressure being exerted on Pakistan, Qureshi said: \"The FATF's greatest focus is on money laundering. Prime Minister Imran Khan has openly said that the plight of South Asian countries lies in the fact that the elite class their takes the money that the country is making and the foreign assistance it gets and misuses it. They send their money out of the country through money laundering.",
            "\"America needs to help us out, keep a check on money laundering. Until that happens, the common man in third world countries will continue to suffer and poverty will remain on the rise there. These are words used by the prime minister himself today. He made these comments in today's sitting. This is his commitment, as far as money laundering is concerned.",
            "\"The other thing is terror financing. You all know what our stance is on that, we have paid a hefty price for it. We make very clear cut statements in this regard today. We have not come here to lie, nor have we come here to make promises that we cannot keep. There is no point in promising something that you cannot deliver on — that is what we have been doing in the past. We as a government will not promise that which we cannot deliver.",
            "\"That said, we want progress in both these things (against money laundering and terror financing). I don't know how much political will the previous governments had in these matters, but one thing is sure, the current government has a very strong will to move forward in these matters — and we have taken concrete measures in this regard. We even have told everyone about the measures we have taken. ",
            "\"However, there are limitations, but we are trying to get past those. Earlier, there was neither will nor capacity in this regard — now there is will and capacity is being built, so we believe there will be progress in this regard.\"",
            "Speaking of India's reaction to President Trump's offer to mediate between Pakistan and India over Kashmir, Qureshi said:",
            "\"Of course India has reacted this way, what else can we expect? They are hardly going to blow trumpets on the offer. India has always reacted this way, they do not want any sort of interference on the Kashmir matter. ",
            "\"They always say that they want bilateral talks on Kashmir, then they never come to the table for these talks. They do not want mediation and they do not want bilateral talks. ",
            "\"Pakistan's stance on the matter is very simple: we want peace, we want peace efforts, we believe that the only solution to the problem is through talks.\"",
            "Speaking of the current situation in Afghanistan and Pakistan's efforts to restore peace in its own tribal areas, Qureshi said:",
            "\"We all saw that right before the current [Pakistan] government elected, a new US policy was announced and in it, Pakistan was primarily blamed for the situation in Afghanistan. Our point of view is completely opposite to that. ",
            "\"We believe that the reasons for the Afghan situation are manifold. The internal situation within Pakistan plays a great role in their regional situation. Furthermore, we kept saying and now the world has seen that Pakistan has made huge efforts on our side of the border and cleansed our own areas. We have restored peace there and started reconstruction there, because of which, a number of people that had to repatriate from there have started returning to their homes.",
            "\"The latest example [of peace and normalcy] there is the election that took place in the tribal belt a couple of days ago. The best thing about those elections was that they were completely peaceful, no untoward incident was reported there. The second great thing about those elections was that a large number of people took part in the voting process there — including a lot of women. Thirdly, the results of those elections were accepted by everyone.\"",
            "The foreign minister also touched upon the matter of some candidates, wishing to be a part of PTI, that contested the election independently because they were not given a party ticket. \"Some candidates that have won independently wished to contest the election under the PTI banner. However, the party's committee made some decisions and was unable to provide them tickets. Those candidates then chose to contest the elections independently while saying that once they win, they would join the PTI and support it. Due to these claims, we believe that the PTI will be able to secure 10 out of the 16 seats that were contested upon. Five of those seats already belong to the PTI, the other five we will gain when the independents join us, as is their constitutional right after being notified by the election commission.\"",
            "\"The point of letting everyone know this is to show that the world and the people of the area have all witnessed and accepted these elections and appreciated the efforts the government has put into them.\"",
            "FM Qureshi's views on the matter differ from Khyber Pakhtunkhwa Chief Minister Mahmood Khan, who said that strict action will be taken against PTI members that chose to contest the election independently. ",
            "Answering a question regarding the ISI and army chiefs' presence in the tour, the foreign minister said: \"This is actually not the first time that our country's [military] leadership has been part of our discussions with the US. ",
            "\"I remember clearly, when I was the foreign minister earlier, a strategic dialogue had taken place. In that dialogue, I was present with Hillary Clinton and our chief of army staff at the time, General Kayani, had been having a discussion in the same room with the US military leadership. So this has happened before and it is not out of the ordinary\"."
        ]
    },
    {
        "sr_no": 75,
        "newspaper": "Tribune",
        "headline": "\nTrump accepts PM Imran's invitation for Pakistan visit\n",
        "link": "https://tribune.com.pk/story/2019293/1-trump-accepts-pm-imran-invitation-pakistan-visit/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "US President Donald Trump has accepted Prime Minister Imran Khan’s invitation to visit Pakistan, said the Foreign Office on Tuesday.",
            "The invitation was extended during the prime minister’s meeting with Trump on Monday – the first summit-level engagement between the two countries since 2015.",
            "President Trump welcomed the premier at the entrance of the White House. The two leaders jointly addressed the press and later had a one-on-one meeting, which was followed by delegation-level talks between the two sides.",
            "President Trump also hosted a luncheon in the Prime Minister’s honour.",
            "The two leaders held comprehensive discussions with a focus on building a broad-based and enduring partnership between Pakistan and the United States and strengthening cooperation between the two countries to bring peace, stability and economic prosperity in South Asia.",
            "The two leaders reviewed the progress of the Afghan peace and reconciliation process. President Trump appreciated Pakistan’s contribution to the peace talks and Prime Minister Imran reaffirmed Pakistan’s commitment to continue to support the process in good faith. He also added that pursuing the process was a shared responsibility.",
            "The two also affirmed their resolve to work together across a broad range of areas and acknowledged the immense opportunity and potential for mutually beneficial collaboration in diverse fields such as trade, investment, energy, economic connectivity, and defense and security cooperation. Prime Minister Imran also invited the US corporate sector to invest in Pakistan.",
            "It was decided to establish a mechanism to follow-up on the understandings reached.",
            "The prime minister also briefed the US president about his vision of the socio-economic development of Pakistan. He said that “peaceful neighborhood” was a priority of Pakistan’s foreign policy, adding that peace and stability in the region would allow Pakistan to harness its human resource potential to generate growth and spur regional connectivity.",
            "President Trump appreciated the premier’s vision for peace in South Asia.",
            "The Prime Minister said Pakistan was convinced that normalisation of relations with India would be mutually beneficial for the two countries. He underlined that Pakistan would continue to pursue dialogue and diplomacy to resolve longstanding disputes, including the core dispute of Jammu and Kashmir. President Trump expressed his readiness to play a facilitating role in resolution of the Kashmir dispute.",
            "Following the conclusion of official talks, President Trump took Prime Minister Khan and members of the delegation on a tour of the White House.",
            "Pakistan’s delegation included the Foreign Minister, Chief of Army Staff, DG (ISI), Advisors on Finance and Commerce, Special Assistant on Overseas Pakistanis, Foreign Secretary, Ambassador-at-Large on Investment and Pakistan’s Ambassador to the United States."
        ]
    },
    {
        "sr_no": 77,
        "newspaper": "Tribune",
        "headline": "\nBilawal supports PM Imran's efforts to 'engage with the world'\n",
        "link": "https://tribune.com.pk/story/2019533/1-bilawal-supports-pm-imrans-efforts-engage-world/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "Pakistan Peoples Party (PPP) Chairman Bilawal Bhutto-Zardari on Tuesday extended unconditional support to Prime Minister Imran Khan for his efforts to ‘engage with the world’.",
            "Bilawal, reacting to the meeting between PM Imran and President Trump, took to social media to reiterate support for Pakistan despite “reservations with the premier”.",
            "I‘ve many reservations about our PM, his undemocratic politics & economically fatal polices. I also believe much of his conduct abroad particularly his jalsa is unbecoming of a PM who is supposed to represent  not just PTI. 1/2 #TrumpHostsKhan",
            "— BilawalBhuttoZardari (@BBhuttoZardari) July 23, 2019",
            "PM Imran arrives on three-day visit to US",
            "On July 21, PM Imran arrived in Washington on his three-day visit to the United States, accompanied by Chief of the Army Staff General Qamar Javed Bajwa, Adviser to PM on Commerce Abdul Razzak Dawood and Special Assistant on Overseas Pakistanis Zulfi Bukhari.",
            "The premier’s trip was originally planned in June but was postponed because of prior domestic engagements, including the federal budget.",
            " ",
            " ",
            " "
        ]
    },
    {
        "sr_no": 80,
        "newspaper": "Tribune",
        "headline": "Corruption crackdown ‘politically motivated’",
        "link": "https://tribune.com.pk/story/2019222/1-corruption-crackdown-politically-motivated/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "ISLAMABAD.: The Rahbar Committee of the opposition parties has termed the arrests made by the government on corruption charges as “political arrests” and decided to hold a protest outside the NAB office against the arrest of former prime minister Shahid Khaqan Abbasi.",
            "The development came during the third in-camera meeting of the Rahbar Committee presided over by Jamiat Ulema-e-Islam-Fazl’s Akram Durrani here on Monday.",
            "Briefing the media after the meeting, Durrani said targeting of political leaders, including Pakistan Muslim League-Nawaz supremo Nawaz Sharif and Pakistan Peoples Party Co-chairman Asif Zardari, was political victimisation.",
            "PML-N demands NAB chairman’s resignation",
            "He announced that the opposition would hold a protest outside the NAB office against the arrest of Abbasi.\nRahbar Committee convener Akram Durrani said, “[Prime Minister] Imran Khan promised to provide containers, but obstacles were created to stop Maryam Nawaz from holding the rally.”",
            "He said opposition parties would take out rallies all over the country on July 25. “Imran Khan is an uninvited guest in the US tour while the real tour is of the army chief,” said Durrani.\nHe alleged that there was rigging in the erstwhile Federally Administered Tribal Areas (Fata) elections and evidences in this regard would be provided soon.\nDurrani said that the opposition’s Peshawar rally would be attended by Maulana Fazlur Rehman and Asfandyar Wali Khan, while PML-N President Shehbaz Sharif would address the rally in Lahore.",
            "PML-N mulls strategy in face of arrests",
            "He said Bilawal Bhutto Zardari would address the rally in Karachi while Mehmood Khan Achakzai and Hasil Bizenjo would address the rally in Quetta. Durrani said, “Even today the opposition has showed that the number of its senators is complete and tomorrow the cameras will capture that in the Senate.”\nDurrani said that a petition would be filed in the Supreme Court against censorship on media.",
            "“On July 25, public’s lack of confidence in the government will be seen,” he added.",
            "He accused the ruling Pakistan Tehreek-e-Insaf of resorting to rigging in the tribal areas’ polls. “Even after rigging, they only managed to bag five seats,” said Durrani, adding that proof of rigging had started to come forward."
        ]
    },
    {
        "sr_no": 83,
        "newspaper": "Tribune",
        "headline": "PM Imran arrives on three-day visit to US",
        "link": "https://tribune.com.pk/story/2017349/1-pm-imran-leaves-us-three-day-visit/",
        "brief": "",
        "date": "July 20, 2019",
        "detailed_news": [
            "Prime Minister Imran Khan has arrived in Washington on his three-day visit to the United States in the wee hours of Sunday.",
            "The prime minister is visiting Washington on the invitation of President Donald Trump.",
            "The premier is accompanied by Adviser to PM on Commerce Abdul Razzak Dawood, Special Assistant on Overseas Zulfi Bukhari and Army Chief General Qamar Javed Bajwa while Foreign Minister Shah Mehmood Qureshi is already in Washington as part of the entourage.",
            "CEO of Qatar Airways Akbar Albaker called on Prime Minister Imran Khan in Doha, Qatar on Saturday morning during transit to Washington.",
            "‘Austerity drive’: PM Imran to fly on commercial flight to US",
            "This is Imran Khan’s maiden visit to the United States after assuming office.",
            "The trip was originally planned in June but was postponed because of the PM’s prior domestic engagements, including the federal budget.",
            "The prime minister is expected to discuss regional issues with US President Donald Trump during his visit.",
            "Relations between Pakistan and the US have remained strained since Trump took charge of the White House.",
            "Imran Khan’s US visit: courting an unpredictable ally",
            "Trump, highly critical of Pakistan’s role in Afghanistan and overall war on terror, suspended the security and other assistance to Pakistan.",
            "Last year he and PM Imran had a war of words on Twitter after the US president reiterated his allegations against Pakistan for “playing a double game”.",
            "Pakistani officials, however, feel that direct interaction between PM Imran and Trump can help address some of the misgivings."
        ]
    },
    {
        "sr_no": 84,
        "newspaper": "Tribune",
        "headline": "\nPresident Trump gifts cricket bat to PM Imran\n",
        "link": "https://tribune.com.pk/story/2019386/1-president-trump-gifts-cricket-bat-pm-imran/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "WASHINGTON: Prime Minister Imran Khan was gifted a cricket bat by US President Donald Trump along with the picture of President Eisenhower – the only US President who had watched a Test match in Pakistan.",
            "President Trump said that it is a great honour to have a “very popular, a great athlete, one of the greatest, the prime minister of Pakistan.”",
            "PM Imran arrives on three-day visit to US",
            "Underscoring PM Imran’s leadership, the US president said that “a lot of things are happening for the US, and I think a lot of great things are going to be happening for Pakistan too, under your leadership.  I really feel that”.",
            "The world cup winning captain on Sunday arrived in Washington on his three-day visit to the US on the invitation of President Trump.",
            "The premier was accompanied by Adviser to PM on Commerce, Abdul Razzak Dawood, Special Assistant on Overseas, Zulfi Bukhari, and Chief of the Army Staff, General Qamar Javed Bajwa, while Foreign Minister Shah Mehmood Qureshi was already in Washington as part of the entourage."
        ]
    },
    {
        "sr_no": 88,
        "newspaper": "Tribune",
        "headline": "\nPolling underway in Ghotki by-polls\n",
        "link": "https://tribune.com.pk/story/2019562/1-polling-underway-ghotki-polls/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "Polling is underway in National Assembly constituency NA-205 as a tough competition is expected between Pakistan Peoples Party’s (PPP) Sardar Muhammad Bux Khan Mahar and independent candidate Ahmed Ali Mahar.",
            "Over 300,000 people are expected to cast their votes after the seat fell vacant after the death of Sardar Ali Muhammad Khan Mahar who won the general election in 2018.",
            " ",
            "The police, Sindh Rangers and Pakistan Army officers are present in polling stations to any untoward incident.",
            "Nisar Khuhro – President of PPP Sindh said that Pakistan Tehreek-e-Insaf (PTI) member Haleem Adil Sheikh – along with other members of parliament – are inside the polling stations and are stopping voters from entering.",
            "He asserted that the Election Commission of Pakistan (ECP) should take note of the rigging process.",
            "All set for showdown in Ghotki by-poll today",
            "Haleem Adil Sheikh claimed that he – along with other party members – has not been inside the polling station but PPP members Khursheed Shah, Nasir Shah, Nisar Khuhro and Anwar Siyal were inside.",
            "The ECP in June issued a show-cause notice to Prime Minister Imran Khan for visiting Ghotki ahead of the NA-205 by-election in violation of the commission’s code of conduct.",
            "Imran was in Ghotki on a visit that the ruling party PTI said was to condole the death of former federal minister Sardar Ali Muhammad Khan Mahar.",
            "The notice was issued after a complaint was lodged by Pakistan Peoples Party’s (PPP) NA-205 Ghotki-II candidate, Abdul Bari Pitafi."
        ]
    }
]