[
    {
        "sr_no": 5,
        "newspaper": "kashmir Times",
        "headline": "Civilian injured in Pak shelling in Poonch",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92933",
        "brief": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the se...",
        "date": "7/24/2019 3:07:43 PM",
        "detailed_news": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the second consecutive day on Tuesday.One civilian sustained minor injuries during ceasefire at 20.00 hours. The injured has been identified as Sher Mohd, 45, son of Mohammed Muneer resident of Mohalla  Bahchari Baloni.Defense PRO Lt Col Devender Anand, while confirming ceasefire violation by Pakistan, said, “This afternoon Pakistani army violated ceasefire in Dalhan sector of Poonch district. Indian army retaliated with equal caliber.”“Later Pakistan violated the ceasefire in Krishna Ghati, Mankote & Mendhar sectors of Poonch district. Pak initiated unprovoked ceasefire violation at around 1220 hours along LoC with firing of small arms in Poonch sector. Indian army befittingly retaliated the cross-border firing by the Pakistani army,’ he added.Local army sources said this afternoon at about 12.20 PM, Pakistani army opened indiscriminate fire towards Indian forward posts and civilian areas in Dalhan sector in Haveli. “Heavy mortar shelling was witnessed during ceasefire violation which was retaliated by India in equal measure. Both sides exchanged heavy gun fire and mortar shelling in the area,” Mohammed Sadiq, a local said. “In Pak shelling, two houses in our village were partially damaged. A number of forward LoC locations remained affected due to shelling and civilians were forced to remain inside their houses. The exchange of fire stopped at around 2.55 PM,” he added.Later this afternoon at around 3.25 PM, Pakistani army initiated unprovoked firing and shelling along the LoC in Krishna Ghati, Mankote sectors of Mendhar tehsil of Poonch district. Indian side too retaliated effectively and strongly.This was the third such violation in the past four days which left an army jawan dead and a civilian injured, the officials said. On Monday, Rifleman Mohammad Arif Shafi Alam Khan Pathan was killed in unprovoked firing by Pakistani troops in Sunderbani sector of Rajouri district.A civilian was injured in Pakistani firing in Balnoi village along the LoC in Mendhar sector of Poonch district on Saturday."
    },
    {
        "sr_no": 6,
        "newspaper": "kashmir Times",
        "headline": "Teenager shoots herself to death in Reasi",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92912",
        "brief": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. \r\nPolice stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at p...",
        "date": "7/24/2019 1:04:04 PM",
        "detailed_news": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. Police stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at present staying at Mamankote in the house of her maternal uncle Chamail Singh, son of Punjab Singh, who is serving in Indian army and presently posted in Haryana. “This evening she shot herself with her maternal uncle’s 12 bore rifle and died on spot. A case in this regard registered at Police Station Chassana and police started investigation to find the cause behind this extreme step,” police added."
    },
    {
        "sr_no": 8,
        "newspaper": "kashmir Times",
        "headline": "Rifleman killed in Pak firing in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92909",
        "brief": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.\r\nPRO Defence Lt Col Devender Anand, while confir...",
        "date": "7/24/2019 1:02:45 PM",
        "detailed_news": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.PRO Defence Lt Col Devender Anand, while confirming the ceasefire violation by neighbouring nation and death of a soldier, said, “Pakistan resorted to unprovoked ceasefire violation on the Line of Control (LoC). It resorted to mortar shelling and firing of small arms in the Sunderbani sector in the early hours. In the incident, Rifleman Mohammed Atif Shafi Alam Khan Pathan was critically injured. Rifleman was air evacuated to army hospital, where he succumbed to the injuries.”  “Indian troops responded strongly and inflicted heavy damage to Pakistan army posts and casualties to Pakistan soldiers in retaliation. However, the details of the damage on the Pakistan side are yet to be ascertained,” he added.“Rifleman Pathan, a young soldier, belonged to village Nawayard, tehsil Fatehganj district Vadodara, Gujarat and is survived by his parents, father Shafi Alam Khan Pathan and mother Habiban Banu. Rifleman Mohammed Atif Shafi Alam Khan Pathan was a brave, highly motivated and sincere soldier. The nation will always remain indebted to him for the supreme sacrifice and devotion to duty,” Defence spokesperson Lt Col Anand said.A police official said the cross-border firing started around 6.30 AM and continued intermittently for several hours, causing panic among the border residents who were advised to take necessary precautionary measures for their safety. This was the second ceasefire violation by Pakistan along the LoC in Jammu region in last three days.On Saturday, during the visit of Defence Minister Rajnath Singh to different parts of the state, Pakistani troops targeted Mendhar sector of Poonch district causing bullet injuries to a civilian in Balnoi village."
    },
    {
        "sr_no": 19,
        "newspaper": "kashmir Times",
        "headline": "Onus, now, on separatists: Rajnath",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92827",
        "brief": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.\r\nHis assertion came with a reminder that he had al...",
        "date": "7/21/2019 12:48:14 PM",
        "detailed_news": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.His assertion came with a reminder that he had already made exhaustive efforts to bring them to dialogue table as the Home Minister of the country, (in first tenure of Modi-government). Now it’s for them (separatists) to act to make things move - whatever way, he plainly told when queried about stand-off on the need of political initiative in Kashmir after effectively containing militancy in the Valley, as claimed by the government. The Defence Minister was speaking to media persons after inaugurating the 1000-meter long Ujh bridge along the International Border (IB) in Kathua district. “What stand-off..? There’s no stand-off. Jitni Pehl Iss Desh Key Griha-Mantri Ko Karni Chahiye Thi Utni Pehl To Maine Pehle Kardi… Ab Uskay Baad Woh Faisla Karengay Key Kya Karna Hai.. (The efforts and initiatives, expected from the Home Minister of this country, have already been exhausted by me in my tenure as the Union Home Minister… Now it is for them to take a call as what they want to do…),” he said.  Responding to another query related to “Operation All–Out” in the Valley to weed-out terrorism, Rajnath said that day was not far off to achieve that mark. “There are no two opinions about it that the Kashmir will get rid of terrorism very soon. Rest assured….it’s going to happen very soon. More so, I believe- as in case of any act of terror occurring anywhere in the world, the way the international community is rallying around on one platform, joining hands to take on this threat, it (terrorism) will be wiped out of - not only Kashmir, Jammu ...but the entire world,” he said.What was that challenge which was main obstacle in resolving Kashmir, in the Defence Minister’s opinion as he had earlier served as the Union Home Minister also? Faced with this query, Rajnath said, “There’s no need to analyse that challenge here. Whatever be the challenge, it will be tackled. We very well know all the reasons, we’ll sort them out and J&K will be rid of terrorism, for sure.”   In response to queries related to recurrent ceasefire violations by Pakistan on IB and LoC, even on the day of his visit to J&K today and the probability of another Kargil-like misadventure by the neighbouring nation (Pak), his terse reply was, “This message is for all the countrymen- Have faith in our country’s leadership - the Prime Minister Narendra Modi and the valiant jawans and officers of our armed forces. They will not let down your faith in them.”Earlier he said, “I’ve just returned from Kargil. Accompanied by the Army Chief General Bipin Rawat and Union Minister of State in PMO Dr Jitendra Singh, I saw those majestic peaks, which were freed from the clutches of Pakistan by our valiant soldiers by laying down their lives yet not before incurring a crushing defeat to the enemy and failing its evil designs. I’ve just witnessed the testimonies to their (gallant soldiers’) valour and heroic deeds which earned India a proud victory.”Rajnath stated that the Ujh bridge, which as per Director General-Border Road Organisation’s assertion, was the longest bridge constructed by the organization anywhere in the country, would ease problems of border residents related to connectivity. “In the form of bridge, the long pending demand of border residents has been realized. The strenuous efforts of Border Road Organisation (BRO) to complete this bridge in stipulated period despite lot of problems and hostile conditions are, undoubtedly, laudable,” the Defence Minister said."
    },
    {
        "sr_no": 43,
        "newspaper": "Greater Times",
        "headline": "Army chief Rawat fights misuse of disability pension",
        "link": "https://www.hindustantimes.com/india-news/rawat-fights-misuse-of-disability-pension/story-JMVABGI9LykOGntX299r0J.html",
        "brief": "",
        "date": "Fri, 26 Jul 2019 03:12:08 GMT ",
        "detailed_news": "As a young company commander in the Uri sector, Gen Rawat had his ankle smashed by a huge boulder. Then, as Commander of III Corps, he dislocated his vertebra. He wears a wound medal on his chest, but has no intention of either taking disability pension or the accompanying tax benefits."
    },
    {
        "sr_no": 64,
        "newspaper": "Dawn",
        "headline": "North Korea says new missile a 'solemn warning' to South",
        "link": "https://www.dawn.com/news/1496315/north-korea-says-new-missile-a-solemn-warning-to-south",
        "brief": "",
        "date": "July 26, 2019",
        "detailed_news": [
            "North Korean leader Kim Jong Un has said two missiles fired under his supervision were newly designed tactical weapons that sent a “solemn warning” to the South over plans to hold military drills with the United States. ",
            "Thursday's missile tests were the first since Kim and US President Donald Trump agreed to resume nuclear talks during an impromptu meeting last month in the demilitarised zone between North and South Korea. ",
            "That working-level dialogue has yet to begin and, even before Thursday's launches, Pyongyang had warned the talks could be derailed by Washington and Seoul's refusal to scrap joint military exercises scheduled for next month. ",
            "North Korean state media provided no technical specifications, but said on Friday the latest tests were of a “new-type tactical guided weapon” that sent a “solemn warning to the South Korean warmongers” over their insistence on holding the joint drills “in defiance of repeated warnings”. ",
            "There are close to 30,000 US troops stationed in South Korea and their annual manoeuvres with South Korean soldiers have always infuriated Pyongyang. ",
            "South Korean military monitors said the two short-range missiles fired on Thursday flew nearly 450 kilometres and 700 kilometres respectively, before splashing down in the sea between the Korean peninsula and Japan. ",
            "That range would allow them to hit any target in South Korea. ",
            "Japan's defence minister called the launches “extremely regrettable” while Seoul's National Security Office expressed “strong concern” and the US called for an end to such “provocations”. ",
            "According to state-run KCNA, Kim said the new “state-of-the-art” missiles were capable of low-altitude flight that made them difficult to intercept and cautioned Seoul against “ignoring the warning” implicit in their development. ",
            "US Secretary of State Mike Pompeo said he believed the working-level talks would still go ahead, and that the latest tests were a negotiating tactic. ",
            "“Everybody tries to get ready for negotiations and create leverage and create risk for the other side,” Pompeo said in an interview with Bloomberg Television. ",
            "“We remain convinced that there's a diplomatic way forward, a negotiated solution to this,” he said, adding he was unconcerned at the delay in getting back to the table. ",
            "“If it takes another two weeks or four weeks, so be it,” he said. ",
            "Pyongyang carried out similar short-range launches in May, which Trump dismissed at the time as “very standard stuff” — an assessment he repeated after the latest tests on Thursday. ",
            "“They really haven't tested missiles other than smaller ones, which is something that lots test,” the president said in an interview with Fox News.",
            "Thursday's launches came a day after US National Security Advisor John Bolton — an arch-hawk regularly vilified by North Korean state media — spoke with senior South Korean officials in Seoul."
        ]
    },
    {
        "sr_no": 75,
        "newspaper": "Dawn",
        "headline": "The world is witnessing a new normal — thanks to Trump, Khan, Modi, Duarte, Erdogan and Johnson",
        "link": "https://www.dawn.com/news/1496304/the-world-is-witnessing-a-new-normal-thanks-to-trump-khan-modi-duarte-erdogan-and-johnson",
        "brief": "",
        "date": "Updated July 26, 2019",
        "detailed_news": [
            "PRIME MINISTER Imran Khan and US President Donald Trump presented quite a spectacle when they came together at the White House earlier this week. Much has been said and written about the chemistry, charisma and clarity on show, the absurdity of it all seemingly a side note. Pakistan, the US and the world at large appears to have got used to a new normal.",
            "The Indian subcontinent was ruled by the British for almost 200 years. For much of that time, ordinary Indians — and this included large segments of the educated elite — thought it was perfectly normal for a few thousand white men to rule over hundreds of millions of Indians. We imbibed the colonial logic that British rule was necessary for otherwise backward Indian natives to be ushered into the modern age. To put it simply, we were convinced by Rudyard Kipling’s infamous myth of ‘the white man’s burden’.",
            "Then came a political awakening, a recognition that colonialism was in fact not a blessing, but a curse — our resources expropriated, our bodies and minds enslaved, the freedom movement struggled for a new normal to be established. The end of the British Raj heralded exactly that.",
            "What followed was a country called Pakistan, in which sons and daughters of the soil would enjoy the right to self-determination and the excesses of colonialism would give way to peace and justice for all. This never happened, an emergent military establishment and a pliant coterie of political elites representing continuity rather than change. Yet, a new normal took root anyway: all Pakistanis were equal and free in name, but unequal and un-free in reality.",
            "The new normal  has been pushed even further to the right.",
            "A similar parallel existed at the global level. The era of European colonialism had ended, all nations in principle equal and free. But in practice the dominance of Euro-American societies was intact, and the ex-colonies subject to the whims of an emergent informal empire, Washington its capital.",
            "At different points over the past 70 years, what is considered normal has changed, both in Pakistan and around the world. Most notably, in the late 1960s and 1970s, ordinary working people believed firmly that they could come together and change the world, to fulfil the promise of national liberation movements and revolutionary struggles at their peak. Domestic ruling classes and imperialist powers could be upended by the wretched of the earth. ",
            "It was perfectly normal for ordinary people to believe that the world could be changed, and to dedicate themselves to doing so. This represented such a threat to entrenched elites everywhere that a new normal had to be forged yet again. From the 1980s onwards, ruling classes all over the world presided over a period of great repression. More importantly, a new normal was propagated through media, education and other means — that a world free of exploitation and injustice is an impossibility. ",
            "By the 1990s, younger generations had come to believe that There is No Alternative (TINA). Margaret Thatcher insisted that the idea that we share of collective interests is simply hogwash, a distraction from the imperative of individual advancement. ",
            "Today, we have seen the new normal pushed even further to the right of Thatcher, thanks to Trump, Khan, Modi, Duarte, Erdogan and the most recent member of the new populist club to acquire governmental power, Boris Johnson. Whether they admit it or not, these upstarts have little understanding of the deep contradictions of the global order, or their own conflict-ridden societies. They engage in a politics of name-calling and sensationalism, Trump’s boast that he could kill 10m Afghans a classic example. Herd behaviour is the result, large numbers of ordinary people poisoned into believing that the new normal of Trump, Khan, Modi, etc is actually an affront to the status quo, when in fact it is simply exacerbating inequality, injustice and un-freedom. ",
            "Mercifully, societies are not monoliths, so whenever a new draconian normal takes root, there are always forces who speak out for the oppressed. But it is clear that as more and more ordinary people become integrated into a digital political sphere in which melodrama rules, states and corporations will become more adept at manipulating ‘public opinion’ in ways that even European colonial rulers could never have imagined. ",
            "Pakistan is a perfect example. For most of the last two decades, the media, the political right and state institutions have stoked an anti-American narrative across society. Over the past few days, we have been convinced that all is well now that Trump likes Imran Khan. For his part, the prime minister insists that the whole country, including the armed forces, are with him. Apparently, those with a different point of view are troublemakers preventing Pakistan from attaining peace and prosperity. Sounds like something Trump would say, doesn’t it? ",
            "A new normal has indeed been unleashed, and we better not just get used to it.",
            "The writer teaches at Quaid-i-Azam University, Islamabad.",
            "Published in Dawn, July 26th, 2019"
        ]
    },
    {
        "sr_no": 82,
        "newspaper": "Tribune",
        "headline": "Time to make progress on success of Trump-Imran meeting: State Dept",
        "link": "https://tribune.com.pk/story/2021648/1-time-make-progress-success-trump-imran-meeting-state-dept/",
        "brief": "",
        "date": "July 26, 2019",
        "detailed_news": [
            "The United States has said that it is time for Washington to build upon progress on the success of Prime Minister Imran Khan’s first meeting with President Donald Trump and Secretary of State Mike Pompeo.",
            "State Department Spokesperson Morgan Ortagus, in her weekly press conference, said the visit helped President Trump and Secretary Pompeo build a personal connection and rapport with the Pakistani premier.",
            "“This meeting, of course, gave the chance for the president and the secretary to meet with Prime Minister [Imran] Khan, to build a personal connection and rapport. And now we think it’s time to make progress on the success of this first meeting,” she explained.",
            "President Trump will visit Pakistan soon: PM Imran",
            "When asked how the State Department sees the Pak-US and Pak-India ties progressing after Imran’s US trip, the spokesperson said, “I would note one of the things that the prime minister says that he vowed to urge the Taliban to negotiate with the Afghan government. We are committed to peace in Afghanistan. We think that was an important step.”",
            "“And there was a number of issues that were discussed not only in the president’s meeting but with the secretary’s meeting as well, and now is the time to build upon that meeting and to build upon those commitments,” Ortagus continued.",
            "When asked about Imran’s statement that there would be good news on US hostages soon, Ortagus said the Trump administration had a “very strong record, actually, on getting American hostages returned”.",
            "“We take human lives incredibly seriously, and we will use every means available at our disposal to secure and to see the secure and safe return of American citizens who are held hostage abroad. The prime minister [Imran Khan] did say that. We are, of course, working closely with the Pakistanis on recovering them. We think his statements were helpful and we’re of course hopeful that there will be some action proceeding those statements.”",
            "Trump offers to mediate on Kashmir dispute",
            "President Trump gave a warm reception to PM Imran and his delegation including the Chief of Army Staff (COAS) Gen Qamar Javed Bajwa and the head of the ISI intelligence service in the US.",
            "The premier returned home from Washington on July 25 after the visit seen by supporters as a major diplomatic success, saying he felt like he had when he came back after winning the cricket World Cup.",
            "PM Imran said Pakistan was able to present itself on equal terms with Washington. He was also positive the US president would also soon visit Pakistan."
        ]
    },
    {
        "sr_no": 87,
        "newspaper": "Tribune",
        "headline": "Afghan Taliban say ready to meet PM Imran",
        "link": "https://tribune.com.pk/story/2021245/1-will-visit-pakistan-pm-imran-extends-invitation-afghan-taliban/",
        "brief": "",
        "date": "July 25, 2019",
        "detailed_news": [
            "ISLAMABAD: Afghan Taliban are ready to send their delegation to Pakistan for a meeting with Prime Minister Imran Khan if Islamabad extends formal invitation, the insurgent group that has been fighting against the US and Washington backed Kabul administration since 2001 announced on Thursday.",
            "“Pakistan is our neighbouring and Muslim country. We will definitely visit Pakistan if we are given formal invitation,” Sohail Shahin, spokesperson of Taliban’s Political Office in Doha, told BBC Urdu.",
            "“Taliban representatives frequently undertake visits to neighbouring and regional countries,” the spokesperson added. The militant group is currently holding talks with the US in Doha to find a political solution to the 18 year long war.",
            "The statement from Taliban came just a day after Prime Minister Imran Khan completed a ‘successful’ visit to the US. During his three-day visit, Afghan endgame remained on top of the agenda.",
            "While the US acknowledged Pakistan’s role in facilitating the ongoing talks, the Trump administration now wants Islamabad to persuade Taliban for permanent ceasefire and intra-Afghan dialogue.",
            "Imran, before wrapping up the all-important visit to Washington, said he assured President Trump that Pakistan would do ‘whatever in its power to facilitate the Afghan peace process.’",
            "He also indicated that he would meet the Afghan Taliban to convince them for a peace deal.",
            "In February, a Taliban delegation was to visit Islamabad for a meeting with Prime Minister Imran. The visit, however, was cancelled at the last minute after reservations expressed by Afghan government.",
            "PM visit ‘reset Pak-US ties’",
            "Meanwhile, foreign office spokesperson Dr Muhammad Faisal termed the outcome of the PM’s visit to Washington as beyond Pakistan’s expectations.",
            "“The visit of Prime Minister Imran Khan has brought a new impetus in relations between Pakistan and USA. The ties between the two countries have been reset,” Faisal told reporters at the weekly briefing.",
            "He said it was indeed a “very positive and successful visit.”  Relations between Pakistan and US were stalled at least since 2015, he admitted.",
            "“I would reiterate that the intent to enhance bilateral relations between Pakistan and the US has been expressed and now the relevant mechanisms will begin functioning to work out details of implementation,” the spokesperson added.",
            "On uproar in India after President Trump’s claim that Indian PM Narendra Modi recently requested him to mediate on Kashmir dispute between Pakistan and India, the spokesperson urged India and its media to respond “maturely whenever the Jammu and Kashmir dispute is discussed”.",
            "“As you have witnessed that soon after President Trump announced to play a mediatory role, different segments of Indian media started panicking and making all sorts of allegations.",
            "“As I said earlier, the only viable solution of Jammu and Kashmir dispute is through dialogue and diplomacy and full implementation of the UN Security Council Resolutions,” Faisal said."
        ]
    },
    {
        "sr_no": 97,
        "newspaper": "Daily Excelsior",
        "headline": "Pak did not learn its lesson despite Kargil defeat: Eastern Army Commander",
        "link": "https://www.dailyexcelsior.com/pak-did-not-learn-its-lesson-despite-kargil-defeat-eastern-army-commander/",
        "brief": "",
        "date": "Fri, 26 Jul 2019 05:26:24 +0000",
        "detailed_news": "<p>KOLKATA : Despite a &#8220;resounding defeat&#8221; in Kargil, Pakistan does not seem to have learnt its lesson as it continues to indulge in ceasefire violations, Eastern Army Commander Lt General M M Naravane said on Friday. Asserting that the Army is always ready to face any situation, the general officer commanding-in-chief (GOC-in-C), Eastern Command, said, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com/pak-did-not-learn-its-lesson-despite-kargil-defeat-eastern-army-commander/\">Pak did not learn its lesson despite Kargil defeat: Eastern Army Commander</a> appeared first on <a rel=\"nofollow\" href=\"https://www.dailyexcelsior.com\">Jammu Kashmir Latest News | Tourism | Breaking News J&amp;K</a>.</p>\n"
    }
]