[
    {
        "sr_no": 11,
        "newspaper": "kashmir Times",
        "headline": "Onus, now, on separatists: Rajnath",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92827",
        "brief": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.\r\nHis assertion came with a reminder that he had al...",
        "date": "7/21/2019 12:48:14 PM",
        "detailed_news": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.His assertion came with a reminder that he had already made exhaustive efforts to bring them to dialogue table as the Home Minister of the country, (in first tenure of Modi-government). Now it’s for them (separatists) to act to make things move - whatever way, he plainly told when queried about stand-off on the need of political initiative in Kashmir after effectively containing militancy in the Valley, as claimed by the government. The Defence Minister was speaking to media persons after inaugurating the 1000-meter long Ujh bridge along the International Border (IB) in Kathua district. “What stand-off..? There’s no stand-off. Jitni Pehl Iss Desh Key Griha-Mantri Ko Karni Chahiye Thi Utni Pehl To Maine Pehle Kardi… Ab Uskay Baad Woh Faisla Karengay Key Kya Karna Hai.. (The efforts and initiatives, expected from the Home Minister of this country, have already been exhausted by me in my tenure as the Union Home Minister… Now it is for them to take a call as what they want to do…),” he said.  Responding to another query related to “Operation All–Out” in the Valley to weed-out terrorism, Rajnath said that day was not far off to achieve that mark. “There are no two opinions about it that the Kashmir will get rid of terrorism very soon. Rest assured….it’s going to happen very soon. More so, I believe- as in case of any act of terror occurring anywhere in the world, the way the international community is rallying around on one platform, joining hands to take on this threat, it (terrorism) will be wiped out of - not only Kashmir, Jammu ...but the entire world,” he said.What was that challenge which was main obstacle in resolving Kashmir, in the Defence Minister’s opinion as he had earlier served as the Union Home Minister also? Faced with this query, Rajnath said, “There’s no need to analyse that challenge here. Whatever be the challenge, it will be tackled. We very well know all the reasons, we’ll sort them out and J&K will be rid of terrorism, for sure.”   In response to queries related to recurrent ceasefire violations by Pakistan on IB and LoC, even on the day of his visit to J&K today and the probability of another Kargil-like misadventure by the neighbouring nation (Pak), his terse reply was, “This message is for all the countrymen- Have faith in our country’s leadership - the Prime Minister Narendra Modi and the valiant jawans and officers of our armed forces. They will not let down your faith in them.”Earlier he said, “I’ve just returned from Kargil. Accompanied by the Army Chief General Bipin Rawat and Union Minister of State in PMO Dr Jitendra Singh, I saw those majestic peaks, which were freed from the clutches of Pakistan by our valiant soldiers by laying down their lives yet not before incurring a crushing defeat to the enemy and failing its evil designs. I’ve just witnessed the testimonies to their (gallant soldiers’) valour and heroic deeds which earned India a proud victory.”Rajnath stated that the Ujh bridge, which as per Director General-Border Road Organisation’s assertion, was the longest bridge constructed by the organization anywhere in the country, would ease problems of border residents related to connectivity. “In the form of bridge, the long pending demand of border residents has been realized. The strenuous efforts of Border Road Organisation (BRO) to complete this bridge in stipulated period despite lot of problems and hostile conditions are, undoubtedly, laudable,” the Defence Minister said."
    },
    {
        "sr_no": 16,
        "newspaper": "kashmir Times",
        "headline": "Army pays tribute to brave-heart",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92766",
        "brief": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. \r\nToday, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid hom...",
        "date": "7/19/2019 10:28:45 AM",
        "detailed_news": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. Today, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid homage to the martyr on behalf of a proud nation.Singh was 35 years old and had joined the Army in 2002. He belonged to Village Tibba of Dhuri Tehsil in Sangrur District of Punjab and is survived by wife, a son and a daughter."
    },
    {
        "sr_no": 19,
        "newspaper": "kashmir Times",
        "headline": "Village girl turned IAF fighter pilot inspiring J&K youngsters",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92763",
        "brief": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. \r\nIn a series of motivational lectures, Thakur told s...",
        "date": "7/19/2019 10:28:04 AM",
        "detailed_news": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. In a series of motivational lectures, Thakur told students on Thursday that the decision to come to Bhadarwah to take part in the \"Sangam Youth Festival\" organised by the army changed her life forever as she decided to join the armed forces. Hailing from Billan Bowlian in Udhampur district, Thakur joined the IAF as a fighter pilot this year, one of the first few women in the country to have done so. Her motivational lectures, organised by the Rashtriya Rifles unit based at Bhadarwah, are inspiring youngsters, especially girls, in the state to make a mark in life. “I decided that I had to go for it, whatever it took. I would want every young boy and girl wanting to become a fighter pilot to dream big,” Thakur told. In her message to the students of Kendriya Vidyalaya and PG College Bhadarwah, she said, “Your dreams may seem unconquerable at the moment. But you must chase those so hard that they become reality.” Stating that a \"combination of average qualities\" in her made her unique, Thakur said, “I climbed the ladder step by step, committing some mistakes as well, but kept going as I learned it the hard way. Instead of mourning over your failures and get into self pity, you should work harder to achieve your goals.” She said being an NCC cadet helped her keep her nerves in the most difficult situations. The lectures were followed by question-answer sessions with the students. Aarushi, a Class 12 science student of Kendriya Vidyalaya, said she always thought becoming a doctor was the only option for her but Thakur''s words changed that. “I already feel like flying as joining the army is my childhood dream. I will definitely strive harder to make my dream a reality,” she said. Komal Katal (27) of Garh Bhadarwah village said, “I always wanted to join the Army but in this part of the state, I never got an opportunity to try my luck. Although I could not appear in AFCAT (Air Force Common Admission Test) because of the age bar, after attending the lecture of Jubiksha, I will work harder and give it a try to join the Territorial Army.” Besides Thakur, Commanding Officer, 4 Rashtriya Rifles Colonel D D Pandey also shared his experiences with the students. “You should be passionate about your dreams and to reach your destination, you should not hesitate and think longer to take your first step. Just start your journey today and you will definitely reach your destination,” he said."
    },
    {
        "sr_no": 35,
        "newspaper": "Greater Times",
        "headline": "BSF commanders asked to spend 25 nights a month at posts along border",
        "link": "https://www.greaterkashmir.com/news/national-2/bsf-commanders-asked-to-spend-25-nights-a-month-at-posts-along-border/?utm_source=rss&utm_medium=rss&utm_campaign=bsf-commanders-asked-to-spend-25-nights-a-month-at-posts-along-border",
        "brief": "The BSF has directed its battalion commanders to spend at least 25 nights in a month at a forward post along the India-Pakistan International Border (IB) in Jammu as part of its renewed efforts to fortify the &#8216;anti-infiltration&#8217; grid in this region, official sources said Tuesday. The commandants and their second-in-command officers have been asked<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/national-2/bsf-commanders-asked-to-spend-25-nights-a-month-at-posts-along-border/\">Read More</a>",
        "date": "Tue, 23 Jul 2019 20:26:10 +0000",
        "detailed_news": ""
    },
    {
        "sr_no": 45,
        "newspaper": "Hindustan Times",
        "headline": "\nMurdered rifleman Aurangzeb’s brothers join army, vow to avenge his death\n",
        "link": "http://www.hindustantimes.com/india-news/murdered-rifleman-aurangzeb-s-brothers-join-army-vow-to-avenge-his-death/story-mN6UEKzcEcXGowb84m6EVI.html",
        "brief": "",
        "date": "Jul 23, 2019 14:53 IST",
        "detailed_news": [
            "Two brothers of an Indian Army soldier, who was abducted and killed by militants last year, have joined the armed forces to “serve the nation and avenge his death”.",
            "Mohammed Tariq, 23, and Mohammed Shabbir, 21, attended an enrolment parade of 100 new recruits in the Territorial Army in Rajouri on Monday, according to a defence spokesperson.",
            "“They were enrolled into a territorial battalion on Monday and now they will undergo training at Punjab Regimental Centre,” the spokesperson said.",
            "They posed with their parents Mohammed Hanif and Raaj Begum after donning the olive green. Hanif is also a former army man. ",
            "Aurangzeb was abducted in Pulwama and later killed by armed terrorists on June 14, 2018, when he was on his way back home in Poonch to celebrate Eid with his family. He was a rifleman in the army’s 44 Rashtriya Rifles. ",
            "“Our brother gave his life for the nation and we will also follow his footsteps. We will not step back when it comes to sacrificing our lives for the nation. We will make him proud and will make Punjab regiment proud by our duty,” said Tariq.",
            "Their father Hanif, a former Jammu and Kashmir Light Infantry soldier, said he may not live to see the “day but his two sons will take revenge of their brother Aurangzeb’s killing.”",
            "“Tariq and Shabbir also want to serve the nation and protect their fellow citizens. Yes, I have lost my son Aurangzeb and death lurks a soldier but then not many have the guts to sacrifice their life for the nation,” he said while speaking to HT over the phone.",
            "“Aurangzeb was trapped and then killed by the cowards. We still miss him,” Hanif said.",
            "Hanif joined the Bharatiya Janata Party (BJP) earlier this year in the presence of Prime Minister Narendra Modi at a public rally in Vijaypur area of Samba district.",
            "Also read | Militant involved in armyman’s murder among 4 killed in Valley",
            "\n\n"
        ]
    },
    {
        "sr_no": 58,
        "newspaper": "Dawn",
        "headline": "US finally gets a new Pentagon chief as Senate confirms Esper\n",
        "link": "https://www.dawn.com/news/1495751/us-finally-gets-a-new-pentagon-chief-as-senate-confirms-esper",
        "brief": "",
        "date": "July 24, 2019",
        "detailed_news": [
            "The United States Senate on Tuesday confirmed former soldier Mark Esper as secretary of defence, filling America's longest-ever Pentagon leadership vacuum as Washington faces mounting tensions with Iran and struggles to end its long war in Afghanistan.",
            "President Donald Trump's second Defense Department chief will take over nearly seven months after the shock departure of Jim Mattis, the deeply respected career US Marine who broke with Trump over policy towards the Middle East and Afghanistan.",
            "Two others were made acting defense secretary this year to fill the void — including Patrick Shanahan, who served a six-month temporary stint but resigned for family reasons in June and withdrew from consideration for the full-time top post.",
            "Esper sailed through the confirmation process in lightning speed. He earned broad bipartisan support and was confirmed by a vote of 90 to 8.",
            "He is expected to take his oath of office later on Tuesday, according to the Pentagon.",
            "Esper's confirmation brings ballast to a Pentagon destabilised by the leadership revolving door since late December, and as the world's primary military power is engaged in two wars — in Syria and Afghanistan — and being tested by Tehran.",
            "Senate Majority Leader Mitch McConnell, the top Republican in Congress, hailed Esper, who served a two-year stint as secretary of the US Army beginning in 2017, as “a thoroughly well prepared nominee” who has the respect of the national security community and can hit the ground running.",
            "“The world is full of serious threats to America, to our allies and to our interests, not least among them obviously is Iran's insistence on continuing to ratchet up tensions in the Middle East,” McConnell said in a Senate floor speech on Monday.",
            "“Having a Senate-confirmed secretary of defense, especially one of this quality, could not come a moment too soon.”",
            "Esper has significant Middle East experience. He fought in Iraq during the Gulf War in 1991, and was part of the US Army's famed 101 Airborne Division known as the “Screaming Eagles”.",
            "He is also close to Secretary of State Mike Pompeo, with whom he studied at the prestigious West Point Military Academy. Both men graduated in 1986.",
            "On the political front, he served as an advisor for several lawmakers on Capitol Hill, including Republican senator Chuck Hagel, who later became secretary of defence under Democratic president Barack Obama. But his links with the defence industry raised eyebrows during his confirmation process.",
            "Democratic Senator Elizabeth Warren, a 2020 presidential candidate, highlighted Esper's potential conflicts of interest regarding his affiliation with defence contractor Raytheon, for whom he was a lobbyist when Trump tapped him for the army secretary post.",
            "“At the age of 18, I went to West Point, and I swore an oath to defend this constitution, and I embraced a motto called duty and honor and country,” he told Warren during his confirmation hearing.",
            "“And I've lived my life in accordance with those values ever since then,” he said, adding, \"I went to war for this country.\""
        ]
    },
    {
        "sr_no": 59,
        "newspaper": "Dawn",
        "headline": "Vote count underway in Ghotki NA-205\n",
        "link": "https://www.dawn.com/news/1495750/vote-count-underway-in-ghotki-na-205",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "The vote count is underway and initial results have started pouring in as polling for the general seat of the Sindh Assembly — NA-205 — Ghotki, concluded peacefully.",
            "Two powerful Mahars, who also happened to be maternal uncle and nephew, are contesting for the seat fallen vacant after the death of Ali Mohammad Khan Mahar, a former Sindh chief minister. The late Mahar was serving as the federal narcotics minister when he died.",
            "Pakistan Peoples Party (PPP) candidate Sardar Mohammad Bux Khan Mahar is taking on his nephew Ahmed Ali Mahar — the son of the late Ali Mohammad Khan Mahar — an independent candidate who is supposed to be a part of the PTI after elections. ",
            "Unofficial and unconfirmed results from 140 polling stations showed that Mohammad Bux Mahar was enjoying a lead of around 10,000 votes.",
            "The constituency had 360,875 registered voters including 204,891 male and 155,935 female voters. A total of 290 polling stations were set up which include 56 each for male and female voters while 178 were combined polling stations.",
            "Out of the total 290, the Election Commission of Pakistan (ECP) had declared 125 polling stations \"highly sensitive\" and 164 \"sensitive\".",
            "Strict security arrangements were put in place under the ECP’s directives. Army personnel were deployed inside the polling stations, despite opposition by the PPP.",
            "NA-205 covers PS-20 and PS-21 which were won by Ali Gohar Khan Mahar of the anti-PPP Grand Democratic Alliance (GDA) and his brother Ali Nawaz Khan Mahar alias Raja Mahar as a PPP candidate, respectively, in the July 25, 2018 general elections."
        ]
    },
    {
        "sr_no": 61,
        "newspaper": "Dawn",
        "headline": "Aid has been one of the biggest curses for Pakistan: PM Imran\n",
        "link": "https://www.dawn.com/news/1495748/aid-has-been-one-of-the-biggest-curses-for-pakistan-pm-imran",
        "brief": "",
        "date": "Updated Jul 24, 2019 05:16am",
        "detailed_news": [
            "Prime Minister Imran Khan, during an address delivered at the United States Institute of Peace on Tuesday, impressed upon the audience that Pakistan seeks a \"dignified relationship with the US\" which is not curtailed by the securing or withdrawal of aid.",
            "\"I would like to have a relationship between the two countries of mutual trust. I would like to have a relationship as equals, of friendship. Not as it has been before [...] Pakistan wanting aid from the US and then for aid it is expected to do certain things.",
            "\"The reason why I am happy leaving the US this time is that we now have a relationship based on mutual interest, which is peace in Afghanistan.”",
            "The premier said that he had been asked about whether there would be a request for funds to which he had said: \"I hate the idea of asking for funds. Aid has been one of the biggest curses for my country. What it has done is it has created the dependency syndrome.\"",
            "\"Countries rise because of self respect and self esteem. No country rises because of begging and borrowing for money,\" he added.",
            "He expressed confidence that there was \"convergence between the United States and Pakistan\" when it came to recognising that there is no military solution to deal with the war in Afghanistan.",
            "He said that he viewed the dynamic to be different now, as both sides were finally looking at things through the same lens.",
            "\"The Pakistan Army was fighting but they [the US] thought we are not doing enough [...] we had gone out of our way. But this time, we are all on the same page that only a political settlement through dialogue will work,\" said the prime minister.",
            "In January this year, US Secretary of State Michael Pompeo had emphasised a new \"sustainable\" strategy of the United States for fighting terrorism which seeks to end long, drawn-out wars",
            "“President Trump very much wants to end these long, drawn-out [wars] — 17 years now in Afghanistan,” the chief US diplomat had said.",
            "In today's discussion with Nancy Lindbord, the president of the United States Institute of Peace, PM Imran expressed hope that a political settlement to the Afghan war can be reached and that the relationship between the United States and Pakistan had great potential after this visit.",
            "When asked what makes things different now in the relationship between the two countries compared to the past, the premier said: \"I always felt [previously] that the relationship was never multi-pronged, always transactional.\"",
            "The premier, providing a backdrop to the circumstances that led to the present situation in Afghanistan, said that the 'jihadists' had been convinced to fight against the Soviets and once the 'jihad' was over, the US packed up and left and \"we were slapped with sanctions\".",
            "\"We were left with four million Afghan refugees [...] a number of militant groups created to fight the Soviets, all dressed up and nowhere to go, heroin, drugs — which at some point were used to pay for the fighting,\" he continued, to highlight the scale of the fallout after the war had ended.",
            "He said that after 9/11 Pakistan again joined the US [in the fight against terrorism]. ",
            "\"I only had one seat in parliament. When Gen Musharraf consulted us [on whether we should join the war] I opposed it and said we should stay neutral.\"",
            "He then went on to explain, why he felt it would have been in Pakistan's best interest to remain neutral.",
            "\"We had created these 'jihadi' groups in the 80s. We had indoctrinated them in the idea of 'jihad'. That foreign occupation in Afghanistan [...] it was a religious duty to fight them. So all these foreign groups, including Al Qaeda had arrived in Pakistan.\"",
            "\"Now comes 9/11. And the US invades Afghanistan. And now we are trying to tell the same groups, who had close links with the Pakistan Army — because they were created by the Pakistan Army — now we are telling them because the good guys are there, its no longer 'jihad'.\"",
            "\"Now obviously, a lot of them turned against the Pakistan Army because the Pakistan Army was then trying to neutralise them.\"",
            "The premier said that the years that followed were \"the worst time in our history\".",
            "\"These groups turned against the Pakistan Army and the State of Pakistan. And not only that, there were linkages between these groups and the Pakistan security forces because they had created them.",
            "\"We had insider attacks, the GHQ was attacked, the generals were killed, the ISI headquarters were attacked. The Army at one point could not go into the cities in military clothes or with military cars. It was that bad,\" said PM Imran, as he asserted his view of why Pakistan should have never gotten involved.",
            "\"The second thing was the tribal areas. We should never have sent our Army into the tribal areas. ",
            "\"The tribal area per capita was the most weaponised area in the world,\" he said, pausing to provide a brief history of the region that had been left autonomous post-British era and that had \"lived by its own rules\".",
            "\"In 2004, under pressure from the US, the Pakistan Army went into the tribal areas to flush out Al Qaeda. What happened was, after Tora Bora in Afghanistan, a few of the Al Qaeda moved down into our tribal areas which were semi-autonomous. When they sent the Army in [...] you know armies are not meant to go into civilian areas.",
            "\"Whenever you send your army into civilian areas there will always be human rights abuses because there is no [enemy] army there, there are just guerillas operating from villages.",
            "\"The collateral damage created what became the Pakistani Taliban. There was no Pakistani Taliban [group] before,\" he said.",
            "\"In my opinion, we should have stayed neutral. That way we would have control over these militant groups and we could have, in our own time, neutralised them,\" he added, before going on to say: \"But because we became a part of the US war, they turned against Pakistan.\"",
            "He said that what followed was a watershed moment in Pakistani politics, recounting the 2014 Army Public School massacre in which 150 school children were slaughtered by the TTP (Tehreek-i-Taliban Pakistan) — the Pakistani faction of the Taliban. ",
            "\"There was a reaction [to the APS tragedy] within Pakistan. All the political parties signed the NAP (National Action Plan) and we all decided that we will never allow any militant groups to operate within Pakistan.\"",
            "The premier said that because there had been such a sizable presence of these groups [estimating them to be around 30,000-strong] that had obtained \"training in some theatre — Afghanistan or Kashmir\", there had been a challenge which no one was willing to take previously.",
            "\"Prior to our government coming into power, past governments did not have the political will [...] we were the first government to start disarming militant groups. ",
            "\"We have taken over their institutes, their seminaries, we have [placed] administrators there. For the first time we have decided there will be no armed militias inside our country.\"",
            "Lindbord then talked about the ongoing Afghan peace process and the possibility of a breakthrough and asked whether the Pakistani government is able and willing to make the commitments to help move the dialogues forward, especially if the Taliban and the government are not able to get a meeting organised.",
            "To this, the premier responded by saying: \"The fear among the Pakistan military establishment was always that there would be a two-front situation. So there would be the eastern front, which is India, and if Afghanistan was also in the Indian sphere of influence then Pakistan would be sandwiched between the two.\"",
            "He said owing to this worry, the military always wanted what it called \"strategic depth\".",
            "\"But this has changed. Today there is no concept in Pakistan of strategic depth. Because we feel that by interfering in Afghanistan, in order to secure the strategic depth, we have actually done a lot of damage to our own country. And for no rhyme or reason we have become partisan in Afghanistan's internal affairs. ",
            "He said that in the past there was always this impression that Pakistan Army is an independent entity and governments have no control over it. ",
            "\"I can sit here and tell you that as I speak, the Pakistan Army is exactly behind the government's programme. Whatever policies from day one, whether it was peace with India, they were behind us,\" he said, pausing to mention that when he had decided to release the Indian pilot captured by the Army, they supported his decision.",
            "\"There is no difference between the policies of Pakistan's security forces or the policies of Pakistan's democratic government.\"",
            "He said that the Afghans should be \"left to decide what they want, what sort of government they want and we should facilitate the peace process\".",
            "\"So this is the big difference now. We are all on the same page...and fortunately the US is on the same page [...] 19 years of conflict and this could have gone on. Thank God for President Trump. This could have gone on for another 19 years without any result.\"",
            "Responding to concerns about freedom of the press in Pakistan, the prime minister said that he had spent 18 summers of his life in Britain where he had noted that the media is very open and free.",
            "\"The Pakistan media, in my opinion, is even freer than the British media [...] it is not just free but sometimes out of control,\" said the prime minister.",
            "He went on to say that in Britain no media would have published the kind of remarks that the Pakistani media had since he had come into power.",
            "\"A prime minister of a country and this man sits on television and says he is 'getting divorced tomorrow',\" remarked PM Imran, referring to rumours that had circulated in the media a few months ago about the premier’s allegedly rocky relationship with First Lady Bushra Bibi.",
            "\"In the olden days, this guy would have been beaten up. In Nawaz Sharif's time, he had journalists beaten up. Asif Zardari — people were petrified of him. People would disappear,\" he said.",
            "The premier said he, on the other hand, had gone through the legal channels to take action. ",
            "\"So what we need, is to control the media, not through the government but through a media watchdog.",
            "\"They reported wrongly that the IMF had said that the rupee would fall, to a number they quoted. There was a run on the rupee. Who would do that [anywhere else in the world]?\"",
            "He said that the government was on the one hand struggling to revive the economy and on the other hand the media was falsely reporting such things and causing a run on the rupee.",
            "\"I feel very strongly we will strengthen the media watchdog. It is not censorship. There are 70-80 channels in Pakistan. Only three reported they were having some problems.\"",
            "He said that the media would have to be more accountable and will have to answer for their source of income. ",
            "\"Even if we ask them about taxes, they say ‘this is against freedom of expression’.\"",
            "When asked what role Pakistan can play in calming the rising tensions with Iran without ruining the relations it has with other countries, the prime minister said that an offer had already been made to Iran for Pakistan to play a role and until recently, Iran was receptive to the idea, but now seemed \"desperate\".",
            "He urged all the countries to avoid pushing Iran into a conflict.",
            "\"I'm not sure all the countries realise the gravity of the situation if there is a conflict with Iran [...] This is not going to be the same as Iraq. This could be much, much, worse. It will have grave, adverse consequences for our country [as well]. ",
            "\"It could unleash terrorism where Al Qaeda would be forgotten,\" warned PM Imran."
        ]
    },
    {
        "sr_no": 80,
        "newspaper": "Tribune",
        "headline": "Trump accepts PM Imran's invitation for Pakistan visit",
        "link": "https://tribune.com.pk/story/2019293/1-trump-accepts-pm-imran-invitation-pakistan-visit/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "US President Donald Trump has accepted Prime Minister Imran Khan’s invitation to visit Pakistan, said the Foreign Office on Tuesday.",
            "The invitation was extended during the prime minister’s meeting with Trump on Monday – the first summit-level engagement between the two countries since 2015.",
            "President Trump welcomed the premier at the entrance of the White House. The two leaders jointly addressed the press and later had a one-on-one meeting, which was followed by delegation-level talks between the two sides.",
            "President Trump also hosted a luncheon in the Prime Minister’s honour.",
            "The two leaders held comprehensive discussions with a focus on building a broad-based and enduring partnership between Pakistan and the United States and strengthening cooperation between the two countries to bring peace, stability and economic prosperity in South Asia.",
            "The two leaders reviewed the progress of the Afghan peace and reconciliation process. President Trump appreciated Pakistan’s contribution to the peace talks and Prime Minister Imran reaffirmed Pakistan’s commitment to continue to support the process in good faith. He also added that pursuing the process was a shared responsibility.",
            "The two also affirmed their resolve to work together across a broad range of areas and acknowledged the immense opportunity and potential for mutually beneficial collaboration in diverse fields such as trade, investment, energy, economic connectivity, and defense and security cooperation. Prime Minister Imran also invited the US corporate sector to invest in Pakistan.",
            "It was decided to establish a mechanism to follow-up on the understandings reached.",
            "The prime minister also briefed the US president about his vision of the socio-economic development of Pakistan. He said that “peaceful neighborhood” was a priority of Pakistan’s foreign policy, adding that peace and stability in the region would allow Pakistan to harness its human resource potential to generate growth and spur regional connectivity.",
            "President Trump appreciated the premier’s vision for peace in South Asia.",
            "The Prime Minister said Pakistan was convinced that normalisation of relations with India would be mutually beneficial for the two countries. He underlined that Pakistan would continue to pursue dialogue and diplomacy to resolve longstanding disputes, including the core dispute of Jammu and Kashmir. President Trump expressed his readiness to play a facilitating role in resolution of the Kashmir dispute.",
            "Following the conclusion of official talks, President Trump took Prime Minister Khan and members of the delegation on a tour of the White House.",
            "Pakistan’s delegation included the Foreign Minister, Chief of Army Staff, DG (ISI), Advisors on Finance and Commerce, Special Assistant on Overseas Pakistanis, Foreign Secretary, Ambassador-at-Large on Investment and Pakistan’s Ambassador to the United States."
        ]
    },
    {
        "sr_no": 86,
        "newspaper": "Tribune",
        "headline": "\nVote count underway after polling concluded in Ghotki by-polls\n",
        "link": "https://tribune.com.pk/story/2019562/1-polling-underway-ghotki-polls/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "Vote count underway after polling concluded peacefully in National Assembly constituency NA-205 (Ghotki) by-election on Tuesday.",
            "Tough competition is expected between Pakistan Peoples Party’s (PPP) Sardar Muhammad Bux Khan Mahar and independent candidate Ahmed Ali Mahar.",
            "Over 300,000 people are expected to cast their votes after the seat fell vacant after the death of Sardar Ali Muhammad Khan Mahar who won the general election in 2018.",
            "The police, Sindh Rangers and Pakistan Army officers are present in polling stations to avoid any untoward incident.",
            "Nisar Khuhro – President of PPP Sindh said that Pakistan Tehreek-e-Insaf (PTI) member Haleem Adil Sheikh – along with other members of parliament – are inside the polling stations and are stopping voters from entering.",
            "He asserted that the Election Commission of Pakistan (ECP) should take notice of the alleged rigging.",
            "All set for showdown in Ghotki by-poll today",
            "Haleem Adil Sheikh claimed that he – along with other party members – has not been inside the polling station but PPP members Khursheed Shah, Nasir Shah, Nisar Khuhro and Anwar Siyal were inside.",
            "The ECP in June issued a show-cause notice to Prime Minister Imran Khan for visiting Ghotki ahead of the NA-205 by-election in violation of the commission’s code of conduct.",
            "Imran was in Ghotki on a visit that the ruling party PTI said was to condole the death of former federal minister Sardar Ali Muhammad Khan Mahar.",
            "The notice was issued after a complaint was lodged by Pakistan Peoples Party’s (PPP) NA-205 Ghotki-II candidate, Abdul Bari Pitafi."
        ]
    },
    {
        "sr_no": 92,
        "newspaper": "Tribune",
        "headline": "\nImran Khan suffers from Nawaz phobia, says Shehbaz Sharif\n",
        "link": "https://tribune.com.pk/story/2019828/1-imran-khan-suffers-nawaz-phobia-says-shehbaz-sharif/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "LAHORE: Pakistan Muslim League-Nawaz (PML-N) President Shehbaz Sharif has taken a swipe at Prime Minister Imran Khan for making “petty and personal attacks” on incarcerated former premier Nawaz Sharif in his speeches in the United States.",
            "“Imran Khan suffers from Nawaz phobia. He does not have the capacity to think about issues beyond NS (Nawaz Sharif),” Shehbaz wrote on his official Twitter handle on Tuesday.",
            "While calling the prime minister “Niazi Sahib”, leader of the opposition in the National Assembly said: “Optics more than substance defined Niazi sahib’s’ tour to the US and his propensity for ‘U-turns’ was on full display in Washington.”",
            "Imran Khan suffers from Nawaz phobia. He does not have the capacity to think about issues beyond NS. Optics more than substance defined Niazi sahib's tour to the US. His propensity for 'U-turns' was on full display in Washington.",
            "— Shehbaz Sharif (@CMShehbaz) July 23, 2019",
            "In a separate statement issued on Tuesday, PML-N president said, “Imran wasted an important opportunity of sending a message of unity in his speeches in America. He should have talked about Pakistan and challenges that lie ahead but he chose to make petty and personal attacks on Nawaz.”",
            "He said Imran Niaz’s vision of bankruptcy was now clear. “His pettiness is clear from his statements that he wants to take away TV and air-conditioner from Nawaz.”",
            "He said Imran had proven he was the most unfit person to hold the Prime Minister Office.",
            "“Imran Niazi is focusing more on gimmicks like riding on buses and less on substantive issues that matter to the people of Pakistan. Imran Niazi has once again taken U-turns on his own statements,” said Shehbaz. “The PM talked about bringing Aafia Siddiqui home, but he did not want journalists to ask him questions.”",
            "He said Imran had not mentioned resolution of Kashmir issue on the basis of UN resolutions. “Has Imran changed Pakistan’s policy on Kashmir? In America Imran exposed his dictatorial thinking by saying media needs to be controlled. He is lying by saying the media is free under his government while the media is suffering from the worst kind of censorship,” he added.",
            "Shehbaz demanded of the PM to explain to the nation how he had offered to “do more” for America.",
            "“When Nawaz Sharif talked about better relations with India, Imran called him ‘Modi’s yaar’, but now he is following the vision of Nawaz,” he added.",
            "Nawaz’s vision was better relations with all neighbours. “Imran Niazi is now following Nawaz’s vision,” he added. “He has achieved nothing in his visit to America except proving he is unfit to be the prime minister of this country. He has proved he is a selected prime minister.”",
            "In separate statement, PML-N Information Secretary Marriyum Aurangzeb said, “The imposed dictatorial regime of the selected prime minister cannot succeed by denying freedom of expression and locking down the entire opposition and every voice of criticism.”",
            "Marriyum said if such tactics could guaranteed success of an imposed regime, dictatorships from 1958 till 2019 would have never ended. “If the country could have been run by choking freedom of the press and subjecting opposition to worst political victimisation, Musharraf would have been a lifetime ruler of Pakistan,” she added.",
            "The former information minister urged Imran not to malign the concept of a democratic republic through his fascist mindset.",
            "These tactics, she said, could not solve the crisis of survival faced by the people of Pakistan who were struggling to feed their families courtesy to the PTI’s economic policy disasters.",
            "“You cannot silence the misery of 220 million people living in Pakistan because of your failures even if you continue putting opponents behind bars and shutting down the media,” said Marriyum. “The nation is in a state of despair with soaring inflation, rising unemployment, crippling unfair taxes and lies of the selected prime minister and his army of rented spokespersons.”"
        ]
    }
]