[
    {
        "sr_no": 11,
        "newspaper": "kashmir Times",
        "headline": "Onus, now, on separatists: Rajnath",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92827",
        "brief": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.\r\nHis assertion came with a reminder that he had al...",
        "date": "7/21/2019 12:48:14 PM",
        "detailed_news": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.His assertion came with a reminder that he had already made exhaustive efforts to bring them to dialogue table as the Home Minister of the country, (in first tenure of Modi-government). Now it’s for them (separatists) to act to make things move - whatever way, he plainly told when queried about stand-off on the need of political initiative in Kashmir after effectively containing militancy in the Valley, as claimed by the government. The Defence Minister was speaking to media persons after inaugurating the 1000-meter long Ujh bridge along the International Border (IB) in Kathua district. “What stand-off..? There’s no stand-off. Jitni Pehl Iss Desh Key Griha-Mantri Ko Karni Chahiye Thi Utni Pehl To Maine Pehle Kardi… Ab Uskay Baad Woh Faisla Karengay Key Kya Karna Hai.. (The efforts and initiatives, expected from the Home Minister of this country, have already been exhausted by me in my tenure as the Union Home Minister… Now it is for them to take a call as what they want to do…),” he said.  Responding to another query related to “Operation All–Out” in the Valley to weed-out terrorism, Rajnath said that day was not far off to achieve that mark. “There are no two opinions about it that the Kashmir will get rid of terrorism very soon. Rest assured….it’s going to happen very soon. More so, I believe- as in case of any act of terror occurring anywhere in the world, the way the international community is rallying around on one platform, joining hands to take on this threat, it (terrorism) will be wiped out of - not only Kashmir, Jammu ...but the entire world,” he said.What was that challenge which was main obstacle in resolving Kashmir, in the Defence Minister’s opinion as he had earlier served as the Union Home Minister also? Faced with this query, Rajnath said, “There’s no need to analyse that challenge here. Whatever be the challenge, it will be tackled. We very well know all the reasons, we’ll sort them out and J&K will be rid of terrorism, for sure.”   In response to queries related to recurrent ceasefire violations by Pakistan on IB and LoC, even on the day of his visit to J&K today and the probability of another Kargil-like misadventure by the neighbouring nation (Pak), his terse reply was, “This message is for all the countrymen- Have faith in our country’s leadership - the Prime Minister Narendra Modi and the valiant jawans and officers of our armed forces. They will not let down your faith in them.”Earlier he said, “I’ve just returned from Kargil. Accompanied by the Army Chief General Bipin Rawat and Union Minister of State in PMO Dr Jitendra Singh, I saw those majestic peaks, which were freed from the clutches of Pakistan by our valiant soldiers by laying down their lives yet not before incurring a crushing defeat to the enemy and failing its evil designs. I’ve just witnessed the testimonies to their (gallant soldiers’) valour and heroic deeds which earned India a proud victory.”Rajnath stated that the Ujh bridge, which as per Director General-Border Road Organisation’s assertion, was the longest bridge constructed by the organization anywhere in the country, would ease problems of border residents related to connectivity. “In the form of bridge, the long pending demand of border residents has been realized. The strenuous efforts of Border Road Organisation (BRO) to complete this bridge in stipulated period despite lot of problems and hostile conditions are, undoubtedly, laudable,” the Defence Minister said."
    },
    {
        "sr_no": 16,
        "newspaper": "kashmir Times",
        "headline": "Army pays tribute to brave-heart",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92766",
        "brief": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. \r\nToday, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid hom...",
        "date": "7/19/2019 10:28:45 AM",
        "detailed_news": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. Today, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid homage to the martyr on behalf of a proud nation.Singh was 35 years old and had joined the Army in 2002. He belonged to Village Tibba of Dhuri Tehsil in Sangrur District of Punjab and is survived by wife, a son and a daughter."
    },
    {
        "sr_no": 19,
        "newspaper": "kashmir Times",
        "headline": "Village girl turned IAF fighter pilot inspiring J&K youngsters",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92763",
        "brief": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. \r\nIn a series of motivational lectures, Thakur told s...",
        "date": "7/19/2019 10:28:04 AM",
        "detailed_news": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. In a series of motivational lectures, Thakur told students on Thursday that the decision to come to Bhadarwah to take part in the \"Sangam Youth Festival\" organised by the army changed her life forever as she decided to join the armed forces. Hailing from Billan Bowlian in Udhampur district, Thakur joined the IAF as a fighter pilot this year, one of the first few women in the country to have done so. Her motivational lectures, organised by the Rashtriya Rifles unit based at Bhadarwah, are inspiring youngsters, especially girls, in the state to make a mark in life. “I decided that I had to go for it, whatever it took. I would want every young boy and girl wanting to become a fighter pilot to dream big,” Thakur told. In her message to the students of Kendriya Vidyalaya and PG College Bhadarwah, she said, “Your dreams may seem unconquerable at the moment. But you must chase those so hard that they become reality.” Stating that a \"combination of average qualities\" in her made her unique, Thakur said, “I climbed the ladder step by step, committing some mistakes as well, but kept going as I learned it the hard way. Instead of mourning over your failures and get into self pity, you should work harder to achieve your goals.” She said being an NCC cadet helped her keep her nerves in the most difficult situations. The lectures were followed by question-answer sessions with the students. Aarushi, a Class 12 science student of Kendriya Vidyalaya, said she always thought becoming a doctor was the only option for her but Thakur''s words changed that. “I already feel like flying as joining the army is my childhood dream. I will definitely strive harder to make my dream a reality,” she said. Komal Katal (27) of Garh Bhadarwah village said, “I always wanted to join the Army but in this part of the state, I never got an opportunity to try my luck. Although I could not appear in AFCAT (Air Force Common Admission Test) because of the age bar, after attending the lecture of Jubiksha, I will work harder and give it a try to join the Territorial Army.” Besides Thakur, Commanding Officer, 4 Rashtriya Rifles Colonel D D Pandey also shared his experiences with the students. “You should be passionate about your dreams and to reach your destination, you should not hesitate and think longer to take your first step. Just start your journey today and you will definitely reach your destination,” he said."
    },
    {
        "sr_no": 38,
        "newspaper": "Greater Times",
        "headline": "India, Pakistan armies trade fire along LoC in Poonch",
        "link": "https://www.greaterkashmir.com/news/kashmir/india-pakistan-armies-trade-fire-along-loc-in-poonch-3/?utm_source=rss&utm_medium=rss&utm_campaign=india-pakistan-armies-trade-fire-along-loc-in-poonch-3",
        "brief": "The armies of India and Pakistan on Tuesday fired at each other’s positions along the Line of Control (LoC) in Poonch district of Jammu and Kashmir. An official said that Pakistan army initiated unprovoked firing and shelling along the LoC in Krishna Ghati, Mendhar and Mankote sectors of the district around 12:20 PM. He said<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/kashmir/india-pakistan-armies-trade-fire-along-loc-in-poonch-3/\">Read More</a>",
        "date": "Tue, 23 Jul 2019 10:06:07 +0000",
        "detailed_news": ""
    },
    {
        "sr_no": 46,
        "newspaper": "Hindustan Times",
        "headline": "\nMurdered rifleman Aurangzeb’s brothers join army, vow to avenge his death\n",
        "link": "http://www.hindustantimes.com/india-news/murdered-rifleman-aurangzeb-s-brothers-join-army-vow-to-avenge-his-death/story-mN6UEKzcEcXGowb84m6EVI.html",
        "brief": "",
        "date": "Jul 23, 2019 14:53 IST",
        "detailed_news": [
            "Two brothers of an Indian Army soldier, who was abducted and killed by militants last year, have joined the armed forces to “serve the nation and avenge his death”.",
            "Mohammed Tariq, 23, and Mohammed Shabbir, 21, attended an enrolment parade of 100 new recruits in the Territorial Army in Rajouri on Monday, according to a defence spokesperson.",
            "“They were enrolled into a territorial battalion on Monday and now they will undergo training at Punjab Regimental Centre,” the spokesperson said.",
            "They posed with their parents Mohammed Hanif and Raaj Begum after donning the olive green. Hanif is also a former army man. ",
            "Aurangzeb was abducted in Pulwama and later killed by armed terrorists on June 14, 2018, when he was on his way back home in Poonch to celebrate Eid with his family. He was a rifleman in the army’s 44 Rashtriya Rifles. ",
            "“Our brother gave his life for the nation and we will also follow his footsteps. We will not step back when it comes to sacrificing our lives for the nation. We will make him proud and will make Punjab regiment proud by our duty,” said Tariq.",
            "Their father Hanif, a former Jammu and Kashmir Light Infantry soldier, said he may not live to see the “day but his two sons will take revenge of their brother Aurangzeb’s killing.”",
            "“Tariq and Shabbir also want to serve the nation and protect their fellow citizens. Yes, I have lost my son Aurangzeb and death lurks a soldier but then not many have the guts to sacrifice their life for the nation,” he said while speaking to HT over the phone.",
            "“Aurangzeb was trapped and then killed by the cowards. We still miss him,” Hanif said.",
            "Hanif joined the Bharatiya Janata Party (BJP) earlier this year in the presence of Prime Minister Narendra Modi at a public rally in Vijaypur area of Samba district.",
            "Also read | Militant involved in armyman’s murder among 4 killed in Valley",
            "\n\n"
        ]
    },
    {
        "sr_no": 59,
        "newspaper": "Hindustan Times",
        "headline": "\nIndian Army responds to MS Dhoni’s request of training with Parachute regiment for 2 months - Reports\n",
        "link": "http://www.hindustantimes.com/cricket/army-chief-approves-ms-dhoni-s-request-of-training-with-parachute-regiment-for-2-months-reports/story-HUqfM3M9QLoM0ppMbcAUDI.html",
        "brief": "",
        "date": "Jul 22, 2019 13:57 IST",
        "detailed_news": [
            "Army Chief General Bipin Rawat approved former India captain MS Dhoni’s request to train with the Parachute regiment for two months, top Army sources said on Sunday. The wicket-keeper batsman had requested the Indian Army to allow him to train with a territorial army battalion of the Parachute regiment for two months. “The request has now been approved by the Indian Army Chief Gen Bipin Rawat and the honorary Lt Col would train with the Parachute regiment battalion,” top Army sources told ANI.The wicketkeeper-batsman would now train with the Parachute regiment, a part of which is expected to take place in Jammu and Kashmir, sources said.",
            "Also Read: India’s full squads for T20I, ODI and Test series against West Indies",
            "The Army, however, will not allow Dhoni, who holds an honorary post of Lieutenant Colonel in the Territorial Army, to be part of any active operation, sources mentioned.",
            "India will tour West Indies for three T20Is and as many ODIs, and two Tests which are part of World Test Championship from August 3 to September 3.",
            "Dhoni had made himself unavailable for the upcoming Windies tour.",
            "\n\n"
        ]
    },
    {
        "sr_no": 61,
        "newspaper": "Dawn",
        "headline": "'Pakistan, US on the same page that there is no military solution to Afghanistan'\n",
        "link": "https://www.dawn.com/news/1495748/pakistan-us-on-the-same-page-that-there-is-no-military-solution-to-afghanistan",
        "brief": "",
        "date": "Updated July 23, 2019",
        "detailed_news": [
            "Prime Minister Imran Khan, during an address delivered at the United States Institute of Peace on Tuesday, expressed confidence that there was \"convergence between the United States and Pakistan\" when it came to recognising that there is no military solution to deal with the war in Afghanistan.",
            "He said that he viewed the dynamic to be different now, as both sides were finally looking at things through the same lens.",
            "\"The Pakistan Army was fighting but they [the US] thought we are not doing enough [...] we had gone out of our way. But this time, we are all on the same page that only a political settlement through dialogue will work,\" said the prime minister.",
            "In response to a question regarding what makes things different now in the relationship between the two countries, the premier said: \"I always felt [previously] that the relationship was never multi-pronged, always transactional.\"",
            "The premier, providing a backdrop to the circumstances that led to the present situation in Afghanistan, said that the 'jihadists' had been convinced to fight against the US and once the 'jihad' was over, the US packed up and left and \"we were slapped with sanctions\".",
            "\"We were left with 4 million afghan refugees [...] a number of militant groups created to fight the soviets, all dressed up and nowhere to go, heroin, drugs — which at some point were used to pay for the fighting,\" he continued, to highlight the magnanimity of the fallout.",
            "He said that after 9/11 Pakistan again joined the US [in the fight against terrorism]. ",
            "\"I only had one seat in parliament. When Gen Musharraf consulted us [on whether we should join the war] I opposed it and said we should stay neutral.\"",
            "He then went on to explain, why he felt it would have been in Pakistan's best interest to remain neutral.",
            "\"We had created these jihadi groups in the 80s. We had indoctrinated them in the idea of jihad. That foreign occupation in Afghanistan [...] it was a religious duty to fight them. So all these foreign groups, including Al-Qaeda had arrived in Pakistan.\"",
            "\"Now comes 9/11. And the US invades Afghanistan. And now we are trying to tell the same groups, who had close links with the Pakistan Army — because they were created by the Pakistan Army — now we are telling them because the good guys are there, its no longer jihad.\"",
            "\"Now obviously, a lot of them turned against the Pakistan Army because the Pakistan Army was then trying to neutralise them.\"",
            "The premier said that the years that followed were \"the worst time in our history\".",
            "\"These groups turned against the Pakistan Army and the State of Pakistan. And not only that, there were linkages between these groups and the Pakistan security forces because they had created them.",
            "\"We had insider attacks, the GHQ was attacked, the generals were killed, the ISI headquarters were attacked. The Army at one point could not go into the cities in military clothes or with military cars. It was that bad,\" said PM Imran, as he asserted his view of why Pakistan should have never gotten involved.",
            "\"The second thing was the tribal areas. We should never have sent our Army into the tribal areas. ",
            "\"The tribal area per capita was the most weaponised area in the world, he said,\" pausing to provide a brief history of the region that had been left autonomous post-British era and that had \"lived by its own rules\".",
            "\"In 2004, under pressure from the US, Pakistan Army went into the tribal areas to flush out Al-Qaeda. What happened was, after Tora Bora in Afghanistan, a few of the Al-Qaeda moved down into our tribal areas which were semi-autonomous. When they sent the Army in [...] you know armies are not meant to go into civilian areas.",
            "\"Whenever you send your army into civilian areas there will always be human rights abuses because there is no army there, there are just guerillas operating from villages.",
            "\"The collateral damage created what became the Pakistani Taliban. There was no Pakistani Taliban [group] before,\" he said.",
            "\"In my opinion we should have stayed neutral. That way we would have control over these militant groups and we could have, in our own time, neutralised them,\" he added, before going on to say: \"But because we became a part of the US war, they turned against Pakistan.\"",
            "He said that what followed was a watershed moment in Pakistani politics, recounting the 2014 Army Public School massacre in which 150 school children were slaughtered by the TTP — the Pakistani faction of the Taliban. ",
            "\"There was a reaction within Pakistan. All the political parties signed the NAP (National Action Plan) and we all decided that we will never allow any militant groups to operate within Pakistan.\"",
            "The premier said that because there had been such a sizable presence of these groups (estimating them to be around 30,000-strong) that had obtained \"training in some theatre — Afghanistan or Kashmir\", there had been a challenge which no one was willing to take previously.",
            "\"Prior to our government coming into power, past governments did not have the political will [...] we were the first government to start disarming militant groups. ",
            "\"We have taken over their institutes, their seminaries, we have [placed] administrators there. For the first time we have decided there will be no armed militias inside our country.\"",
            "More to follow."
        ]
    },
    {
        "sr_no": 82,
        "newspaper": "Tribune",
        "headline": "Bilawal supports PM Imran's efforts to 'engage with the world'",
        "link": "https://tribune.com.pk/story/2019533/1-bilawal-supports-pm-imrans-efforts-engage-world/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "Pakistan Peoples Party (PPP) Chairman Bilawal Bhutto-Zardari on Tuesday extended unconditional support to Prime Minister Imran Khan for his efforts to ‘engage with the world’.",
            "Bilawal, reacting to the meeting between PM Imran and President Trump, took to social media to reiterate support for Pakistan despite “reservations with the premier”.",
            "Having said that in the greater national interest everyone should support Pakistan’s efforts to engage the world. I therefor unconditionally support governments efforts. Will always provide constructive criticism when needed but will always support  first. 2/2 #TrumpHostsKhan",
            "— BilawalBhuttoZardari (@BBhuttoZardari) July 23, 2019",
            "I‘ve many reservations about our PM, his undemocratic politics & economically fatal polices. I also believe much of his conduct abroad particularly his jalsa is unbecoming of a PM who is supposed to represent  not just PTI. 1/2 #TrumpHostsKhan",
            "— BilawalBhuttoZardari (@BBhuttoZardari) July 23, 2019",
            "PM Imran arrives on three-day visit to US",
            "On July 21, PM Imran arrived in Washington on his three-day visit to the United States, accompanied by Chief of the Army Staff General Qamar Javed Bajwa, Adviser to PM on Commerce Abdul Razzak Dawood and Special Assistant on Overseas Pakistanis Zulfi Bukhari.",
            "The premier’s trip was originally planned in June but was postponed because of prior domestic engagements, including the federal budget."
        ]
    },
    {
        "sr_no": 85,
        "newspaper": "Tribune",
        "headline": "\nPresident Trump gifts cricket bat to PM Imran\n",
        "link": "https://tribune.com.pk/story/2019386/1-president-trump-gifts-cricket-bat-pm-imran/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "WASHINGTON: Prime Minister Imran Khan was gifted a cricket bat by US President Donald Trump along with the picture of President Eisenhower – the only US President who had watched a Test match in Pakistan.",
            "President Trump said that it is a great honour to have a “very popular, a great athlete, one of the greatest, the prime minister of Pakistan.”",
            "PM Imran arrives on three-day visit to US",
            "Underscoring PM Imran’s leadership, the US president said that “a lot of things are happening for the US, and I think a lot of great things are going to be happening for Pakistan too, under your leadership.  I really feel that”.",
            "The world cup winning captain on Sunday arrived in Washington on his three-day visit to the US on the invitation of President Trump.",
            "The premier was accompanied by Adviser to PM on Commerce, Abdul Razzak Dawood, Special Assistant on Overseas, Zulfi Bukhari, and Chief of the Army Staff, General Qamar Javed Bajwa, while Foreign Minister Shah Mehmood Qureshi was already in Washington as part of the entourage."
        ]
    },
    {
        "sr_no": 88,
        "newspaper": "Tribune",
        "headline": "\nVote count underway after polling concluded in Ghotki by-polls\n",
        "link": "https://tribune.com.pk/story/2019562/1-polling-underway-ghotki-polls/",
        "brief": "",
        "date": "July 23, 2019",
        "detailed_news": [
            "Vote count underway after polling concluded peacefully in National Assembly constituency NA-205 (Ghotki) by-election on Tuesday.",
            "Tough competition is expected between Pakistan Peoples Party’s (PPP) Sardar Muhammad Bux Khan Mahar and independent candidate Ahmed Ali Mahar.",
            "Over 300,000 people are expected to cast their votes after the seat fell vacant after the death of Sardar Ali Muhammad Khan Mahar who won the general election in 2018.",
            "The police, Sindh Rangers and Pakistan Army officers are present in polling stations to avoid any untoward incident.",
            "Nisar Khuhro – President of PPP Sindh said that Pakistan Tehreek-e-Insaf (PTI) member Haleem Adil Sheikh – along with other members of parliament – are inside the polling stations and are stopping voters from entering.",
            "He asserted that the Election Commission of Pakistan (ECP) should take notice of the alleged rigging.",
            "All set for showdown in Ghotki by-poll today",
            "Haleem Adil Sheikh claimed that he – along with other party members – has not been inside the polling station but PPP members Khursheed Shah, Nasir Shah, Nisar Khuhro and Anwar Siyal were inside.",
            "The ECP in June issued a show-cause notice to Prime Minister Imran Khan for visiting Ghotki ahead of the NA-205 by-election in violation of the commission’s code of conduct.",
            "Imran was in Ghotki on a visit that the ruling party PTI said was to condole the death of former federal minister Sardar Ali Muhammad Khan Mahar.",
            "The notice was issued after a complaint was lodged by Pakistan Peoples Party’s (PPP) NA-205 Ghotki-II candidate, Abdul Bari Pitafi."
        ]
    }
]