[
    {
        "sr_no": 2,
        "newspaper": "kashmir Times",
        "headline": "Amarnath Yatra will continue: Raina",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93292",
        "brief": "JAMMU, Aug 2: Amidst recent developments in Jammu and Kashmir, Bharatiya Janata Party president of Jammu and Kashmir Ravinder Raina on Friday said that the Amarnath Yatra will continue till August 15 as per the schedule.\r\n\"Strong security measures have already been tak...",
        "date": "8/3/2019 3:42:36 PM",
        "detailed_news": "JAMMU, Aug 2: Amidst recent developments in Jammu and Kashmir, Bharatiya Janata Party president of Jammu and Kashmir Ravinder Raina on Friday said that the Amarnath Yatra will continue till August 15 as per the schedule.\"Strong security measures have already been taken up and there is no atmosphere of fear. The Amarnath Yatra will continue till August 15 as per the schedule.\"All yatris can visit the holy shrine, but advisory issued by the home department should be followed,\" Raina told news agencies.He added, \"Our brave jawans of Indian Army, Jammu Kashmir Police forces and paramilitary forces have foiled an attempt of Pakistani terrorists to target the civilians, tourists and Amarnath Yatris in the Kashmir valley.\"\"Our jawans have also recovered a Pakistani-made sniper rifle, arms and ammunition,\" he said.Adding that an advisory has been issued by the Home Department of the Jammu and Kashmir government in the Kashmir valley, the BJP leader said, \"The Pakistani terrorists are trying to target the pilgrims and others in the valley. We should all fight against Pakistan together.\"Earlier today, state government advised Amarnath Yatris and tourists to curtail their stay in the Valley 'immediately', shortly after the Indian Army said Pakistani terrorists are planning to disrupt the pilgrimage."
    },
    {
        "sr_no": 3,
        "newspaper": "kashmir Times",
        "headline": "Civilian injured in Pak firing in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93252",
        "brief": "RAJOURI, Aug 1: A civilian got injured as Pakistan violated ceasefire on the fifth consecutive day by firing unprovoked along the Line of Control (LoC) in Nowshera sector of Rajouri district in Jammu on Thursday.\r\n“Pakistan violated the ceasefire last night in Nowshera...",
        "date": "8/3/2019 1:33:52 AM",
        "detailed_news": "RAJOURI, Aug 1: A civilian got injured as Pakistan violated ceasefire on the fifth consecutive day by firing unprovoked along the Line of Control (LoC) in Nowshera sector of Rajouri district in Jammu on Thursday.“Pakistan violated the ceasefire last night in Nowshera sector of Rajouri in which a civilian suffered injuries,” official sources said.The civilian identified as Mohammad Altaf (37), resident of Pukherni, sustained a bullet injury in neck and he was hospitalised.Earlier on July 30, an army jawan attained martyrdom in ceasefire violation along the Line of Control in Rajouri district.On July 29, three civilian suffered injuries in Shahpur area of Poonch including a 10-day old child, who succumbed during the treatment.On Wednesday, India issued a strong demarche to the Pakistan High Commission against the killing of an innocent Indian civilian in an unprovoked act of firing by Pakistan forces. The firing resulted into killing of an infant boy and injuring of two civilians in the Poonch sector of Jammu and Kashmir. New Delhi also called upon Islamabad to investigate into the incident. External Affairs Ministry shot off a letter to Pakistan High Commission in India and condemned the deliberate targeting of innocent civilians by Pakistan forces. The letter said, this act is against all established humanitarian norms and professional military conduct."
    },
    {
        "sr_no": 11,
        "newspaper": "kashmir Times",
        "headline": "Army jawan killed as Pak targets Indian posts, villages in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93161",
        "brief": "SUNDERBANI, Jul 30: An army jawan was killed as Pakistani troops violated the ceasefire for the third consecutive day and resorted to firing and shelling along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Tuesday.\r\n“The Pakistan army resorted t...",
        "date": "7/31/2019 11:08:18 PM",
        "detailed_news": "SUNDERBANI, Jul 30: An army jawan was killed as Pakistani troops violated the ceasefire for the third consecutive day and resorted to firing and shelling along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Tuesday.“The Pakistan army resorted to unprovoked ceasefire violation along the LoC in Sunderbani sector of Rajouri district today,” PRO Defence Lt Col Devender Anand said.He said the Indian army responded strongly and effectively. “Heavy damage to Pakistan army posts and casualties to Pakistani soldiers were inflicted by our troops. However in the exchange of fire, Naik Krishan Lal (34) was martyred,” Lt Col Anand said.LT Col Anand described Lal as a “brave, highly motivated and sincere” soldier. “The nation will always remain indebted to him for his supreme sacrifice and devotion to duty. Naik Krishan Lal hailed from Akhnoor 's Gagriyal village. He is survived by his wife Shashi Devi,” he said.This is the third such violation in as many days. On Monday, Pakistani troops had resorted to unprovoked firing and shelling along the LoC in Mankote and Shahpur sectors of Poonch district.A 10-day-old baby was killed and two persons injured in heavy shelling by Pakistan along the LoC in Shahpur sector of Poonch district on Sunday.In the meanwhile, army sources said that two Pakistani soldiers were gunned down in retaliatory action by the Indian army when the neighbouring country violated ceasefire in Tangdhar-Keran sector. However two civilians were injured in Jabdi, Tangdhar in cross LoC firing."
    },
    {
        "sr_no": 14,
        "newspaper": "kashmir Times",
        "headline": "Pak shells villages, border posts in Poonch on 2nd day",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93118",
        "brief": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.\r\nIndian side also r...",
        "date": "7/30/2019 3:53:20 PM",
        "detailed_news": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.Indian side also retaliated in equal measure. Two sides traded heavy fire till late afternoon.In the meanwhile, around 15-day infant, who had sustained critical splinter injuries in his abdomen along with his mother and another civilian in Pak shelling in Shahpur sector Sunday evening, succumbed to his injuries in Poonch District Hospital this morning. This afternoon, Deputy Commissioner Rahul Yadav also presented cash relief to persons injured in recent cross border firing.Army sources said, “Pakistani army violated ceasefire in Shahpur sector of Poonch this afternoon. Indian army retaliated with equal calibre and exchange of fire continued till 3.50 PM.”PRO Defence Devender Anand said, “At about 1245 hours, Pakistan initiated unprovoked ceasefire violation starting with firing of small arms followed by shelling with mortars along LoC in Shahpur sector (J&K). Indian army retaliated befittingly.”The army spokesperson said information on casualties on the Pakistani side in the retaliatory action was not immediately available.In the meanwhile, around 15-day old infant, who had sustained critical abdominal splinter injuries during heavy shelling by Pakistani troops along the Line of Control (LoC) in Shahpur sector of Poonch district Sunday evening, died at Poonch District hospital on Monday, a police official said.The infant, his mother Fatima Jan (35) and another civilian Mohammad Arif (40) were injured when mortar shells fired by Pakistan hit their village in Shahpur sector late Sunday evening. They were rushed to district hospital Poonch, where the minor succumbed to injuries this morning, he added.He said Jan and Arif were referred to the Government Medical College Hospital, Jammu, for specialised treatment where their condition was stated to be stable. The baby, however, was kept under observation in Poonch district hospital, where he breathed his last.Later this afternoon, Deputy Commissioner Rahul Yadav  presented cash relief to persons injured in recent cross border firing. He met the injured undergoing treatment at the District Hospital and inquired about their condition directed the doctors to provide them best possible treatment. The Deputy Commissioner provided a relief assistance of Rs 10,000 each to the injured out of Red Cross fund.Mortars and small arms were used from across the border to target forward posts and villages in Shahpur, Sawjian and Mendhar sectors between 5 PM and 10 PM on Sunday. Several houses were also damaged in the firing, the official said.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was injured in another incident of cross-border firing by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 16,
        "newspaper": "kashmir Times",
        "headline": "Pak shells Poonch villages, border posts",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93100",
        "brief": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district...",
        "date": "7/29/2019 11:05:01 PM",
        "detailed_news": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district on Sunday eveningPolice said that the Pakistan army resorted to heavy shelling targetting Indian forward posts and civilian areas at Shahpur, Mankote and Sawjian thus leading to heavy exchange of fire from both sides in these sectors.“In Pak shelling, three civilian namely Fatima Jan, 35, wife of Mohammed Qasim resident of Shahpur, her around 15-day old child and Mohammed Arif,33, son of Mohammed Sayeed, also resident of Shahpur were injured. All three injured were rushed to District Hospital Poonch from where Fatima Jan and Mohammed Sayeed were referred to Government Medical College hospital, Jammu. However, the infant, who too had sustained critical injuries in his abdomen, was being treated in Poonch hospital,” Medical Superintendent District Hospital Poonch Shamim-Ul-Nisa told KTNS.   Meanwhile Sarpanch Najab Din said that some shells landed into residential areas at Shahpur . In the incident, two residential houses got damaged and three civilians including mother-child duo sustained injuries. Sarpanch added, “As the heavy shelling continued in the area, it's not possible to assess the exact loss of life and property.”Earlier SSP Poonch Ramesh Kumar Angral, while confirming heavy shelling in border areas of Shahpur, Mankote, Sawjian, said, “ Pakistan army targetted not only army posts on the Line of Control but also civilian population. Some shells landed into residential areas as well. As a result, three civilians were injured. All three injured were immediately shifted to District Hospital Poonch for treatment. Indian army was also responding to the shelling effectively.”DC Poonch Rahul Yadav, who himself was camping at District Hospital Poonch, told reporters that the condition of infant was critical as he too had sustained splinter injury in his abdomen. “He was not referred to GMC, Jammu given his condition. The doctors here are trying to stabilise his condition. That’s the priority. The administration is providing all required assistance to the victims.”  Defence PRO Devender Anand said, “Today at about 1700 hours Pak initiated unprovoked ceasefire violation by firing  of small arms and intense shelling with mortars along LoC in Shahpur and Sawjian sectors in district Poonch. Indian army is retaliating befittingly.”Besides Shahpur, Sawjian, Mankote, the two sides also traded fire along the LoC in Mendhar and Krishna Ghati sectors. Few houses in these areas also got damaged during shelling, reports said.In Sawjian sector, the house of Amna Bi, widow of Said Mohammed Khan, resident of Sawjian was also damaged partially. Heavy shelling continued till the last reports poured in. The cross-border firing by Pakistan has ended a five-day lull in the border skirmishes between India and Pakistan armies.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was also injured in another incident of ceasefire violation by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 23,
        "newspaper": "Greater Times",
        "headline": "Additional companies of RAF, CPMF, BSF deployed in Rajouri, Poonch",
        "link": "https://www.greaterkashmir.com/news/pir-panjal/additional-companies-of-raf-cpmf-bsf-deployed-in-rajouri-poonch/?utm_source=rss&utm_medium=rss&utm_campaign=additional-companies-of-raf-cpmf-bsf-deployed-in-rajouri-poonch",
        "brief": "",
        "date": "Sat, 03 Aug 2019 20:21:03 +0000",
        "detailed_news": "Amid prevailing tension, State government on Saturday deployed additional companies of Rapid Action Force (RAF), Central Para Military Forces (CMPF) and Border Security Force (BSF) here in the border towns of Rajouri and Poonch. People living in the twin districts claimed that in the last three days, several companies of CRPF, ITBP and BSF&#160; have<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/pir-panjal/additional-companies-of-raf-cpmf-bsf-deployed-in-rajouri-poonch/\">Read More</a>"
    },
    {
        "sr_no": 26,
        "newspaper": "Greater Times",
        "headline": "India, Pak exchange gunfire along LoC in Poonch",
        "link": "https://www.greaterkashmir.com/news/jammu/india-pak-exchange-gunfire-along-loc-in-poonch/?utm_source=rss&utm_medium=rss&utm_campaign=india-pak-exchange-gunfire-along-loc-in-poonch",
        "brief": "",
        "date": "Sat, 03 Aug 2019 20:19:27 +0000",
        "detailed_news": "Indian and Pakistani armies on Saturday exchanged gunfire along the Line of Control in Balakote area of Mendhar in Poonch district. As per officials here, cross border firing started at about 8 PM on Saturday after Pakistani army resorted to cross border firing drawing strong retaliation from Indian army and since then heavy exchange of<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/jammu/india-pak-exchange-gunfire-along-loc-in-poonch/\">Read More</a>"
    },
    {
        "sr_no": 29,
        "newspaper": "Greater Times",
        "headline": "7 militants killed in Keran sector: Army",
        "link": "https://www.greaterkashmir.com/news/front-page-2/7-militants-killed-in-keran-sector-army/?utm_source=rss&utm_medium=rss&utm_campaign=7-militants-killed-in-keran-sector-army",
        "brief": "",
        "date": "Sat, 03 Aug 2019 20:14:06 +0000",
        "detailed_news": "Army on Saturday said that it foiled a Border Action Team (BAT) attempt by killing at least seven militants near Line of Control at Keran in north Kashmir’s Kupwara district. Talking to Greater Kashmir, Army’s Srinagar based spokesman Colonel  Rajesh Kalia said that “in the last 36 hours number of attempts to disrupt the peace<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/front-page-2/7-militants-killed-in-keran-sector-army/\">Read More</a>"
    },
    {
        "sr_no": 34,
        "newspaper": "Greater Times",
        "headline": "Indian army offers to return bodies of Pakistanis killed in JK's Keran area",
        "link": "https://www.hindustantimes.com/india-news/indian-army-offers-to-return-bodies-of-pakistanis-killed-in-jk-s-keran-area/story-C4CJjJMlIcfISnAWemDN5H.html",
        "brief": "",
        "date": "Sun, 04 Aug 2019 05:18:25 GMT ",
        "detailed_news": "The two were four Pakistanis killed during an attack an army post in Keran along the Line of Control in Jammu and Kashmir."
    },
    {
        "sr_no": 61,
        "newspaper": "Dawn",
        "headline": "Editorial: Will those who matter in Delhi pursue the course of sanity on Kashmir?",
        "link": "https://www.dawn.com/news/1498054/editorial-will-those-who-matter-in-delhi-pursue-the-course-of-sanity-on-kashmir",
        "brief": "",
        "date": "Updated August 04, 2019",
        "detailed_news": [
            "THE news emerging from India-held Kashmir is not good. ",
            "From the looks of it, the Hindu nationalist BJP government in New Delhi is preparing to up the ante in the occupied territory by pouring in troops. ",
            "Read: India's troop buildup triggers panic among residents in occupied Kashmir",
            "According to media reports, Delhi recently sent 25,000 military personnel to the held region; this is in addition to the 10,000 troops that were reportedly stationed in IHK last week. Moreover, tourists and Hindu pilgrims have been told to leave the region due to ‘terror threats’. ",
            "Read: Anxious tourists flee occupied Kashmir after India's 'terror' warning",
            "Naturally, this disturbing series of events has created alarm in IHK. There have been calls to stock up on food and fuel, which has led to panic buying, while in another development, details were recently leaked of an order to police from the rulers in Delhi to keep an eye on mosques and preachers. To this explosive situation we can add the fact that India is regularly violating the ceasefire along the Line of Control, while the BJP intends to scrap a crucial article of the Indian constitution that prevents outsiders from buying property in IHK. The signs, therefore, do not inspire hope.",
            "It is no secret that the ideological fountainhead of the BJP is the Hindu fascist RSS. Are the worrying developments in Kashmir a reflection of the Sangh Parivar’s intentions in the occupied region? Does Prime Minister Narendra Modi plan to throw all democratic conventions to the wind in order to fulfil the agenda of his ideological parent, and appease his populist voter base? There are many indications of this. By doing away with Article 35A of the Indian constitution, the BJP will open up the floodgates for massive demographic changes in IHK, as the native population will be overwhelmed by outsiders. If the hardliners in Delhi think this will be a masterstroke through which they will ‘conquer’ Kashmir, they are mistaken. Such moves will only take Kashmiri disaffection with India to new heights; already cries for azadi are ringing out in the held valley. Perhaps fearing massive resistance from Kashmiris to its malevolent intentions, the Indian state is further strengthening its military presence in the heavily militarised region.",
            "Unfortunately, the Indian establishment appears to have traded in reason and sagacity for arrogance and brute force in IHK. ",
            "The increased troop presence and the plans to alter Kashmir’s constitutional status will be a recipe for disaster. Kashmiris — especially the youth — have had enough of India’s brutality and are willing to sacrifice their lives in their quest for freedom and dignity.",
            "But there is still time; if Mr Modi and his cohorts so wish, they can pull back and extend the hand of dialogue to the Kashmiris and Pakistan. Sanity demands that India reject confrontation and adopt negotiation and peacemaking instead. Will those who matter in Delhi pursue the course of sanity?",
            "Published in Dawn, August 4th, 2019"
        ]
    },
    {
        "sr_no": 78,
        "newspaper": "State Times",
        "headline": "Indian Army asks Pak military to take possession of bodies of its personnel",
        "link": "http://news.statetimes.in/indian-army-asks-pak-military-to-take-possession-of-bodies-of-its-personnel/",
        "brief": "",
        "date": "Sun, 04 Aug 2019 05:19:12 +0000",
        "detailed_news": "New Delhi: The Indian Army has offered to the Pakistan military to take possession of bodies of its personnel who were killed when it foiled an attack by Pakistan&#8217;s Border Action Team (BAT) in Keran sector of Jammu and Kashmir, official sources said Sunday. The sources said here that the Pakistan Army has been asked [&#8230;]"
    }
]