[
    {
        "sr_no": 2,
        "newspaper": "kashmir Times",
        "headline": "Amarnath Yatra will continue: Raina",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93292",
        "brief": "JAMMU, Aug 2: Amidst recent developments in Jammu and Kashmir, Bharatiya Janata Party president of Jammu and Kashmir Ravinder Raina on Friday said that the Amarnath Yatra will continue till August 15 as per the schedule.\r\n\"Strong security measures have already been tak...",
        "date": "8/3/2019 3:42:36 PM",
        "detailed_news": "JAMMU, Aug 2: Amidst recent developments in Jammu and Kashmir, Bharatiya Janata Party president of Jammu and Kashmir Ravinder Raina on Friday said that the Amarnath Yatra will continue till August 15 as per the schedule.\"Strong security measures have already been taken up and there is no atmosphere of fear. The Amarnath Yatra will continue till August 15 as per the schedule.\"All yatris can visit the holy shrine, but advisory issued by the home department should be followed,\" Raina told news agencies.He added, \"Our brave jawans of Indian Army, Jammu Kashmir Police forces and paramilitary forces have foiled an attempt of Pakistani terrorists to target the civilians, tourists and Amarnath Yatris in the Kashmir valley.\"\"Our jawans have also recovered a Pakistani-made sniper rifle, arms and ammunition,\" he said.Adding that an advisory has been issued by the Home Department of the Jammu and Kashmir government in the Kashmir valley, the BJP leader said, \"The Pakistani terrorists are trying to target the pilgrims and others in the valley. We should all fight against Pakistan together.\"Earlier today, state government advised Amarnath Yatris and tourists to curtail their stay in the Valley 'immediately', shortly after the Indian Army said Pakistani terrorists are planning to disrupt the pilgrimage."
    },
    {
        "sr_no": 3,
        "newspaper": "kashmir Times",
        "headline": "Civilian injured in Pak firing in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93252",
        "brief": "RAJOURI, Aug 1: A civilian got injured as Pakistan violated ceasefire on the fifth consecutive day by firing unprovoked along the Line of Control (LoC) in Nowshera sector of Rajouri district in Jammu on Thursday.\r\n“Pakistan violated the ceasefire last night in Nowshera...",
        "date": "8/3/2019 1:33:52 AM",
        "detailed_news": "RAJOURI, Aug 1: A civilian got injured as Pakistan violated ceasefire on the fifth consecutive day by firing unprovoked along the Line of Control (LoC) in Nowshera sector of Rajouri district in Jammu on Thursday.“Pakistan violated the ceasefire last night in Nowshera sector of Rajouri in which a civilian suffered injuries,” official sources said.The civilian identified as Mohammad Altaf (37), resident of Pukherni, sustained a bullet injury in neck and he was hospitalised.Earlier on July 30, an army jawan attained martyrdom in ceasefire violation along the Line of Control in Rajouri district.On July 29, three civilian suffered injuries in Shahpur area of Poonch including a 10-day old child, who succumbed during the treatment.On Wednesday, India issued a strong demarche to the Pakistan High Commission against the killing of an innocent Indian civilian in an unprovoked act of firing by Pakistan forces. The firing resulted into killing of an infant boy and injuring of two civilians in the Poonch sector of Jammu and Kashmir. New Delhi also called upon Islamabad to investigate into the incident. External Affairs Ministry shot off a letter to Pakistan High Commission in India and condemned the deliberate targeting of innocent civilians by Pakistan forces. The letter said, this act is against all established humanitarian norms and professional military conduct."
    },
    {
        "sr_no": 11,
        "newspaper": "kashmir Times",
        "headline": "Army jawan killed as Pak targets Indian posts, villages in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93161",
        "brief": "SUNDERBANI, Jul 30: An army jawan was killed as Pakistani troops violated the ceasefire for the third consecutive day and resorted to firing and shelling along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Tuesday.\r\n“The Pakistan army resorted t...",
        "date": "7/31/2019 11:08:18 PM",
        "detailed_news": "SUNDERBANI, Jul 30: An army jawan was killed as Pakistani troops violated the ceasefire for the third consecutive day and resorted to firing and shelling along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Tuesday.“The Pakistan army resorted to unprovoked ceasefire violation along the LoC in Sunderbani sector of Rajouri district today,” PRO Defence Lt Col Devender Anand said.He said the Indian army responded strongly and effectively. “Heavy damage to Pakistan army posts and casualties to Pakistani soldiers were inflicted by our troops. However in the exchange of fire, Naik Krishan Lal (34) was martyred,” Lt Col Anand said.LT Col Anand described Lal as a “brave, highly motivated and sincere” soldier. “The nation will always remain indebted to him for his supreme sacrifice and devotion to duty. Naik Krishan Lal hailed from Akhnoor 's Gagriyal village. He is survived by his wife Shashi Devi,” he said.This is the third such violation in as many days. On Monday, Pakistani troops had resorted to unprovoked firing and shelling along the LoC in Mankote and Shahpur sectors of Poonch district.A 10-day-old baby was killed and two persons injured in heavy shelling by Pakistan along the LoC in Shahpur sector of Poonch district on Sunday.In the meanwhile, army sources said that two Pakistani soldiers were gunned down in retaliatory action by the Indian army when the neighbouring country violated ceasefire in Tangdhar-Keran sector. However two civilians were injured in Jabdi, Tangdhar in cross LoC firing."
    },
    {
        "sr_no": 14,
        "newspaper": "kashmir Times",
        "headline": "Pak shells villages, border posts in Poonch on 2nd day",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93118",
        "brief": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.\r\nIndian side also r...",
        "date": "7/30/2019 3:53:20 PM",
        "detailed_news": "POONCH, Jul 29: Pakistani army, on second consecutive day, resorted to unprovoked heavy firing targetting forward Indian border posts and villages on the Line of Control (LoC) in violation of ceasefire in Shahpur sector of Poonch district on Monday.Indian side also retaliated in equal measure. Two sides traded heavy fire till late afternoon.In the meanwhile, around 15-day infant, who had sustained critical splinter injuries in his abdomen along with his mother and another civilian in Pak shelling in Shahpur sector Sunday evening, succumbed to his injuries in Poonch District Hospital this morning. This afternoon, Deputy Commissioner Rahul Yadav also presented cash relief to persons injured in recent cross border firing.Army sources said, “Pakistani army violated ceasefire in Shahpur sector of Poonch this afternoon. Indian army retaliated with equal calibre and exchange of fire continued till 3.50 PM.”PRO Defence Devender Anand said, “At about 1245 hours, Pakistan initiated unprovoked ceasefire violation starting with firing of small arms followed by shelling with mortars along LoC in Shahpur sector (J&K). Indian army retaliated befittingly.”The army spokesperson said information on casualties on the Pakistani side in the retaliatory action was not immediately available.In the meanwhile, around 15-day old infant, who had sustained critical abdominal splinter injuries during heavy shelling by Pakistani troops along the Line of Control (LoC) in Shahpur sector of Poonch district Sunday evening, died at Poonch District hospital on Monday, a police official said.The infant, his mother Fatima Jan (35) and another civilian Mohammad Arif (40) were injured when mortar shells fired by Pakistan hit their village in Shahpur sector late Sunday evening. They were rushed to district hospital Poonch, where the minor succumbed to injuries this morning, he added.He said Jan and Arif were referred to the Government Medical College Hospital, Jammu, for specialised treatment where their condition was stated to be stable. The baby, however, was kept under observation in Poonch district hospital, where he breathed his last.Later this afternoon, Deputy Commissioner Rahul Yadav  presented cash relief to persons injured in recent cross border firing. He met the injured undergoing treatment at the District Hospital and inquired about their condition directed the doctors to provide them best possible treatment. The Deputy Commissioner provided a relief assistance of Rs 10,000 each to the injured out of Red Cross fund.Mortars and small arms were used from across the border to target forward posts and villages in Shahpur, Sawjian and Mendhar sectors between 5 PM and 10 PM on Sunday. Several houses were also damaged in the firing, the official said.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was injured in another incident of cross-border firing by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 16,
        "newspaper": "kashmir Times",
        "headline": "Pak shells Poonch villages, border posts",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=93100",
        "brief": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district...",
        "date": "7/29/2019 11:05:01 PM",
        "detailed_news": "POONCH, Jul 28: Around 15 day old infant, his mother were among three civilians injured as Pakistan army resorted to heavy shelling targetting villages and forward Indian border posts on the Line of Control (LoC) in Shahpur, Sawjian and Mankote areas of Poonch district on Sunday eveningPolice said that the Pakistan army resorted to heavy shelling targetting Indian forward posts and civilian areas at Shahpur, Mankote and Sawjian thus leading to heavy exchange of fire from both sides in these sectors.“In Pak shelling, three civilian namely Fatima Jan, 35, wife of Mohammed Qasim resident of Shahpur, her around 15-day old child and Mohammed Arif,33, son of Mohammed Sayeed, also resident of Shahpur were injured. All three injured were rushed to District Hospital Poonch from where Fatima Jan and Mohammed Sayeed were referred to Government Medical College hospital, Jammu. However, the infant, who too had sustained critical injuries in his abdomen, was being treated in Poonch hospital,” Medical Superintendent District Hospital Poonch Shamim-Ul-Nisa told KTNS.   Meanwhile Sarpanch Najab Din said that some shells landed into residential areas at Shahpur . In the incident, two residential houses got damaged and three civilians including mother-child duo sustained injuries. Sarpanch added, “As the heavy shelling continued in the area, it's not possible to assess the exact loss of life and property.”Earlier SSP Poonch Ramesh Kumar Angral, while confirming heavy shelling in border areas of Shahpur, Mankote, Sawjian, said, “ Pakistan army targetted not only army posts on the Line of Control but also civilian population. Some shells landed into residential areas as well. As a result, three civilians were injured. All three injured were immediately shifted to District Hospital Poonch for treatment. Indian army was also responding to the shelling effectively.”DC Poonch Rahul Yadav, who himself was camping at District Hospital Poonch, told reporters that the condition of infant was critical as he too had sustained splinter injury in his abdomen. “He was not referred to GMC, Jammu given his condition. The doctors here are trying to stabilise his condition. That’s the priority. The administration is providing all required assistance to the victims.”  Defence PRO Devender Anand said, “Today at about 1700 hours Pak initiated unprovoked ceasefire violation by firing  of small arms and intense shelling with mortars along LoC in Shahpur and Sawjian sectors in district Poonch. Indian army is retaliating befittingly.”Besides Shahpur, Sawjian, Mankote, the two sides also traded fire along the LoC in Mendhar and Krishna Ghati sectors. Few houses in these areas also got damaged during shelling, reports said.In Sawjian sector, the house of Amna Bi, widow of Said Mohammed Khan, resident of Sawjian was also damaged partially. Heavy shelling continued till the last reports poured in. The cross-border firing by Pakistan has ended a five-day lull in the border skirmishes between India and Pakistan armies.On July 22, an Indian soldier was killed in Pakistani firing in Sunderbani sector of Rajouri district, while a civilian was also injured in another incident of ceasefire violation by Pakistan in Poonch sector on July 20."
    },
    {
        "sr_no": 18,
        "newspaper": "Greater Times",
        "headline": "Indian Army asks Pak military to take possession of bodies after failed BAT action",
        "link": "https://www.greaterkashmir.com/news/india/indian-army-asks-pak-military-to-take-possession-of-bodies-after-failed-bat-action/?utm_source=rss&utm_medium=rss&utm_campaign=indian-army-asks-pak-military-to-take-possession-of-bodies-after-failed-bat-action",
        "brief": "",
        "date": "Sun, 04 Aug 2019 05:33:37 +0000",
        "detailed_news": "The Indian Army has offered to the Pakistan military to take possession of bodies of the intruders who were killed when it foiled an attack by Border Action Team (BAT) in Keran sector of Jammu and Kashmir, official sources said Sunday. The sources said here that the Pakistan Army has been asked to approach the<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/india/indian-army-asks-pak-military-to-take-possession-of-bodies-after-failed-bat-action/\">Read More</a>"
    },
    {
        "sr_no": 26,
        "newspaper": "Greater Times",
        "headline": "Additional companies of RAF, CPMF, BSF deployed in Rajouri, Poonch",
        "link": "https://www.greaterkashmir.com/news/pir-panjal/additional-companies-of-raf-cpmf-bsf-deployed-in-rajouri-poonch/?utm_source=rss&utm_medium=rss&utm_campaign=additional-companies-of-raf-cpmf-bsf-deployed-in-rajouri-poonch",
        "brief": "",
        "date": "Sat, 03 Aug 2019 20:21:03 +0000",
        "detailed_news": "Amid prevailing tension, State government on Saturday deployed additional companies of Rapid Action Force (RAF), Central Para Military Forces (CMPF) and Border Security Force (BSF) here in the border towns of Rajouri and Poonch. People living in the twin districts claimed that in the last three days, several companies of CRPF, ITBP and BSF&#160; have<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/pir-panjal/additional-companies-of-raf-cpmf-bsf-deployed-in-rajouri-poonch/\">Read More</a>"
    },
    {
        "sr_no": 29,
        "newspaper": "Greater Times",
        "headline": "India, Pak exchange gunfire along LoC in Poonch",
        "link": "https://www.greaterkashmir.com/news/jammu/india-pak-exchange-gunfire-along-loc-in-poonch/?utm_source=rss&utm_medium=rss&utm_campaign=india-pak-exchange-gunfire-along-loc-in-poonch",
        "brief": "",
        "date": "Sat, 03 Aug 2019 20:19:27 +0000",
        "detailed_news": "Indian and Pakistani armies on Saturday exchanged gunfire along the Line of Control in Balakote area of Mendhar in Poonch district. As per officials here, cross border firing started at about 8 PM on Saturday after Pakistani army resorted to cross border firing drawing strong retaliation from Indian army and since then heavy exchange of<a class=\"moretag\" href=\"https://www.greaterkashmir.com/news/jammu/india-pak-exchange-gunfire-along-loc-in-poonch/\">Read More</a>"
    },
    {
        "sr_no": 49,
        "newspaper": "Greater Times",
        "headline": "Indian army offers to return bodies of Pakistanis killed in Jammu and Kashmir's...",
        "link": "https://www.hindustantimes.com/india-news/indian-army-offers-to-return-bodies-of-pakistanis-killed-in-jk-s-keran-area/story-C4CJjJMlIcfISnAWemDN5H.html",
        "brief": "",
        "date": "Sun, 04 Aug 2019 06:38:25 GMT ",
        "detailed_news": "Indian army sources said the Pakistani army has been asked to approach with a white flag and take over the bodies for last rites. The Pakistani Army is yet to respond."
    },
    {
        "sr_no": 60,
        "newspaper": "Dawn",
        "headline": "PM Imran summons NSC meeting after India fires cluster munitions on civilian areas along LoC",
        "link": "https://www.dawn.com/news/1498058/pm-imran-summons-nsc-meeting-after-india-fires-cluster-munitions-on-civilian-areas-along-loc",
        "brief": "",
        "date": "August 04, 2019",
        "detailed_news": [
            "Prime Minister Imran Khan on Sunday summoned a meeting of the National Security Committee (NSC) in the wake of the Indian army's use of cluster ammunition to target the civilian population in Azad Jammu and Kashmir (AJK) across the Line of Control (LoC) in violation of the Geneva Convention and international law.",
            "In a major escalation in the ceasefire violations, India has begun using cluster munitions on civilian population living close to the LoC. The use of cluster bombs on the Neelum Valley over the past few days has caused multiple fatalities and injuries to several others, including minor children.",
            "Over the past few years, besides a spike in terms of intensity of ceasefire breaches, India has also resorted to calibre escalation and air space violations along LoC. The use of cluster bomb is therefore a step further towards escalation in the situation along LoC.",
            "Read: Indian army used cluster ammunition along LoC in violation of international laws: ISPR",
            "In a series of tweets on Sunday, Special Assistant to the Prime Minister on Information Dr Firdous Ashiq Awan said that the political leadership of Pakistan needed to come on the same page and expose the \"state terrorism by India in Indian-occupied Kashmir (IoK)\" and the situation at the LoC.",
            "She said that this was not the time for politics, rather it was the time to stand up for the nation's welfare and for Kashmiris' right to self-determination, adding that the country's leadership should send a message of unity and solidarity.",
            " ",
            "Meanwhile, the Kashmir Media Service today reported that Indian army spokesperson Colonel Rajesh Kali, based in Srinagar, claimed that seven more individuals had been killed in IoK's Kupwara district. ",
            "In a statement shared by the PML-N on Twitter on Sunday, Leader of the Opposition in the National Assembly Shehbaz Sharif condemned the deaths of the Kashmiris. ",
            "He called on United Nations Secretary General António Guterres to take immediate notice of the situation and to play his role in stopping the \"murder of innocent civilians in Kashmir\". Additionally, he called on the UN Security Council and the rest of the world to take notice of Indian brutality in occupied Kashmir.",
            "According to Azad Jammu and Kashmir’s State Disaster Management Authority (SDMA), the number of casualties increased to four on Saturday as another civilian fell victim to the shelling, whereas one of those wounded on Tuesday succumbed to injuries at a hospital. The SDMA has put the number of wounded in shelling incidents at 40.",
            "Outraged over the firing of cluster munitions on civilian populated areas of Azad Kashmir, Pakistan on Saturday called for world attention to the disregard of the widely accepted international ban on the weapons by India and massive human rights abuses being committed by Indian forces inside occupied Kashmir.",
            "Related: Political leadership condemns use of cluster bomb along LoC",
            "The Inter-Services Public Relations (ISPR) confirmed that on the night of July 30 and 31, Indian army targeted civilian population in the Neelum Valley through artillery using cluster ammunition, which led to martyrdom of two civilians, including a four-year old boy, and injuries to 11 others. The ISPR, the media wing of the army, also released pictures of scattered munitions as well as those of the victims.",
            "\"This is [a] violation of Geneva Convention and international humanitarian law,\" the military's media wing said, adding that the use of cluster ammunition is prohibited under the Convention on Cluster Ammunition because of its severe impact on non-combatants.",
            "The NSC meeting also comes in the backdrop of Indian accusations of a cross-LoC incursion and resultant casualties. The Indian Army had claimed it had \"successfully foiled\" a 'border action team' (BAT) operation by the Pakistan Army in the Keran sector of Jammu and Kashmir — a claim rejected by both ISPR and the Foreign Office (FO).",
            "Read: Army rejects India's accusation of cross-LoC incursion as mere propaganda",
            "\"Indian allegations of cross LOC action by Pakistan and possession of bodies are mere propaganda. Such blatant lies / staged dramas are Indian disinformation manoeuvre to divert world attention from increased atrocities by Indian occupation forces inside the occupied Kashmir,\" said ISPR.",
            " ",
            "Use of cluster munitions has been banned by 102 countries, most of which are signatories to the Convention on Cluster Ammunition, because of concerns that the weapon causes disproportionate civilian casualties. Some of the unexploded bomblets released from a cluster bomb may remain unexploded and may kill or maim civilians even afterwards.",
            "The size of bomblets varies from four to five inches and because of their shape — resembling a soft drink can or an orange — villagers refer to them as “toy bombs”.",
            "Military sources say though cluster bombs are designed as anti-personnel and anti-armour weapons, innocent civilians are mostly their primary victims and of them 40 per cent are children who are drawn to the small, toy-like metal objects.",
            "Cluster bombs are believed to be deadlier than landmines, which is why the 2008 Convention on Cluster Munitions — adopted in May 2008 in Dublin, Ireland, and signed in December 2008 in Oslo, Norway — prohibits their use, production, stockpiling and transfer and requires states to ensure that they claim no further victims.",
            "India has deployed at least 10,000 troops in IoK in recent days, with media reports of a further 25,000 ordered to the region. There are some 500,000 Indian security forces already based in the region. ",
            "The government has also introduced other security measures — including a call to stock up food and fuel — over terror threat claims. ",
            "Read: Anxious tourists flee occupied Kashmir after India's 'terror' warning",
            "Tourists and students have been scrambling to leave IoK since the Jammu and Kashmir state government said they should leave \"immediately\" amid new intelligence about \"terror threats\" to a major Hindu pilgrimage in the region. ",
            "Britain and Germany have also issued warnings against travel to the region. ",
            "But while the Indian military and the state government have highlighted the security risk, Kashmiri and opposition politicians in New Delhi have raised concerns that the extra troops were being deployed for other reasons. ",
            "They include fears that Prime Minister Narendra Modi's Hindu nationalist government could carry out a threat to scrap Kashmir's special status under the Indian constitution. ",
            "Political leaders in the territory have warned that cancelling constitutionally guaranteed rights — which mean only state domiciles can buy land in the region — could spark unrest in the Muslim-majority state. ",
            "On Saturday, the FO had expressed \"serious concern over the progressively deteriorating situation\" in IoK.",
            "\"There is a deepening anxiety and fear among the people of Indian-occupied Kashmir because of reports of deployment of additional 38,000 Indian paramilitary forces in recent weeks,\" read the statement.",
            "Tensions ran high between India and Pakistan in the wake of a suicide attack on an Indian military convoy in Pulwama district of Indian-occupied Kashmir on February 14, which killed more than 40 paramilitary troops.",
            "In what was the most serious military crisis in South Asia since 2008, Indian and Pakistani warplanes engaged in a dogfight on Feb 27, a day after a raid by Indian jet fighters on what New Delhi said was a militant camp in Pakistan. Islamabad denied any militant camp exists in the area and said the Indian bombs exploded on an empty hillside.",
            "Pakistan downed an Indian plane for violating its airspace and captured its pilot after he ejected in AJK.",
            "The tensions de-escalated after Prime Minister Imran Khan decided to release the Indian pilot as a peace gesture, and following concerted diplomatic efforts by countries including the United States, China and the UAE.",
            "Nevertheless, ceasefire violations along the de-facto border have been occurring regularly."
        ]
    },
    {
        "sr_no": 63,
        "newspaper": "Dawn",
        "headline": "Iran general says chances of Gulf conflict decreasing",
        "link": "https://www.dawn.com/news/1498059/iran-general-says-chances-of-gulf-conflict-decreasing",
        "brief": "",
        "date": "August 04, 2019",
        "detailed_news": [
            "An Iranian general said on Sunday the chances of a conflict breaking out in the Gulf region have decreased, after a spate of hostile acts in the key waterway. ",
            "“At first glance, it may seem that the situation in the Persian Gulf is heading towards a military conflict but when studying the situation more deeply, we see that chances for such a conflict become less probable,” said Brig Gen Ahmadreza Pourdastan. ",
            "“All countries which have interests in the region are by no means willing to see a new crisis in the Middle East,” he said, quoted by Mehr news agency. ",
            "“The military capabilities of our armed forces are to such an extent that the enemies don't dare go for a military option against us. ",
            "“The Persian Gulf is like a tinderbox and explosion of the first firecracker can lead to a huge disaster,” the general said. ",
            "Tensions between arch-enemies Iran and the United States have soared this year after Washington stepped up its “maximum pressure” campaign against Tehran. ",
            "Ships have been attacked, drones downed and oil tankers seized since May, after the US withdrew from a landmark nuclear deal between Iran and world powers and reimposed biting sanctions against the country. ",
            "At the height of the crisis, US President Donald Trump called off air strikes against Iran at the last minute in June after the Islamic republic's forces shot down a US drone."
        ]
    },
    {
        "sr_no": 65,
        "newspaper": "Dawn",
        "headline": "US, Taliban push for peace in second day of talks",
        "link": "https://www.dawn.com/news/1498057/us-taliban-push-for-peace-in-second-day-of-talks",
        "brief": "",
        "date": "Updated August 04, 2019",
        "detailed_news": [
            "The US and the Taliban will seek to thrash out elements of a deal to bring a close to Afghanistan's 18-year conflict in the second day of renewed talks in Doha on Sunday. ",
            "Read: Troop pullout remains key to Doha peace deal",
            "The US, which invaded Afghanistan and toppled the Taliban in 2001, wants to withdraw thousands of troops and turn the page on its longest-ever war. ",
            "But it would first seek assurances from the insurgents that they would renounce Al-Qaeda and stop other militants like the Islamic State group using the country as a haven. ",
            "The talks, now in their eighth round, began on Saturday and were due to resume Sunday morning after pausing overnight, US and Taliban sources told AFP. ",
            "A Taliban source also said efforts were underway to organise a direct meeting between US envoy for Afghanistan Zalmay Khalilzad and Taliban co-founder Mullah Baradar, who heads the movement's political wing. ",
            "A coalition led by Washington ousted the Taliban in late 2001 accusing it of harbouring Al-Qaeda jihadists who claimed the September 11 attacks against the US that killed almost 3,000 people. ",
            "But despite a rapid conclusion to the conventional phase of the war, the Taliban have proved formidable insurgents, bogging down US troops for years. ",
            "Washington is hoping to strike a peace deal with the Taliban by September 1 — ahead of Afghan polls due the same month, and US presidential elections due in 2020. ",
            "US President Donald Trump told reporters at the White House on Friday that \"we've made a lot of progress. We're talking\". ",
            "\"We are pursuing a peace agreement not a withdrawal agreement, a peace agreement that enables withdrawal,\" Khalilzad tweeted on Friday as he arrived in Doha after talks with Prime Minister Imran Khan in Islamabad. ",
            "\"Our presence in Afghanistan is conditions-based, and any withdrawal will be conditions-based.\"",
            "In another sign of progress, the Afghan government has formed a negotiating team for separate peace talks with the Taliban that diplomats hope could be held as early as later this month. ",
            "The Washington Post reported on Thursday that an initial deal to end the war would see the US force in Afghanistan reduced to as low as 8,000 from the current level of around 14,000. ",
            "In exchange, the Taliban would abide by a ceasefire, renounce Al-Qaeda, and talk to the Kabul administration. \nAn Afghan official hinted last week that the government of President Ashraf Ghani was preparing for direct talks with the Taliban, the details of which have yet to be announced. ",
            "\"We have no preconditions to begin talks, but the peace agreement is not without conditions,\" Ghani wrote in Pashto on his Facebook page on Friday ahead of the talks. ",
            "\"We want a republic government not an emirate,\" he said, a challenge to the Taliban which has insisted on reverting to the \"Islamic Emirate\" name Afghanistan bore under its rule. ",
            "\"The negotiations will be tough, and the Taliban should know that no Afghan is inferior in religion or courage to them.\"",
            "The thorny issues of power-sharing with the Taliban, the role of regional powers including Pakistan and India, and the fate of Ghani's administration also remain unresolved. ",
            "The latest US-Taliban encounter follows last month's talks between influential Afghans and the Taliban which agreed a \"roadmap for peace\" —  but stopped short of calling for a ceasefire. ",
            "Kabul resident Somaya Mustafa, 20, said her country desperately needed a peace deal, but only one in which the Taliban \"accept women and their achievements\".",
            "\"It is a total mess in our country right now. And if it continues, women will suffer more than anyone else.\"",
            "The United Nations has said that civilian casualty rates across Afghanistan matched record levels last month, following a dip earlier in the year."
        ]
    },
    {
        "sr_no": 67,
        "newspaper": "Dawn",
        "headline": "Editorial: Does Modi plan to throw all democratic conventions to the wind to appease his populist voter base?",
        "link": "https://www.dawn.com/news/1498054/editorial-does-modi-plan-to-throw-all-democratic-conventions-to-the-wind-to-appease-his-populist-voter-base",
        "brief": "",
        "date": "Updated August 04, 2019",
        "detailed_news": [
            "THE news emerging from India-held Kashmir is not good. ",
            "From the looks of it, the Hindu nationalist BJP government in New Delhi is preparing to up the ante in the occupied territory by pouring in troops. ",
            "Read: India's troop buildup triggers panic among residents in occupied Kashmir",
            "According to media reports, Delhi recently sent 25,000 military personnel to the held region; this is in addition to the 10,000 troops that were reportedly stationed in IHK last week. Moreover, tourists and Hindu pilgrims have been told to leave the region due to ‘terror threats’. ",
            "Read: Anxious tourists flee occupied Kashmir after India's 'terror' warning",
            "Naturally, this disturbing series of events has created alarm in IHK. There have been calls to stock up on food and fuel, which has led to panic buying, while in another development, details were recently leaked of an order to police from the rulers in Delhi to keep an eye on mosques and preachers. To this explosive situation we can add the fact that India is regularly violating the ceasefire along the Line of Control, while the BJP intends to scrap a crucial article of the Indian constitution that prevents outsiders from buying property in IHK. The signs, therefore, do not inspire hope.",
            "It is no secret that the ideological fountainhead of the BJP is the Hindu fascist RSS. Are the worrying developments in Kashmir a reflection of the Sangh Parivar’s intentions in the occupied region? Does Prime Minister Narendra Modi plan to throw all democratic conventions to the wind in order to fulfil the agenda of his ideological parent, and appease his populist voter base? There are many indications of this. By doing away with Article 35A of the Indian constitution, the BJP will open up the floodgates for massive demographic changes in IHK, as the native population will be overwhelmed by outsiders. If the hardliners in Delhi think this will be a masterstroke through which they will ‘conquer’ Kashmir, they are mistaken. Such moves will only take Kashmiri disaffection with India to new heights; already cries for azadi are ringing out in the held valley. Perhaps fearing massive resistance from Kashmiris to its malevolent intentions, the Indian state is further strengthening its military presence in the heavily militarised region.",
            "Unfortunately, the Indian establishment appears to have traded in reason and sagacity for arrogance and brute force in IHK. ",
            "The increased troop presence and the plans to alter Kashmir’s constitutional status will be a recipe for disaster. Kashmiris — especially the youth — have had enough of India’s brutality and are willing to sacrifice their lives in their quest for freedom and dignity.",
            "But there is still time; if Mr Modi and his cohorts so wish, they can pull back and extend the hand of dialogue to the Kashmiris and Pakistan. Sanity demands that India reject confrontation and adopt negotiation and peacemaking instead. Will those who matter in Delhi pursue the course of sanity?",
            "Published in Dawn, August 4th, 2019"
        ]
    }
]