[
    {
        "sr_no": 2,
        "newspaper": "kashmir Times",
        "headline": "Civilian injured in Pak shelling in Poonch",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92933",
        "brief": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the se...",
        "date": "7/24/2019 3:07:43 PM",
        "detailed_news": "POONCH/MENDHAR, Jul 23: A civilian was injured as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Haveli, Dalhan, Krishna Ghati, Mankote and Mendhar sectors of Poonch district for the second consecutive day on Tuesday.One civilian sustained minor injuries during ceasefire at 20.00 hours. The injured has been identified as Sher Mohd, 45, son of Mohammed Muneer resident of Mohalla  Bahchari Baloni.Defense PRO Lt Col Devender Anand, while confirming ceasefire violation by Pakistan, said, “This afternoon Pakistani army violated ceasefire in Dalhan sector of Poonch district. Indian army retaliated with equal caliber.”“Later Pakistan violated the ceasefire in Krishna Ghati, Mankote & Mendhar sectors of Poonch district. Pak initiated unprovoked ceasefire violation at around 1220 hours along LoC with firing of small arms in Poonch sector. Indian army befittingly retaliated the cross-border firing by the Pakistani army,’ he added.Local army sources said this afternoon at about 12.20 PM, Pakistani army opened indiscriminate fire towards Indian forward posts and civilian areas in Dalhan sector in Haveli. “Heavy mortar shelling was witnessed during ceasefire violation which was retaliated by India in equal measure. Both sides exchanged heavy gun fire and mortar shelling in the area,” Mohammed Sadiq, a local said. “In Pak shelling, two houses in our village were partially damaged. A number of forward LoC locations remained affected due to shelling and civilians were forced to remain inside their houses. The exchange of fire stopped at around 2.55 PM,” he added.Later this afternoon at around 3.25 PM, Pakistani army initiated unprovoked firing and shelling along the LoC in Krishna Ghati, Mankote sectors of Mendhar tehsil of Poonch district. Indian side too retaliated effectively and strongly.This was the third such violation in the past four days which left an army jawan dead and a civilian injured, the officials said. On Monday, Rifleman Mohammad Arif Shafi Alam Khan Pathan was killed in unprovoked firing by Pakistani troops in Sunderbani sector of Rajouri district.A civilian was injured in Pakistani firing in Balnoi village along the LoC in Mendhar sector of Poonch district on Saturday."
    },
    {
        "sr_no": 3,
        "newspaper": "kashmir Times",
        "headline": "Teenager shoots herself to death in Reasi",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92912",
        "brief": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. \r\nPolice stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at p...",
        "date": "7/24/2019 1:04:04 PM",
        "detailed_news": "REASI, Jul 22: A teen-aged girl Monday shot herself dead with 12 bore rifle of her maternal uncle, an army-man, at Chassana in Reasi district. Police stated that a teenager identified as Rekha Devi, 17, daughter of Inder Singh, resident of Nandkote Chassana, was at present staying at Mamankote in the house of her maternal uncle Chamail Singh, son of Punjab Singh, who is serving in Indian army and presently posted in Haryana. “This evening she shot herself with her maternal uncle’s 12 bore rifle and died on spot. A case in this regard registered at Police Station Chassana and police started investigation to find the cause behind this extreme step,” police added."
    },
    {
        "sr_no": 5,
        "newspaper": "kashmir Times",
        "headline": "Rifleman killed in Pak firing in Rajouri",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92909",
        "brief": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.\r\nPRO Defence Lt Col Devender Anand, while confir...",
        "date": "7/24/2019 1:02:45 PM",
        "detailed_news": "RAJOURI, Jul 22: A soldier was killed as Pakistan army resorted to unprovoked firing targetting forward Indian border posts and villages along the Line of Control (LoC) in Sunderbani sector of Rajouri district on Monday.PRO Defence Lt Col Devender Anand, while confirming the ceasefire violation by neighbouring nation and death of a soldier, said, “Pakistan resorted to unprovoked ceasefire violation on the Line of Control (LoC). It resorted to mortar shelling and firing of small arms in the Sunderbani sector in the early hours. In the incident, Rifleman Mohammed Atif Shafi Alam Khan Pathan was critically injured. Rifleman was air evacuated to army hospital, where he succumbed to the injuries.”  “Indian troops responded strongly and inflicted heavy damage to Pakistan army posts and casualties to Pakistan soldiers in retaliation. However, the details of the damage on the Pakistan side are yet to be ascertained,” he added.“Rifleman Pathan, a young soldier, belonged to village Nawayard, tehsil Fatehganj district Vadodara, Gujarat and is survived by his parents, father Shafi Alam Khan Pathan and mother Habiban Banu. Rifleman Mohammed Atif Shafi Alam Khan Pathan was a brave, highly motivated and sincere soldier. The nation will always remain indebted to him for the supreme sacrifice and devotion to duty,” Defence spokesperson Lt Col Anand said.A police official said the cross-border firing started around 6.30 AM and continued intermittently for several hours, causing panic among the border residents who were advised to take necessary precautionary measures for their safety. This was the second ceasefire violation by Pakistan along the LoC in Jammu region in last three days.On Saturday, during the visit of Defence Minister Rajnath Singh to different parts of the state, Pakistani troops targeted Mendhar sector of Poonch district causing bullet injuries to a civilian in Balnoi village."
    },
    {
        "sr_no": 16,
        "newspaper": "kashmir Times",
        "headline": "Onus, now, on separatists: Rajnath",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92827",
        "brief": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.\r\nHis assertion came with a reminder that he had al...",
        "date": "7/21/2019 12:48:14 PM",
        "detailed_news": "KATHUA, Jul 20: The Defence Minister Rajnath Singh Saturday put the onus on the separatists to walk up to the negotiating table to end the existing stalemate vis-à-vis political initiative to resolve Kashmir imbroglio.His assertion came with a reminder that he had already made exhaustive efforts to bring them to dialogue table as the Home Minister of the country, (in first tenure of Modi-government). Now it’s for them (separatists) to act to make things move - whatever way, he plainly told when queried about stand-off on the need of political initiative in Kashmir after effectively containing militancy in the Valley, as claimed by the government. The Defence Minister was speaking to media persons after inaugurating the 1000-meter long Ujh bridge along the International Border (IB) in Kathua district. “What stand-off..? There’s no stand-off. Jitni Pehl Iss Desh Key Griha-Mantri Ko Karni Chahiye Thi Utni Pehl To Maine Pehle Kardi… Ab Uskay Baad Woh Faisla Karengay Key Kya Karna Hai.. (The efforts and initiatives, expected from the Home Minister of this country, have already been exhausted by me in my tenure as the Union Home Minister… Now it is for them to take a call as what they want to do…),” he said.  Responding to another query related to “Operation All–Out” in the Valley to weed-out terrorism, Rajnath said that day was not far off to achieve that mark. “There are no two opinions about it that the Kashmir will get rid of terrorism very soon. Rest assured….it’s going to happen very soon. More so, I believe- as in case of any act of terror occurring anywhere in the world, the way the international community is rallying around on one platform, joining hands to take on this threat, it (terrorism) will be wiped out of - not only Kashmir, Jammu ...but the entire world,” he said.What was that challenge which was main obstacle in resolving Kashmir, in the Defence Minister’s opinion as he had earlier served as the Union Home Minister also? Faced with this query, Rajnath said, “There’s no need to analyse that challenge here. Whatever be the challenge, it will be tackled. We very well know all the reasons, we’ll sort them out and J&K will be rid of terrorism, for sure.”   In response to queries related to recurrent ceasefire violations by Pakistan on IB and LoC, even on the day of his visit to J&K today and the probability of another Kargil-like misadventure by the neighbouring nation (Pak), his terse reply was, “This message is for all the countrymen- Have faith in our country’s leadership - the Prime Minister Narendra Modi and the valiant jawans and officers of our armed forces. They will not let down your faith in them.”Earlier he said, “I’ve just returned from Kargil. Accompanied by the Army Chief General Bipin Rawat and Union Minister of State in PMO Dr Jitendra Singh, I saw those majestic peaks, which were freed from the clutches of Pakistan by our valiant soldiers by laying down their lives yet not before incurring a crushing defeat to the enemy and failing its evil designs. I’ve just witnessed the testimonies to their (gallant soldiers’) valour and heroic deeds which earned India a proud victory.”Rajnath stated that the Ujh bridge, which as per Director General-Border Road Organisation’s assertion, was the longest bridge constructed by the organization anywhere in the country, would ease problems of border residents related to connectivity. “In the form of bridge, the long pending demand of border residents has been realized. The strenuous efforts of Border Road Organisation (BRO) to complete this bridge in stipulated period despite lot of problems and hostile conditions are, undoubtedly, laudable,” the Defence Minister said."
    },
    {
        "sr_no": 21,
        "newspaper": "kashmir Times",
        "headline": "Army pays tribute to brave-heart",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92766",
        "brief": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. \r\nToday, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid hom...",
        "date": "7/19/2019 10:28:45 AM",
        "detailed_news": "SRINAGAR, Jul 18: Army on Thursday paid rich tributes to a soldier killed in north Kashmir's Kupwara district. Naik Ramandeep lost his life in north Kashmir in the line of duty on July 17, 2019. Today, Lt Gen KJS Dhillon, Chinar Corps Commander and all ranks paid homage to the martyr on behalf of a proud nation.Singh was 35 years old and had joined the Army in 2002. He belonged to Village Tibba of Dhuri Tehsil in Sangrur District of Punjab and is survived by wife, a son and a daughter."
    },
    {
        "sr_no": 24,
        "newspaper": "kashmir Times",
        "headline": "Village girl turned IAF fighter pilot inspiring J&K youngsters",
        "link": "http://www.kashmirtimes.com/newsdet.aspx?q=92763",
        "brief": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. \r\nIn a series of motivational lectures, Thakur told s...",
        "date": "7/19/2019 10:28:04 AM",
        "detailed_news": "BHADERWAH, Jul 18: Hailing from a nondescript hamlet in Jammu and Kashmir, Jubiksha Thakur (24), a fighter pilot in the Indian Air Force (IAF), is the new source of inspiration for young boys and girls in the state. In a series of motivational lectures, Thakur told students on Thursday that the decision to come to Bhadarwah to take part in the \"Sangam Youth Festival\" organised by the army changed her life forever as she decided to join the armed forces. Hailing from Billan Bowlian in Udhampur district, Thakur joined the IAF as a fighter pilot this year, one of the first few women in the country to have done so. Her motivational lectures, organised by the Rashtriya Rifles unit based at Bhadarwah, are inspiring youngsters, especially girls, in the state to make a mark in life. “I decided that I had to go for it, whatever it took. I would want every young boy and girl wanting to become a fighter pilot to dream big,” Thakur told. In her message to the students of Kendriya Vidyalaya and PG College Bhadarwah, she said, “Your dreams may seem unconquerable at the moment. But you must chase those so hard that they become reality.” Stating that a \"combination of average qualities\" in her made her unique, Thakur said, “I climbed the ladder step by step, committing some mistakes as well, but kept going as I learned it the hard way. Instead of mourning over your failures and get into self pity, you should work harder to achieve your goals.” She said being an NCC cadet helped her keep her nerves in the most difficult situations. The lectures were followed by question-answer sessions with the students. Aarushi, a Class 12 science student of Kendriya Vidyalaya, said she always thought becoming a doctor was the only option for her but Thakur''s words changed that. “I already feel like flying as joining the army is my childhood dream. I will definitely strive harder to make my dream a reality,” she said. Komal Katal (27) of Garh Bhadarwah village said, “I always wanted to join the Army but in this part of the state, I never got an opportunity to try my luck. Although I could not appear in AFCAT (Air Force Common Admission Test) because of the age bar, after attending the lecture of Jubiksha, I will work harder and give it a try to join the Territorial Army.” Besides Thakur, Commanding Officer, 4 Rashtriya Rifles Colonel D D Pandey also shared his experiences with the students. “You should be passionate about your dreams and to reach your destination, you should not hesitate and think longer to take your first step. Just start your journey today and you will definitely reach your destination,” he said."
    },
    {
        "sr_no": 50,
        "newspaper": "Hindustan Times",
        "headline": "\nMurdered rifleman Aurangzeb’s brothers join army, vow to avenge his death\n",
        "link": "http://www.hindustantimes.com/india-news/murdered-rifleman-aurangzeb-s-brothers-join-army-vow-to-avenge-his-death/story-mN6UEKzcEcXGowb84m6EVI.html",
        "brief": "",
        "date": "Jul 23, 2019 14:53 IST",
        "detailed_news": [
            "Two brothers of an Indian Army soldier, who was abducted and killed by militants last year, have joined the armed forces to “serve the nation and avenge his death”.",
            "Mohammed Tariq, 23, and Mohammed Shabbir, 21, attended an enrolment parade of 100 new recruits in the Territorial Army in Rajouri on Monday, according to a defence spokesperson.",
            "“They were enrolled into a territorial battalion on Monday and now they will undergo training at Punjab Regimental Centre,” the spokesperson said.",
            "They posed with their parents Mohammed Hanif and Raaj Begum after donning the olive green. Hanif is also a former army man. ",
            "Aurangzeb was abducted in Pulwama and later killed by armed terrorists on June 14, 2018, when he was on his way back home in Poonch to celebrate Eid with his family. He was a rifleman in the army’s 44 Rashtriya Rifles. ",
            "“Our brother gave his life for the nation and we will also follow his footsteps. We will not step back when it comes to sacrificing our lives for the nation. We will make him proud and will make Punjab regiment proud by our duty,” said Tariq.",
            "Their father Hanif, a former Jammu and Kashmir Light Infantry soldier, said he may not live to see the “day but his two sons will take revenge of their brother Aurangzeb’s killing.”",
            "“Tariq and Shabbir also want to serve the nation and protect their fellow citizens. Yes, I have lost my son Aurangzeb and death lurks a soldier but then not many have the guts to sacrifice their life for the nation,” he said while speaking to HT over the phone.",
            "“Aurangzeb was trapped and then killed by the cowards. We still miss him,” Hanif said.",
            "Hanif joined the Bharatiya Janata Party (BJP) earlier this year in the presence of Prime Minister Narendra Modi at a public rally in Vijaypur area of Samba district.",
            "Also read | Militant involved in armyman’s murder among 4 killed in Valley",
            "\n\n"
        ]
    },
    {
        "sr_no": 64,
        "newspaper": "Dawn",
        "headline": "China says US 'power politics' undermines global stability\n",
        "link": "https://www.dawn.com/news/1495943/china-says-us-power-politics-undermines-global-stability",
        "brief": "",
        "date": "July 24, 2019",
        "detailed_news": [
            "China on Wednesday accused the United States of undermining global stability with unilateral policies and “power politics” as the Defense Ministry issued the first comprehensive outline of its policies since President Xi Jinping came to power more than six years ago.",
            "The US was the first country mentioned in the document’s opening section about “prominent destabilising factors” and “profound changes” in the international security environment.",
            "“The US has adjusted its national security and defense strategies, and adopted unilateral policies,” China said in the document. “It has provoked and intensified competition among countries, significantly increased its defense expenditure [...] and undermined global strategic stability.”",
            "It’s the 10th white paper of its kind since 1998. The last one was published in 2011, two years before Xi became president.",
            "The document said China will not renounce the use of force in efforts to reunify Taiwan with the mainland and vowed to take all necessary military measures to defeat “separatists”.",
            "China listed among its top priorities its resolve to contain “Taiwan independence” and combat what it considers separatist forces in Tibet and the far west region of Xinjiang. While highlighting China’s “defensive” approach, the report also pledged to “surely counterattack if attacked”.",
            "China’s paramilitary police have helped Xinjiang authorities “take out 1,588 violent terrorist gangs and capture 12,995 terrorists”, the report said. The US, independent analysts and human rights groups have estimated that around 1 million Muslims have been detained in internment camps as part of what the government calls a counterterrorism campaign.",
            "Former Uighur and Kazakh detainees and their families have accused China of punishing religious expression and separating children from their parents. They say members of their predominantly Muslim ethnic groups have been arbitrarily detained and subject to political indoctrination.",
            "Defense Ministry spokesperson Wu Qian said the threat of Taiwan separatism is growing and warned that those who are seeking the democratic island’s independence will meet a dead end.",
            "“If anyone dares to separate Taiwan from China, the Chinese army will certainly fight, resolutely defending the country’s sovereign unity and territorial integrity,” Wu said.",
            "Taiwan split from the Communist Party-ruled mainland China amid civil war in 1949. China maintains that Taiwan is part of its territory and seeks “complete reunification”.",
            "The US has repeatedly raised Beijing’s ire by selling arms to Taiwan. While the US does not have formal diplomatic ties with the island, US law requires that it provide Taiwan with sufficient defense equipment and services for self-defense.",
            "Earlier this month, the US tentatively approved the sale of $2.2 billion in arms to Taiwan — a proposal that had prompted China to threaten sanctions against the US. Taiwan’s defense ministry said it made the request in light of a growing military threat from China.",
            "“The Western world, led by the United States, continues to strengthen its ability to contain China,” said Hong Kong-based military analyst Song Zhongping. US actions on Taiwan, the South China Sea, North Korea and Iran have all contributed to making the US the “initiator” of China’s security concerns, he said.",
            "The release of the white paper at this time is to “warn the Taiwan independence forces and relevant parties in the US that they should not underestimate China’s determination”, Song said."
        ]
    },
    {
        "sr_no": 73,
        "newspaper": "Dawn",
        "headline": "Army chief meets US state secy, military leadership in Washington\n",
        "link": "https://www.dawn.com/news/1495934/army-chief-meets-us-state-secy-military-leadership-in-washington",
        "brief": "",
        "date": "July 24, 2019",
        "detailed_news": [
            "Army Chief Gen Qamar Javed Bajwa, who accompanied Prime Minister Imran Khan on his three-day official trip to Washington, met United States Secretary of State Michael Pompeo and the country's top military leadership during his visit.  ",
            "Inter-Services Public Relations (ISPR) spokesperson Maj Gen Asif Ghafoor, in a series of tweets on Wednesday, gave an update on the military chief's engagements in the US.",
            "Apart from Pompeo, the chief of army staff met Acting Defense Secretary Richard Spencer, Chairman of the Joint Chiefs of Staff Committee Gen Joseph F. Dunford and Joint Chief of Staff Gen Mark Milley. He was also part of the delegation that accompanied the prime minister on his visit to the White House.",
            "Read: PM Imran talks peace with Taliban, meeting Trump and 'concerns' about Pakistan's nuclear weapons",
            "Gen Bajwa was received at Pentagon by Gen Dunford and was presented a 21-gun salute.",
            "Regional security situation and bilateral military cooperation between Pakistan and US dominated the discussions between Gen Bajwa and US military leadership.",
            "\"US leadership acknowledged contributions of Pakistan Army in the war against terrorism and [its] role towards the Afghan peace process,\" ISPR Director General Maj Gen Ghafoor shared on his official Twitter account.",
            " ",
            "The ongoing Afghan peace process remained a major point of discussion during Gen Bajwa's meeting with US Secretary of State Pompeo. The two also talked about the importance of bilateral relations between the two countries.",
            "\"Pakistan attaches great importance to restoring a robust bilateral relationship based on mutual respect, trust and shared values,\" the army chief was quoted as saying by DG ISPR.",
            " ",
            "In a meeting with US Senator Lindsay Graham and retired US Gen Jack Keane, the army chief said that healthy relations between both countries were important for regional stability.",
            "\"Bilateral relationship holds potential for both countries and would also assist in regional stability,\" Gen Bajwa was quoted as saying.",
            " ",
            "He briefed Graham and Keane on the improved security situation of Pakistan and also highlighted the \"resulting opportunities\" for foreign investors. ",
            "Gen Bajwa also paid homage to US national heroes at the Arlington National Cemetery, where a special ceremony was held during which the national anthems of both countries were played."
        ]
    },
    {
        "sr_no": 77,
        "newspaper": "Tribune",
        "headline": "\nCOAS meets top US military commanders during Pentagon visit\n",
        "link": "https://tribune.com.pk/story/2020115/1-coas-meets-top-us-military-commanders-pentagon-visit/",
        "brief": "",
        "date": "July 24, 2019",
        "detailed_news": [
            "ISLAMABAD                      : Chief of the Army Staff General Qamar Javed Bajwa visited the Pentagon and met Chairman Joint Chief of Staff (CJCS) General Joseph F Dunford during the three-day visit by Pakistani leadership to the United States, said a statement issued by the Inter-Services Public Relations ISPR).",
            "The COAS also met with Acting Secretary of Defence Richard Spencer and the Chief of Staff of the US Army General Mark A Milley.",
            "General Milley is President Donald Trump’s pick to replace General Dunford as the US military chief.",
            "On the occasion, the army chief was presented a guard of honour with a 21 gun salute.",
            "During the high-level moot, the army chief and the acting defence secretary discussed the regional security situation including the Afghan end game.",
            "Both, the secretary and the CJCS, acknowledged Pakistan Army’s contributions in the war against terrorism.",
            "The huddle also elaborated on matters related to security and bilateral military cooperation.",
            "During the visit, General Bajwa visited Arlington National Cemetery to pay tribute to the national heroes of the US. The national anthem of both countries was played as a special ceremony was held at the cemetery.",
            "The army chief’s meetings hold greater significance in the backdrop of General Milley’s recent assertion that the US needs to maintain strong military ties with Islamabad due to the shared interests of the two countries.",
            "General Bajwa is visiting Washington DC alongside Prime Minister Imran Khan on his maiden visit to the US on the invitation of President Trump.",
            "The premier is accompanied by the Adviser to PM on Commerce Abdul Razzak Dawood and Special Assistant on Overseas Zulfi Bukhari. Foreign Minister Shah Mehmood Qureshi was already present in Washington as part of the entourage prior to the premier’s arrival on July 21.",
            " "
        ]
    },
    {
        "sr_no": 82,
        "newspaper": "Tribune",
        "headline": "PM Imran concludes US trip",
        "link": "https://tribune.com.pk/story/2020133/1-pm-imran-concludes-us-trip/",
        "brief": "",
        "date": "July 24, 2019",
        "detailed_news": [
            "Prime Minister Imran Khan concluded his three-day visit to Washington and departed for Pakistan.",
            "During his visit, the premier held talks with US President Donald Trump, interacted with Congressional leaders and addressed a think tank.",
            "The Afghan peace process remained at the top of the agenda during his meetings with members of the Trump administration.",
            "Imran has assured US that Pakistan will do everything within its power to facilitate the Afghan peace process.",
            "In a tweet, he said the world owes it to the long-suffering Afghan people to bring about peace after four decades of conflict.",
            "The premier thanked the US President Donald Trump for his warm and gracious hospitality and his understanding of Pakistan’s point of view.",
            "Imran appreciated the US President for taking out time to show Pakistani delegation the historic White House private quarters.",
            "The prime minister also spoke to Pakistani-Americans at Capital Arena that turned out to be one of the biggest ever gatherings addressed by a Pakistani leader.",
            "The premier was accompanied by Adviser to PM on Commerce, Abdul Razzak Dawood, Special Assistant on Overseas, Zulfi Bukhari, and Chief of the Army Staff, General Qamar Javed Bajwa, while Foreign Minister Shah Mehmood Qureshi."
        ]
    },
    {
        "sr_no": 136,
        "newspaper": "The News",
        "headline": "No aid needed: PM",
        "link": "https://www.thenews.com.pk/print/502718-no-aid-needed-pm",
        "brief": "\n\n\t\t\t\t\n    \n\nWASHINGTON: Prime Minister Imran Khan on Tuesday expressed the desire to establish unconditional bilateral relations between Islamabad and Washington based on mutual trust and friendship.&ldquo;We would like to have a relationship based on mutual trust, as equals, as friends and not as before when Pakistan wanted aid and in return it was asked to perform certain tasks for the US,&rdquo; said the prime minister, while speaking at the United States Institute of Peace on the last day of his three-day maiden visit to Washington.&ldquo;I am happy to leave the US now, as we have relationship based on mutual interest, which is peace in Afghanistan,&rdquo; he added.Prime Minister Imran said that he hated the idea of asking for funds not just from the US but from any other country. &ldquo;Because, aid has been one of the biggest curses for my country&hellip; what it has done is, it has created the dependency syndrome,&rdquo; he remarked.&ldquo;When I returned home from Saudi Arabia, everybody asked what have you got from there, as if I went there asking for money&hellip; and I think it&rsquo;shumiliating for a country. Countries rise because of self-respect and self-esteem and no country rise by begging for money.He said he would like to have dignified relationship with the US, where never again should we have this humiliating phase.&ldquo;I can tell you as a Pakistani, never did I feel more humiliated when Osama bin Laden was taken out in Pakistan by the US troops. We want to have a relationship of friendship&hellip; and doesn&rsquo;t really matter you know as one friend can be rich and the other can be not that rich, but so what&hellip; it&rsquo;s all about dignified relationship. That&rsquo;s what I hope to have from here,&rdquo; he said.The premier also reiterated the desire to have friendly relations with all immediate neighbours of the country including India. He said that his government reached out to all neighbouring countries to iron out differences and rebuild confidence to establish better trade ties after coming into power last year.Commenting on the Afghan peace process, Imran Khan vowed that he would try to pursue the Taliban to come to the negotiation table after returning from Washington. He said that a Taliban delegation wanted to meet him a few months back but he did not because of opposition from the Afghan government. &ldquo;Now I will meet the Taliban and I will try my best to get them to talk to the Afghan government,&rdquo; he said, adding that he has gained their trust for professing right from the first day that the issue could only be resolved through dialogue.The prime minister started off the address by narrating his life&rsquo;s struggle from cricketing days to becoming a social worker and building a cancer hospital and how he formed his political party 23 years ago after realising that the country&rsquo;s sufferings would not finish just by doing social work.Prime Minister Imran said Pakistan was the fastest growing country in the region in the 1960s. But, like other colonial countries, corruption held it back after the mid-1980s. He said massive fiscal deficit and corruption remained two biggest challenges for his government after being elected to power in the last year&rsquo;s polls. He blamed the last two governments of Pakistan People&rsquo;s Party (PPP) and Pakistan Muslim League-Nawaz (PML-N) for the country&rsquo;s crippling economy.&ldquo;Money which should have be used for public welfare, laundered to foreign countries by the corrupt rulers. In order to take the money out, these political elite destroyed state institutions,&rdquo; he maintained.&ldquo;I felt that I was fighting with a mafia, which has been termed as &lsquo;Sicilian mafia&rsquo; by the Supreme Court,&rdquo; he said.The prime minister gave credit to his election victory to the country&rsquo;s youth, saying that over 60 percent of the country&rsquo;s population is comprised youth, who became his biggest support. &ldquo;Without social media we wouldn&rsquo;t have beaten these political mafia parties,&rdquo; he added.Commenting on the rising inflation and rupee&rsquo;s downslope against dollar, Imran Khan said his political opponents spread &lsquo;fake news&rsquo; about the country&rsquo;s economy and that the IMF wanted rupee at a certain value. &ldquo;We nearly ran out of dollars. Now things are stabilising because of our hard work,&rdquo; he maintained.&ldquo;We are also fixing taxation system. Without expanding tax net, no country can progress. It&rsquo;s imperative that every Pakistani pays taxes,&rdquo; he said.Blaming Nawaz Sharif and Asif Zardari for increasing the country&rsquo;s external debt in the last 10 years, he said Pakistan&rsquo;s total debt in 60 years was Rs6 trillion after Pervez Musharraf&rsquo;s government, and in the last 10 year they increased it to Rs30 trillion. &ldquo;They burdened the country with Rs24 trillion through looting and plundering,&rdquo; he added.Meanwhile, Prime Minister Imran Khan, in an interview with Fox News said that he found the US President Donald Trump \"refreshing and straightforward\".\"I was very happy with the meeting. I found President Trump refreshing, no mixing, no juggling with words. He just came out straight with things. Not just me, my whole delegation loved the meeting,\" he said.About Afghanistan, he said people in Afghanistan have suffered four decades of conflict. He said the last thing Afghanistan needs is more violence and it needs peace.\"The Taliban should become a part of the political process, so then you would have a government which will represent the people of Afghanistan,\" he said.When asked if negotiations had been sufficiently productive, the premier said: \"I think they have been the most productive so far. I mean up to date, they have gone the furthest in the two sides coming together.\"The host asked the premier about Taliban initiating attacks, such as the one in Dera Ismail Khan on Sunday which was claimed by the banned Tehreek-e-Taliban Pakistan&rsquo;s Khorasani group, while negotiations were underway.\"The danger is, of course for Afghanistan and Pakistan, that if we do not have some sort of a peace settlement in Afghanistan, the danger of ISIS is more of a danger not just to us, but to other countries too,\" replied the prime minister.He said Pakistan hopes to give good news regarding freeing of some foreigners &mdash; including Americans and Australians &mdash; kidnapped and held in Afghanistan.Asked about Dr Shakil Afridi, who has been in detention since 2011 after being taken into custody for helping American Central Intelligence Agency (CIA) in tracking down al-Qaeda chief Osama bin Laden, Imran Khan said it was a \"very emotive issue\".\"Shakil Afridi in Pakistan is considered a spy. We in Pakistan always felt that we were an ally of the US and that we had been given the information about Osama bin Laden, we should have taken him out,\" he said.The prime minister pointed out: \"It was the ISI which gave the information which led to the location of Osama bin Laden. If you ask CIA, it was the ISI which gave the initial location through the phone connection.\"&ldquo;Pakistan was fighting the war for the US, Pakistan wasn't attacked at the time it hugely embarrassed Pakistan,\" the premier said. \"Pakistanis were embarrassed. Here we were, an ally of the US and the US did not trust us, and they actually came in and bombed and killed a man in our territory,\" he said.Imran Khan reminded that Pakistan lost 70,000 people in this fight. &ldquo;We were fighting this war for the US and we lost all these people fighting this war. So there was obviously a lot of anger about the way this whole thing was done. But that's all in the past,\" he said.About Dr Afridi, Imran Khan said there are some decisions in a democracy which even a prime minister finds difficult because &ldquo;we do have an opposition&rdquo;. &ldquo;But this is something that can be negotiated. We also have someone in prison in the US, a frail woman called Aafia Siddiqui, so yes we could negotiate some sort of a swap,\" said the premier.Dr Aafia Siddiqui, a neurologist, has been languishing in a United States jail on charges of trying to kill US agents and military officers in Afghanistan.The premier said the prisoner swap was not discussed in the meeting with Trump and that so far no negotiations had started, but Pakistan would be open to it.Asked if India said we would give up our nuclear weapons, would Pakistan? \"Yes,\" replied the premier. \"Because nuclear war is not an option. And between Pakistan and India, the idea of nuclear war is actually self-destruction, because we have two and a half thousand-mile border. Also, I think there's a realisation in the Sub-Continent and there was some incident that happened last February and we again had tension at the border. An Indian plane was shot down in Pakistan,&rdquo; he said.\"So there's a realisation and that's why I asked President Trump if he could play his role. The US is the most powerful country in the world, the only country that could mediate between Pakistan and India, and the only issue is Kashmir. The only reason for 70 years, that we have not been able to live like civilised neighbours, is because of Kashmir,\" he said.The interviewer mentioned India's response to Trump's comments on Narendra Modi asking the US president to mediate. \"I really feel that India should come on the table,\" reiterated the prime minister. \"The US could play a big part, President Trump certainly can play a big part. We're talking about 1.3 billion people on this Earth. Imagine the dividends of peace if somehow that issue could be resolved,\" he said.When asked about Iran wanting a nuclear weapon, the premier replied, \"I can't say but as a neighbour of Iran, we certainly hope that this does not become a full-blown conflict.\"We would love to help if we are asked because we are a neighbour of Iran. the last thing we want is a conflict in Iran, which will obviously affect us. Not just us, but it will affect oil prices, the United Arab Emirates, Saudi Arabia. We would do anything for a peaceful resolution,\" he said.The premier said there was absolutely no need to worry about Pakistan's nuclear weapons because Pakistan has one of the most professional armies. &ldquo;We have one of the most comprehensive command and control of our nuclear weapons. The United States knows about it because we share our intelligence with the US about the way we have the safety measures about our nuclear programme,\" he said.Imran said the whole idea of his meeting with Trump was that both the countries should be on one page. &ldquo;This mistrust which has dogged our relationship. Pakistan -- was it an ally or was it an enemy? We were bombed by drone attacks by an ally,\" said the prime minister.\"All this mistrust in the past, we wanted to reset our relationship based on understanding that we are on the same page. We want peace in Afghanistan, Pakistan will do everything to help the Taliban come on the dialogue table so that there is peace. We struck that understanding today. I came out feeling that we really now are allies. Both of us want peace in Afghanistan and Pakistan will do everything possible to ensure that this peace process goes forward,\" he said.Imran Khan said the Pakistan military establishment was always mindful that there would be a two-front situation. &ldquo;So there would be the eastern front, which is India, and if Afghanistan was also in the Indian sphere of influence then Pakistan would be sandwiched between the two.\"He said owing to this worry the military always wanted what it called \"strategic depth\".\"But this has changed. Today there is no concept in Pakistan of strategic depth. Because we feel that by interfering in Afghanistan, in order to secure the strategic depth, we have actually done a lot of damage to our own country. And for no rhyme or reason we have become partisan in Afghanistan's internal affairs,&rdquo; he said.He said that in the past there was always this impression that Pakistan Army is an independent entity and governments have no control over it. \"I can sit here and tell you that as I speak, the Pakistan Army is exactly behind the government's programme. Whatever policies from day one, whether it was peace with India, they were behind us,\" he said, pausing to mention that when he had decided to release the Indian pilot captured by the Army, they supported his decision.\"There is no difference between the policies of Pakistan's security forces or the policies of Pakistan's democratic government,\" he said.\"Prior to our government coming into power, past governments did not have the political will, we were the first government to start disarming militant groups. We have taken over their institutes, their seminaries, we have (placed) administrators there. For the first time we have decided there will be no armed militias inside our country,\" he said.Imran Khan mentioned that in 2004, under pressure from the US, Pakistan Army went into the tribal areas to flush out al-Qaeda. &ldquo;What happened was, after Tora Bora in Afghanistan, a few of the al-Qaeda moved down into our tribal areas which were semi-autonomous. When they sent the army in, you know armies are not meant to go into civilian areas. Whenever you send your army into civilian areas there will always be human rights abuses because there is no army there, there are just guerillas operating from villages. The collateral damage created what became the Pakistani Taliban. There was no Pakistani Taliban (group) before,\" he said.Meanwhile, Imran Khan said the government will provide every possible support to the US investors in Pakistan.He was talking to a delegation of Bower Group Asia led by its Senior US business executive, which called on him in Washington. The premier apprised the delegation about the investment opportunities in 'Naya Pakistan'. He said measures are being taken for ease of doing business in Pakistan. Investment opportunities in Pakistan also came under discussion during the meeting. The delegation apprised the prime minister of its business projects in Pakistan.US-Pakistan Business Council delegation led by Myron Brilliant, Executive Vice President and Head of International Affairs of US Chamber of Commerce, also called on Prime Minister Imran Khan at Embassy of Pakistan in Washington DC.Meanwhile, a delegation of Pakistani-American donors called on Imran Khan in Washington. The donors reiterated their commitment to continue cooperation with Shaukat Khanum Memorial Cancer Hospital.\n\t\t\t",
        "date": "Wed, 24 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 139,
        "newspaper": "The News",
        "headline": "Gen Bajwa, US military top brass discuss issues: COAS visits Pentagon",
        "link": "https://www.thenews.com.pk/print/502721-gen-bajwa-us-military-top-brass-discuss-issues-coas-visits-pentagon",
        "brief": "\n\n\t\t\t\tWASHINGTON: Chief of the Army Staff (COAS) General Qamar Javed Bajwa visited Pentagon. On arrival, the COAS was received by Chairman Joint Chief of Staff (CJCS) General Joseph F Dunford. Gen Bajwa was presented a guard of honour with 21-gun salute.The army chief had a discussion session with Acting Secretary of Defence Richard V. Spencer and Gen Dunford. Regional security, including Afghan peace process, was discussed. The US acting secretary and CJCS acknowledged contributions of Pak Army in the war against terrorism and role towards Afghan peace process.The army chief also met Chief of Staff US Army General Mark A Milley. Matters related to security and bilateral military cooperation were discussed.Later, the COAS visited Arlington National Cemetery to pay homage to US National heroes. A special ceremony was held at the cemetery playing national anthem of both the countries.\n\t\t\t",
        "date": "Wed, 24 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 174,
        "newspaper": "The News",
        "headline": "No aid needed: PM",
        "link": "https://www.thenews.com.pk/print/502879-no-aid-needed-pm",
        "brief": "\n\n\t\t\t\tWASHINGTON: Prime Minister Imran Khan on Tuesday expressed desire to establish unconditional bilateral relations between Islamabad and Washington based on mutual trust and friendship.&ldquo;We would like to have a relationship based on mutual trust, as equals, as friends and not as before when Pakistan wanted aid and in return it was asked to perform certain tasks for the US,&rdquo; said the prime minister, while speaking at the United States Institute of Peace on the last day of his three-day maiden visit to Washington.&ldquo;I am happy to leave the US now, as we have relationship based on mutual interest, which is peace in Afghanistan,&rdquo; he added.Prime Minister Imran said that he hated the idea of asking for funds not just from the US but from any other country. &ldquo;Because, aid has been one of the biggest curses for my country&hellip; what it has done is, it has created the dependency syndrome,&rdquo; he remarked.&ldquo;When I returned home from Saudi Arabia, everybody asked what have you got from there, as if I went there asking for money&hellip; and I think it&rsquo;s humiliating for a country. Countries rise because of self-respect and self-esteem and no country rise by begging for money. He said he would like to have dignified relationship with the US, where never again should we have this humiliating phase. &ldquo;I can tell you as a Pakistani, never did I feel more humiliated when Osama bin Laden was taken out in Pakistan by the US troops. We want to have a relationship of friendship&hellip; and doesn&rsquo;t really matter you know as one friend can be rich and the other can be not that rich, but so what&hellip; it&rsquo;s all about dignified relationship. That&rsquo;s what I hope to have from here,&rdquo; he said. The premier also reiterated the desire to have friendly relations with all immediate neighbours of the country including India. He said that his government reached out to all neighbouring countries to iron out differences and rebuild confidence to establish better trade ties after coming into power last year.Commenting on the Afghan peace process, Imran Khan vowed that he would try to pursue the Taliban to come to the negotiation table after returning from Washington. He said that a Taliban delegation wanted to meet him a few months back but he did not because of opposition from the Afghan government. &ldquo;Now I will meet the Taliban and I will try my best to get them to talk to the Afghan government,&rdquo; he said, adding that he has gained their trust for professing right from the first day that the issue could only be resolved through dialogue.The prime minister started off the address by narrating his life&rsquo;s struggle from cricketing days to becoming a social worker and building a cancer hospital and how he formed his political party 23 years ago after realising that the country&rsquo;s sufferings would not finish just by doing social work.Prime Minister Imran said Pakistan was the fastest growing country in the region in the 1960s. But, like other colonial countries, corruption held it back after the mid-1980s. He said massive fiscal deficit and corruption remained two biggest challenges for his government after being elected to power in the last year&rsquo;s polls. He blamed the last two governments of Pakistan People&rsquo;s Party (PPP) and Pakistan Muslim League-Nawaz (PML-N) for the country&rsquo;s crippling economy.&ldquo;Money which should have be used for public welfare, laundered to foreign countries by the corrupt rulers. In order to take the money out, these political elite destroyed state institutions,&rdquo; he maintained.&ldquo;I felt that I was fighting with a mafia, which has been termed as &lsquo;Sicilian mafia&rsquo; by the Supreme Court,&rdquo; he said.The prime minister gave credit to his election victory to the country&rsquo;s youth, saying that over 60 percent of the country&rsquo;s population is comprised youth, who became his biggest support. &ldquo;Without social media we wouldn&rsquo;t have beaten these political mafia parties,&rdquo; he added.Commenting on the rising inflation and rupee&rsquo;s downslope against dollar, Imran Khan said his political opponents spread &lsquo;fake news&rsquo; about the country&rsquo;s economy and that the IMF wanted rupee at a certain value. &ldquo;We nearly ran out of dollars. Now things are stabilising because of our hard work,&rdquo; he maintained.&ldquo;We are also fixing taxation system. Without expanding tax net, no country can progress. It&rsquo;s imperative that every Pakistani pays taxes,&rdquo; he said.Blaming Nawaz Sharif and Asif Zardari for increasing the country&rsquo;s external debt in the last 10 years, he said Pakistan&rsquo;s total debt in 60 years was Rs6 trillion after Pervez Musharraf&rsquo;s government, and in the last 10 year they increased it to Rs30 trillion. &ldquo;They burdened the country with Rs24 trillion through looting and plundering,&rdquo; he added.Meanwhile, Prime Minister Imran Khan, in an interview with Fox News said that he found the US President Donald Trump \"refreshing and straightforward\".\"I was very happy with the meeting. I found President Trump refreshing, no mixing, no juggling with words. He just came out straight with things. Not just me, my whole delegation loved the meeting,\" he said.About Afghanistan, he said people in Afghanistan have suffered four decades of conflict. He said the last thing Afghanistan needs is more violence and it needs peace.\"The Taliban should become a part of the political process, so then you would have a government which will represent the people of Afghanistan,\" he said.When asked if negotiations had been sufficiently productive, the premier said: \"I think they have been the most productive so far. I mean up to date, they have gone the furthest in the two sides coming together.\"The host asked the premier about Taliban initiating attacks, such as the one in Dera Ismail Khan on Sunday which was claimed by the banned Tehreek-e-Taliban Pakistan&rsquo;s Khorasani group, while negotiations were underway.\"The danger is, of course for Afghanistan and Pakistan, that if we do not have some sort of a peace settlement in Afghanistan, the danger of ISIS is more of a danger not just to us, but to other countries too,\" replied the prime minister.He said Pakistan hopes to give good news regarding freeing of some foreigners &mdash; including Americans and Australians &mdash; kidnapped and held in Afghanistan.Asked about Dr Shakil Afridi, who has been in detention since 2011 after being taken into custody for helping American Central Intelligence Agency (CIA) in tracking down al-Qaeda chief Osama bin Laden, Imran Khan said it was a \"very emotive issue\".\"Shakil Afridi in Pakistan is considered a spy. We in Pakistan always felt that we were an ally of the US and that we had been given the information about Osama bin Laden, we should have taken him out,\" he said.The prime minister pointed out: \"It was the ISI which gave the information which led to the location of Osama bin Laden. If you ask CIA, it was the ISI which gave the initial location through the phone connection.\"&ldquo;Pakistan was fighting the war for the US, Pakistan wasn't attacked at the time it hugely embarrassed Pakistan,\" the premier said. \"Pakistanis were embarrassed. Here we were, an ally of the US and the US did not trust us, and they actually came in and bombed and killed a man in our territory,\" he said.Imran Khan reminded that Pakistan lost 70,000 people in this fight. &ldquo;We were fighting this war for the US and we lost all these people fighting this war. So there was obviously a lot of anger about the way this whole thing was done. But that's all in the past,\" he said.About Dr Afridi, Imran Khan said there are some decisions in a democracy which even a prime minister finds difficult because &ldquo;we do have an opposition&rdquo;. &ldquo;But this is something that can be negotiated. We also have someone in prison in the US, a frail woman called Aafia Siddiqui, so yes we could negotiate some sort of a swap,\" said the premier.Dr Aafia Siddiqui, a neurologist, has been languishing in a United States jail on charges of trying to kill US agents and military officers in Afghanistan.The premier said the prisoner swap was not discussed in the meeting with Trump and that so far no negotiations had started, but Pakistan would be open to it.Asked if India said we would give up our nuclear weapons, would Pakistan? \"Yes,\" replied the premier. \"Because nuclear war is not an option. And between Pakistan and India, the idea of nuclear war is actually self-destruction, because we have two and a half thousand-mile border. Also, I think there's a realisation in the Sub-Continent and there was some incident that happened last February and we again had tension at the border. An Indian plane was shot down in Pakistan,&rdquo; he said.\"So there's a realisation and that's why I asked President Trump if he could play his role. The US is the most powerful country in the world, the only country that could mediate between Pakistan and India, and the only issue is Kashmir. The only reason for 70 years, that we have not been able to live like civilised neighbours, is because of Kashmir,\" he said.The interviewer mentioned India's response to Trump's comments on Narendra Modi asking the US president to mediate. \"I really feel that India should come on the table,\" reiterated the prime minister. \"The US could play a big part, President Trump certainly can play a big part. We're talking about 1.3 billion people on this Earth. Imagine the dividends of peace if somehow that issue could be resolved,\" he said.When asked about Iran wanting a nuclear weapon, the premier replied, \"I can't say but as a neighbour of Iran, we certainly hope that this does not become a full-blown conflict.\"We would love to help if we are asked because we are a neighbour of Iran. the last thing we want is a conflict in Iran, which will obviously affect us. Not just us, but it will affect oil prices, the United Arab Emirates, Saudi Arabia. We would do anything for a peaceful resolution,\" he said.The premier said there was absolutely no need to worry about Pakistan's nuclear weapons because Pakistan has one of the most professional armies. &ldquo;We have one of the most comprehensive command and control of our nuclear weapons. The United States knows about it because we share our intelligence with the US about the way we have the safety measures about our nuclear programme,\" he said.Imran said the whole idea of his meeting with Trump was that both the countries should be on one page. &ldquo;This mistrust which has dogged our relationship. Pakistan -- was it an ally or was it an enemy? We were bombed by drone attacks by an ally,\" said the prime minister.\"All this mistrust in the past, we wanted to reset our relationship based on understanding that we are on the same page. We want peace in Afghanistan, Pakistan will do everything to help the Taliban come on the dialogue table so that there is peace. We struck that understanding today. I came out feeling that we really now are allies. Both of us want peace in Afghanistan and Pakistan will do everything possible to ensure that this peace process goes forward,\" he said.Imran Khan said the Pakistan military establishment was always mindful that there would be a two-front situation. &ldquo;So there would be the eastern front, which is India, and if Afghanistan was also in the Indian sphere of influence then Pakistan would be sandwiched between the two.\"He said owing to this worry the military always wanted what it called \"strategic depth\".\"But this has changed. Today there is no concept in Pakistan of strategic depth. Because we feel that by interfering in Afghanistan, in order to secure the strategic depth, we have actually done a lot of damage to our own country. And for no rhyme or reason we have become partisan in Afghanistan's internal affairs,&rdquo; he said.He said that in the past there was always this impression that Pakistan Army is an independent entity and governments have no control over it. \"I can sit here and tell you that as I speak, the Pakistan Army is exactly behind the government's programme. Whatever policies from day one, whether it was peace with India, they were behind us,\" he said, pausing to mention that when he had decided to release the Indian pilot captured by the Army, they supported his decision.\"There is no difference between the policies of Pakistan's security forces or the policies of Pakistan's democratic government,\" he said.\"Prior to our government coming into power, past governments did not have the political will, we were the first government to start disarming militant groups. We have taken over their institutes, their seminaries, we have (placed) administrators there. For the first time we have decided there will be no armed militias inside our country,\" he said.Imran Khan mentioned that in 2004, under pressure from the US, Pakistan Army went into the tribal areas to flush out al-Qaeda. &ldquo;What happened was, after Tora Bora in Afghanistan, a few of the al-Qaeda moved down into our tribal areas which were semi-autonomous. When they sent the army in, you know armies are not meant to go into civilian areas. Whenever you send your army into civilian areas there will always be human rights abuses because there is no army there, there are just guerillas operating from villages. The collateral damage created what became the Pakistani Taliban. There was no Pakistani Taliban (group) before,\" he said.Meanwhile, Imran Khan said the government will provide every possible support to the US investors in Pakistan.He was talking to a delegation of Bower Group Asia led by its Senior US business executive, which called on him in Washington. The premier apprised the delegation about the investment opportunities in 'Naya Pakistan'. He said measures are being taken for ease of doing business in Pakistan. Investment opportunities in Pakistan also came under discussion during the meeting. The delegation apprised the prime minister of its business projects in Pakistan.US-Pakistan Business Council delegation led by Myron Brilliant, Executive Vice President and Head of International Affairs of US Chamber of Commerce, also called on Prime Minister Imran Khan at Embassy of Pakistan in Washington DC.Meanwhile, a delegation of Pakistani-American donors called on Imran Khan in Washington. The donors reiterated their commitment to continue cooperation with Shaukat Khanum Memorial Cancer Hospital.\n\t\t\t",
        "date": "Wed, 24 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 185,
        "newspaper": "The News",
        "headline": "Gen Bajwa, US military top brass discuss issues",
        "link": "https://www.thenews.com.pk/print/502890-gen-bajwa-us-military-top-brass-discuss-issues",
        "brief": "\n\n\t\t\t\tWASHINGTON: Chief of Army Staff (COAS) General Qamar Javed Bajwa visited Pentagon. On arrival, the COAS was received by Chairman Joint Chief of Staff (CJCS) General Joseph F Dunford. Gen Bajwa was presented guard of honour with 21-gun salute. The army chief had a discussion session with Acting Secretary of Defence Richard V. Spencer and Gen Dunford. Regional security, including Afghan peace process, was discussed. The US acting secretary and CJCS acknowledged contributions of Pak Army in war against terrorism and role towards Afghan peace process.The army chief also met Chief of Staff US Army General Mark A Milley. Matters related to security and bilateral military cooperation were discussed.Later, the COAS visited Arlington National Cemetery to pay homage to US National heroes. A special ceremony was held at the cemetery playing national anthem of both the countries.\n\t\t\t",
        "date": "Wed, 24 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 198,
        "newspaper": "The News",
        "headline": "No aid needed, says PM",
        "link": "https://www.thenews.com.pk/print/502916-no-aid-needed-says-pm",
        "brief": "\n\n\t\t\t\tWASHINGTON: Prime Minister Imran Khan on Tuesday expressed desire to establish unconditional bilateral relations between Islamabad and Washington based on mutual trust and friendship.&ldquo;We would like to have a relationship based on mutual trust, as equals, as friends and not as before when Pakistan wanted aid and in return it was asked to perform certain tasks for the US,&rdquo; said the prime minister, while speaking at the United States Institute of Peace on the last day of his three-day maiden visit to Washington.&ldquo;I am happy to leave the US now, as we have relationship based on mutual interest, which is peace in Afghanistan,&rdquo; he added.Prime Minister Imran said that he hated the idea of asking for funds not just from the US but from any other country. &ldquo;Because, aid has been one of the biggest curses for my country&hellip; what it has done is, it has created the dependency syndrome,&rdquo; he remarked.&ldquo;When I returned home from Saudi Arabia, everybody asked what have you got from there, as if I went there asking for money&hellip; and I think it&rsquo;s humiliating for a country. Countries rise because of self-respect and self-esteem and no country rise by begging for money.He said he would like to have dignified relationship with the US, where never again should we have this humiliating phase.&ldquo;I can tell you as a Pakistani, never did I feel more humiliated when Osama bin Laden was taken out in Pakistan by the US troops. We want to have a relationship of friendship&hellip; and doesn&rsquo;t really matter you know as one friend can be rich and the other can be not that rich, but so what&hellip; it&rsquo;s all about dignified relationship. That&rsquo;s what I hope to have from here,&rdquo; he said.The premier also reiterated the desire to have friendly relations with all immediate neighbours of the country including India. He said that his government reached out to all neighbouring countries to iron out differences and rebuild confidence to establish better trade ties after coming into power last year.Commenting on the Afghan peace process, Imran Khan vowed that he would try to pursue the Taliban to come to the negotiation table after returning from Washington. He said that a Taliban delegation wanted to meet him a few months back but he did not because of opposition from the Afghan government. &ldquo;Now I will meet the Taliban and I will try my best to get them to talk to the Afghan government,&rdquo; he said, adding that he has gained their trust for professing right from the first day that the issue could only be resolved through dialogue.The prime minister started off the address by narrating his life&rsquo;s struggle from cricketing days to becoming a social worker and building a cancer hospital and how he formed his political party 23 years ago after realising that the country&rsquo;s sufferings would not finish just by doing social work.Prime Minister Imran said Pakistan was the fastest growing country in the region in the 1960s. But, like other colonial countries, corruption held it back after the mid-1980s. He said massive fiscal deficit and corruption remained two biggest challenges for his government after being elected to power in the last year&rsquo;s polls. He blamed the last two governments of Pakistan People&rsquo;s Party (PPP) and Pakistan Muslim League-Nawaz (PML-N) for the country&rsquo;s crippling economy.&ldquo;Money which should have be used for public welfare, laundered to foreign countries by the corrupt rulers. In order to take the money out, these political elite destroyed state institutions,&rdquo; he maintained.&ldquo;I felt that I was fighting with a mafia, which has been termed as &lsquo;Sicilian mafia&rsquo; by the Supreme Court,&rdquo; he said.The prime minister gave credit to his election victory to the country&rsquo;s youth, saying that over 60 percent of the country&rsquo;s population is comprised youth, who became his biggest support. &ldquo;Without social media we wouldn&rsquo;t have beaten these political mafia parties,&rdquo; he added.Commenting on the rising inflation and rupee&rsquo;s downslope against dollar, Imran Khan said his political opponents spread &lsquo;fake news&rsquo; about the country&rsquo;s economy and that the IMF wanted rupee at a certain value. &ldquo;We nearly ran out of dollars. Now things are stabilising because of our hard work,&rdquo; he maintained.&ldquo;We are also fixing taxation system. Without expanding tax net, no country can progress. It&rsquo;s imperative that every Pakistani pays taxes,&rdquo; he said.Blaming Nawaz Sharif and Asif Zardari for increasing the country&rsquo;s external debt in the last 10 years, he said Pakistan&rsquo;s total debt in 60 years was Rs6 trillion after Pervez Musharraf&rsquo;s government, and in the last 10 year they increased it to Rs30 trillion. &ldquo;They burdened the country with Rs24 trillion through looting and plundering,&rdquo; he added.Meanwhile, Prime Minister Imran Khan, in an interview with Fox News said that he found the US President Donald Trump &ldquo;refreshing and straightforward&rdquo;.&ldquo;I was very happy with the meeting. I found President Trump refreshing, no mixing, no juggling with words. He just came out straight with things. Not just me, my whole delegation loved the meeting,&rdquo; he said.About Afghanistan, he said people in Afghanistan have suffered four decades of conflict. He said the last thing Afghanistan needs is more violence and it needs peace.&ldquo;The Taliban should become a part of the political process, so then you would have a government which will represent the people of Afghanistan,&rdquo; he said.When asked if negotiations had been sufficiently productive, the premier said: &ldquo;I think they have been the most productive so far. I mean up to date, they have gone the furthest in the two sides coming together.&rdquo;The host asked the premier about Taliban initiating attacks, such as the one in Dera Ismail Khan on Sunday which was claimed by the banned Tehreek-e-Taliban Pakistan&rsquo;s Khorasani group, while negotiations were underway.&ldquo;The danger is, of course for Afghanistan and Pakistan, that if we do not have some sort of a peace settlement in Afghanistan, the danger of ISIS is more of a danger not just to us, but to other countries too,&rdquo; replied the prime minister.He said Pakistan hopes to give good news regarding freeing of some foreigners &mdash; including Americans and Australians &mdash; kidnapped and held in Afghanistan.Asked about Dr Shakil Afridi, who has been in detention since 2011 after being taken into custody for helping American Central Intelligence Agency (CIA) in tracking down al-Qaeda chief Osama bin Laden, Imran Khan said it was a &ldquo;very emotive issue&rdquo;.&ldquo;Shakil Afridi in Pakistan is considered a spy. We in Pakistan always felt that we were an ally of the US and that we had been given the information about Osama bin Laden, we should have taken him out,&rdquo; he said.The prime minister pointed out: &ldquo;It was the ISI which gave the information which led to the location of Osama bin Laden. If you ask CIA, it was the ISI which gave the initial location through the phone connection.&rdquo;&ldquo;Pakistan was fighting the war for the US, Pakistan wasn&rsquo;t attacked at the time it hugely embarrassed Pakistan,&rdquo; the premier said. &ldquo;Pakistanis were embarrassed. Here we were, an ally of the US and the US did not trust us, and they actually came in and bombed and killed a man in our territory,&rdquo; he said.Imran Khan reminded that Pakistan lost 70,000 people in this fight. &ldquo;We were fighting this war for the US and we lost all these people fighting this war. So there was obviously a lot of anger about the way this whole thing was done. But that&rsquo;s all in the past,&rdquo; he said.About Dr Afridi, Imran Khan said there are some decisions in a democracy which even a prime minister finds difficult because &ldquo;we do have an opposition&rdquo;. &ldquo;But this is something that can be negotiated. We also have someone in prison in the US, a frail woman called Aafia Siddiqui, so yes we could negotiate some sort of a swap,&rdquo; said the premier.Dr Aafia Siddiqui, a neurologist, has been languishing in a United States jail on charges of trying to kill US agents and military officers in Afghanistan.The premier said the prisoner swap was not discussed in the meeting with Trump and that so far no negotiations had started, but Pakistan would be open to it.Asked if India said we would give up our nuclear weapons, would Pakistan? &ldquo;Yes,&rdquo; replied the premier. &ldquo;Because nuclear war is not an option. And between Pakistan and India, the idea of nuclear war is actually self-destruction, because we have two and a half thousand-mile border. Also, I think there&rsquo;s a realisation in the Sub-Continent and there was some incident that happened last February and we again had tension at the border. An Indian plane was shot down in Pakistan,&rdquo; he said.&ldquo;So there&rsquo;s a realisation and that&rsquo;s why I asked President Trump if he could play his role. The US is the most powerful country in the world, the only country that could mediate between Pakistan and India, and the only issue is Kashmir. The only reason for 70 years, that we have not been able to live like civilised neighbours, is because of Kashmir,&rdquo; he said.The interviewer mentioned India&rsquo;s response to Trump&rsquo;s comments on Narendra Modi asking the US president to mediate. &ldquo;I really feel that India should come on the table,&rdquo; reiterated the prime minister. &ldquo;The US could play a big part, President Trump certainly can play a big part. We&rsquo;re talking about 1.3 billion people on this Earth. Imagine the dividends of peace if somehow that issue could be resolved,&rdquo; he said.When asked about Iran wanting a nuclear weapon, the premier replied, &ldquo;I can&rsquo;t say but as a neighbour of Iran, we certainly hope that this does not become a full-blown conflict.&ldquo;We would love to help if we are asked because we are a neighbour of Iran. the last thing we want is a conflict in Iran, which will obviously affect us. Not just us, but it will affect oil prices, the United Arab Emirates, Saudi Arabia. We would do anything for a peaceful resolution,&rdquo; he said.The premier said there was absolutely no need to worry about Pakistan&rsquo;s nuclear weapons because Pakistan has one of the most professional armies. &ldquo;We have one of the most comprehensive command and control of our nuclear weapons. The United States knows about it because we share our intelligence with the US about the way we have the safety measures about our nuclear programme,&rdquo; he said.Imran said the whole idea of his meeting with Trump was that both the countries should be on one page. &ldquo;This mistrust which has dogged our relationship. Pakistan &mdash; was it an ally or was it an enemy? We were bombed by drone attacks by an ally,&rdquo; said the prime minister.&ldquo;All this mistrust in the past, we wanted to reset our relationship based on understanding that we are on the same page. We want peace in Afghanistan, Pakistan will do everything to help the Taliban come on the dialogue table so that there is peace. We struck that understanding today. I came out feeling that we really now are allies. Both of us want peace in Afghanistan and Pakistan will do everything possible to ensure that this peace process goes forward,&rdquo; he said.Imran Khan said the Pakistan military establishment was always mindful that there would be a two-front situation. &ldquo;So there would be the eastern front, which is India, and if Afghanistan was also in the Indian sphere of influence then Pakistan would be sandwiched between the two.&rdquo;He said owing to this worry the military always wanted what it called &ldquo;strategic depth&rdquo;.&ldquo;But this has changed. Today there is no concept in Pakistan of strategic depth. Because we feel that by interfering in Afghanistan, in order to secure the strategic depth, we have actually done a lot of damage to our own country. And for no rhyme or reason we have become partisan in Afghanistan&rsquo;s internal affairs,&rdquo; he said.He said that in the past there was always this impression that Pakistan Army is an independent entity and governments have no control over it. &ldquo;I can sit here and tell you that as I speak, the Pakistan Army is exactly behind the government&rsquo;s programme. Whatever policies from day one, whether it was peace with India, they were behind us,&rdquo; he said, pausing to mention that when he had decided to release the Indian pilot captured by the Army, they supported his decision.&ldquo;There is no difference between the policies of Pakistan&rsquo;s security forces or the policies of Pakistan&rsquo;s democratic government,&rdquo; he said.&ldquo;Prior to our government coming into power, past governments did not have the political will, we were the first government to start disarming militant groups. We have taken over their institutes, their seminaries, we have (placed) administrators there. For the first time we have decided there will be no armed militias inside our country,&rdquo; he said.Imran Khan mentioned that in 2004, under pressure from the US, Pakistan Army went into the tribal areas to flush out al-Qaeda. &ldquo;What happened was, after Tora Bora in Afghanistan, a few of the al-Qaeda moved down into our tribal areas which were semi-autonomous. When they sent the army in, you know armies are not meant to go into civilian areas. Whenever you send your army into civilian areas there will always be human rights abuses because there is no army there, there are just guerillas operating from villages. The collateral damage created what became the Pakistani Taliban. There was no Pakistani Taliban (group) before,&rdquo; he said.Meanwhile, Imran Khan said the government will provide every possible support to the US investors in Pakistan.He was talking to a delegation of Bower Group Asia led by its Senior US business executive, which called on him in Washington. The premier apprised the delegation about the investment opportunities in &lsquo;Naya Pakistan&rsquo;. He said measures are being taken for ease of doing business in Pakistan. Investment opportunities in Pakistan also came under discussion during the meeting. The delegation apprised the prime minister of its business projects in Pakistan.US-Pakistan Business Council delegation led by Myron Brilliant, Executive Vice President and Head of International Affairs of US Chamber of Commerce, also called on Prime Minister Imran Khan at Embassy of Pakistan in Washington DC.Meanwhile, a delegation of Pakistani-American donors called on Imran Khan in Washington. The donors reiterated their commitment to continue cooperation with Shaukat Khanum Memorial Cancer Hospital.\n\t\t\t",
        "date": "Wed, 24 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    },
    {
        "sr_no": 202,
        "newspaper": "The News",
        "headline": "Gen Bajwa, US military top brass discuss issues",
        "link": "https://www.thenews.com.pk/print/502920-gen-bajwa-us-military-top-brass-discuss-issues",
        "brief": "\n\n\t\t\t\tWASHINGTON: Chief of Army Staff (COAS) General Qamar Javed Bajwa visited Pentagon.On arrival, the COAS was received by Chairman Joint Chiefs of Staff (CJCS) General Joseph F Dunford. Gen Bajwa was presented guard of honour with 21-gun salute.The army chief had a discussion session with Acting Secretary of Defence Richard V. Spencer and Gen Dunford. Regional security, including Afghan peace process, was discussed. The US acting secretary and CJCS acknowledged contributions of Pak Army in war against terrorism and role towards Afghan peace process.The army chief also met Chief of Staff US Army General Mark A Milley. Matters related to security and bilateral military cooperation were discussed.Later, the COAS visited Arlington National Cemetery to pay homage to US National heroes. A special ceremony was held at the cemetery playing national anthem of both the countries.\n\t\t\t",
        "date": "Wed, 24 Jul 2019 00:00:00 +0500",
        "detailed_news": ""
    }
]